#pragma once

// Sea of Thieves (2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_AIModule_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class AIModule.BTNode
// 0x0030 (0x0058 - 0x0028)
class UBTNode : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	FString                                            NodeName;                                                 // 0x0030(0x0010) (Edit, ZeroConstructor)
	UBehaviorTree*                                     TreeAsset;                                                // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	UBTCompositeNode*                                  ParentNode;                                               // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0050(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTNode"));
		return ptr;
	}

};


// Class AIModule.BTAuxiliaryNode
// 0x0008 (0x0060 - 0x0058)
class UBTAuxiliaryNode : public UBTNode
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0058(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTAuxiliaryNode"));
		return ptr;
	}

};


// Class AIModule.BTDecorator
// 0x0008 (0x0068 - 0x0060)
class UBTDecorator : public UBTAuxiliaryNode
{
public:
	unsigned char                                      UnknownData00 : 7;                                        // 0x0060(0x0001)
	unsigned char                                      bInverseCondition : 1;                                    // 0x0060(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	TEnumAsByte<EBTFlowAbortMode>                      FlowAbortMode;                                            // 0x0064(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0065(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTDecorator"));
		return ptr;
	}

};


// Class AIModule.BTDecorator_BlackboardBase
// 0x0028 (0x0090 - 0x0068)
class UBTDecorator_BlackboardBase : public UBTDecorator
{
public:
	FBlackboardKeySelector                             BlackboardKey;                                            // 0x0068(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTDecorator_BlackboardBase"));
		return ptr;
	}

};


// Class AIModule.BTService
// 0x0010 (0x0070 - 0x0060)
class UBTService : public UBTAuxiliaryNode
{
public:
	float                                              Interval;                                                 // 0x0060(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RandomDeviation;                                          // 0x0064(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bCallTickOnSearchStart : 1;                               // 0x0068(0x0001) (Edit)
	unsigned char                                      bRestartTimerOnEachActivation : 1;                        // 0x0068(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0069(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTService"));
		return ptr;
	}

};


// Class AIModule.BTTaskNode
// 0x0008 (0x0060 - 0x0058)
class UBTTaskNode : public UBTNode
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0058(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTTaskNode"));
		return ptr;
	}

};


// Class AIModule.BTTask_BlackboardBase
// 0x0028 (0x0088 - 0x0060)
class UBTTask_BlackboardBase : public UBTTaskNode
{
public:
	FBlackboardKeySelector                             BlackboardKey;                                            // 0x0060(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTTask_BlackboardBase"));
		return ptr;
	}

};


// Class AIModule.BTTask_RunEQSQuery
// 0x0020 (0x00A8 - 0x0088)
class UBTTask_RunEQSQuery : public UBTTask_BlackboardBase
{
public:
	UEnvQuery*                                         QueryTemplate;                                            // 0x0088(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<FEnvNamedValue>                             QueryParams;                                              // 0x0090(0x0010) (Edit, ZeroConstructor)
	TEnumAsByte<EEnvQueryRunMode>                      RunMode;                                                  // 0x00A0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00A1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTTask_RunEQSQuery"));
		return ptr;
	}

};


// Class AIModule.BTTask_RotateToFaceBBEntry
// 0x0008 (0x0090 - 0x0088)
class UBTTask_RotateToFaceBBEntry : public UBTTask_BlackboardBase
{
public:
	float                                              Precision;                                                // 0x0088(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x008C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTTask_RotateToFaceBBEntry"));
		return ptr;
	}

};


// Class AIModule.EnvQueryContext
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.EnvQueryContext"));
		return ptr;
	}

};


// Class AIModule.EnvQueryNode
// 0x0008 (0x0030 - 0x0028)
class UEnvQueryNode : public UObject
{
public:
	int                                                VerNum;                                                   // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.EnvQueryNode"));
		return ptr;
	}

};


// Class AIModule.EnvQueryGenerator
// 0x0020 (0x0050 - 0x0030)
class UEnvQueryGenerator : public UEnvQueryNode
{
public:
	FString                                            OptionName;                                               // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	bool                                               NonShippingOnly;                                          // 0x0040(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
	UClass*                                            ItemType;                                                 // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.EnvQueryGenerator"));
		return ptr;
	}

};


// Class AIModule.EnvQueryTest
// 0x0140 (0x0170 - 0x0030)
class UEnvQueryTest : public UEnvQueryNode
{
public:
	int                                                TestOrder;                                                // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EEnvTestPurpose>                       TestPurpose;                                              // 0x0034(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EEnvTestFilterOperator>                MultipleContextFilterOp;                                  // 0x0035(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EEnvTestScoreOperator>                 MultipleContextScoreOp;                                   // 0x0036(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EEnvTestFilterType>                    FilterType;                                               // 0x0037(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	FAIDataProviderBoolValue                           BoolValue;                                                // 0x0038(0x0030) (Edit, DisableEditOnInstance)
	FAIDataProviderFloatValue                          FloatValueMin;                                            // 0x0068(0x0030) (Edit, DisableEditOnInstance)
	FAIDataProviderFloatValue                          FloatValueMax;                                            // 0x0098(0x0030) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x1];                                       // 0x00C8(0x0001) MISSED OFFSET
	TEnumAsByte<EEnvTestScoreEquation>                 ScoringEquation;                                          // 0x00C9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EEnvQueryTestClamping>                 ClampMinType;                                             // 0x00CA(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EEnvQueryTestClamping>                 ClampMaxType;                                             // 0x00CB(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET
	FAIDataProviderFloatValue                          ScoreClampMin;                                            // 0x00D0(0x0030) (Edit, DisableEditOnInstance)
	FAIDataProviderFloatValue                          ScoreClampMax;                                            // 0x0100(0x0030) (Edit, DisableEditOnInstance)
	FAIDataProviderFloatValue                          ScoringFactor;                                            // 0x0130(0x0030) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0160(0x0008) MISSED OFFSET
	unsigned char                                      bWorkOnFloatValues : 1;                                   // 0x0168(0x0001)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0169(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.EnvQueryTest"));
		return ptr;
	}

};


// Class AIModule.AIResourceInterface
// 0x0000 (0x0028 - 0x0028)
class UAIResourceInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIResourceInterface"));
		return ptr;
	}

};


// Class AIModule.PathFollowingComponent
// 0x01F0 (0x02B8 - 0x00C8)
class UPathFollowingComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x00C8(0x0058) MISSED OFFSET
	UNavMovementComponent*                             MovementComp;                                             // 0x0120(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0128(0x0008) MISSED OFFSET
	ANavigationData*                                   MyNavData;                                                // 0x0130(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0xBC];                                      // 0x0138(0x00BC) MISSED OFFSET
	unsigned char                                      bUseVisibilityTestsSimplification : 1;                    // 0x01F4(0x0001) (Config)
	unsigned char                                      UnknownData03[0xC3];                                      // 0x01F5(0x00C3) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.PathFollowingComponent"));
		return ptr;
	}


	void OnActorBump(AActor* SelfActor, AActor* OtherActor, const FVector& NormalImpulse, const FHitResult& Hit);
	FVector GetPathDestination();
	TEnumAsByte<EPathFollowingAction> GetPathActionType();
};


// Class AIModule.AIAsyncTaskBlueprintProxy
// 0x0038 (0x0060 - 0x0028)
class UAIAsyncTaskBlueprintProxy : public UObject
{
public:
	FScriptMulticastDelegate                           OnSuccess;                                                // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnFail;                                                   // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0048(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIAsyncTaskBlueprintProxy"));
		return ptr;
	}


	void OnMoveCompleted(const FAIRequestID& RequestID, TEnumAsByte<EPathFollowingResult> MovementResult);
};


// Class AIModule.AIBlueprintHelperLibrary
// 0x0000 (0x0028 - 0x0028)
class UAIBlueprintHelperLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIBlueprintHelperLibrary"));
		return ptr;
	}


	static void UnlockAIResourcesWithAnimation(UAnimInstance* AnimInstance, bool bUnlockMovement, bool UnlockAILogic);
	static APawn* SpawnAIFromClass(UObject* WorldContextObject, UClass* PawnClass, UBehaviorTree* BehaviorTree, const FVector& Location, const FRotator& Rotation, bool bNoCollisionFail);
	static void SendAIMessage(APawn* Target, const FName& Message, UObject* MessageSource, bool bSuccess);
	static void LockAIResourcesWithAnimation(UAnimInstance* AnimInstance, bool bLockMovement, bool LockAILogic);
	static bool IsValidAIRotation(const FRotator& Rotation);
	static bool IsValidAILocation(const FVector& Location);
	static bool IsValidAIDirection(const FVector& DirectionVector);
	static UBlackboardComponent* GetBlackboard(AActor* Target);
	static AAIController* GetAIController(AActor* ControlledActor);
	static UAIAsyncTaskBlueprintProxy* CreateMoveToProxyObject(UObject* WorldContextObject, APawn* Pawn, const FVector& Destination, AActor* TargetActor, float AcceptanceRadius, bool bStopOnOverlap);
};


// Class AIModule.PawnActionsComponent
// 0x0038 (0x0100 - 0x00C8)
class UPawnActionsComponent : public UActorComponent
{
public:
	APawn*                                             ControlledPawn;                                           // 0x00C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<FPawnActionStack>                           ActionStacks;                                             // 0x00D0(0x0010) (ZeroConstructor)
	TArray<FPawnActionEvent>                           ActionEvents;                                             // 0x00E0(0x0010) (ZeroConstructor)
	UPawnAction*                                       CurrentAction;                                            // 0x00F0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00F8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.PawnActionsComponent"));
		return ptr;
	}


	bool K2_PushAction(UPawnAction* NewAction, TEnumAsByte<EAIRequestPriority> Priority, UObject* Instigator);
	static bool K2_PerformAction(APawn* Pawn, UPawnAction* Action, TEnumAsByte<EAIRequestPriority> Priority);
	TEnumAsByte<EPawnActionAbortState> K2_ForceAbortAction(UPawnAction* ActionToAbort);
	TEnumAsByte<EPawnActionAbortState> K2_AbortAction(UPawnAction* ActionToAbort);
};


// Class AIModule.AIPerceptionListenerInterface
// 0x0000 (0x0028 - 0x0028)
class UAIPerceptionListenerInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIPerceptionListenerInterface"));
		return ptr;
	}

};


// Class AIModule.BlackboardKeyType
// 0x0008 (0x0030 - 0x0028)
class UBlackboardKeyType : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BlackboardKeyType"));
		return ptr;
	}

};


// Class AIModule.BehaviorTreeTypes
// 0x0000 (0x0028 - 0x0028)
class UBehaviorTreeTypes : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BehaviorTreeTypes"));
		return ptr;
	}

};


// Class AIModule.GenericTeamAgentInterface
// 0x0000 (0x0028 - 0x0028)
class UGenericTeamAgentInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.GenericTeamAgentInterface"));
		return ptr;
	}

};


// Class AIModule.AIController
// 0x0090 (0x04C0 - 0x0430)
class AAIController : public AController
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0430(0x0028) MISSED OFFSET
	unsigned char                                      bLOSflag : 1;                                             // 0x0458(0x0001)
	unsigned char                                      bSkipExtraLOSChecks : 1;                                  // 0x0458(0x0001)
	unsigned char                                      bAllowStrafe : 1;                                         // 0x0458(0x0001)
	unsigned char                                      bWantsPlayerState : 1;                                    // 0x0458(0x0001)
	unsigned char                                      bDisableControlRotation : 1;                              // 0x0458(0x0001)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0459(0x0007) MISSED OFFSET
	UPathFollowingComponent*                           PathFollowingComponent;                                   // 0x0460(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	UBrainComponent*                                   BrainComponent;                                           // 0x0468(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	UAIPerceptionComponent*                            PerceptionComponent;                                      // 0x0470(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	UPawnActionsComponent*                             ActionsComp;                                              // 0x0478(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	UBlackboardComponent*                              Blackboard;                                               // 0x0480(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	UGameplayTasksComponent*                           CachedGameplayTasksComponent;                             // 0x0488(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0490(0x0010) MISSED OFFSET
	FScriptMulticastDelegate                           ReceiveMoveCompleted;                                     // 0x04A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x10];                                      // 0x04B0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIController"));
		return ptr;
	}


	bool UseBlackboard(UBlackboardData* BlackboardAsset, UBlackboardComponent** BlackboardComponent);
	void SetMoveBlockDetection(bool bEnable);
	bool RunBehaviorTree(UBehaviorTree* BTAsset);
	void OnUsingBlackBoard(UBlackboardComponent* BlackboardComp, UBlackboardData* BlackboardAsset);
	void OnPossess(APawn* PossessedPawn);
	void OnGameplayTaskResourcesClaimed(const FGameplayResourceSet& NewlyClaimed, const FGameplayResourceSet& FreshlyReleased);
	TEnumAsByte<EPathFollowingRequestResult> MoveToLocation(const FVector& Dest, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bProjectDestinationToNavigation, bool bCanStrafe, UClass* FilterClass, bool bAllowPartialPath);
	TEnumAsByte<EPathFollowingRequestResult> MoveToActor(AActor* Goal, float AcceptanceRadius, bool bStopOnOverlap, bool bUsePathfinding, bool bCanStrafe, UClass* FilterClass, bool bAllowPartialPath);
	void K2_SetFocus(AActor* NewFocus);
	void K2_SetFocalPoint(const FVector& FP);
	void K2_ClearFocus();
	bool HasPartialPath();
	UPathFollowingComponent* GetPathFollowingComponent();
	TEnumAsByte<EPathFollowingStatus> GetMoveStatus();
	FVector GetImmediateMoveDestination();
	AActor* GetFocusActor();
	FVector GetFocalPointOnActor(AActor* Actor);
	FVector GetFocalPoint();
	UAIPerceptionComponent* GetAIPerceptionComponent();
};


// Class AIModule.DetourCrowdAIController
// 0x0000 (0x04C0 - 0x04C0)
class ADetourCrowdAIController : public AAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.DetourCrowdAIController"));
		return ptr;
	}

};


// Class AIModule.AIDataProvider
// 0x0000 (0x0028 - 0x0028)
class UAIDataProvider : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIDataProvider"));
		return ptr;
	}

};


// Class AIModule.CustomDataProviderObject
// 0x0000 (0x0028 - 0x0028)
class UCustomDataProviderObject : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.CustomDataProviderObject"));
		return ptr;
	}

};


// Class AIModule.AIDataProvider_QueryParamFromCustomObjectProperty
// 0x0020 (0x0048 - 0x0028)
class UAIDataProvider_QueryParamFromCustomObjectProperty : public UAIDataProvider
{
public:
	FCustomDataProviderObjectPropertySelector          ObjectProperty;                                           // 0x0028(0x0010) (Edit)
	float                                              FloatValue;                                               // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                IntValue;                                                 // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               BoolValue;                                                // 0x0040(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0041(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIDataProvider_QueryParamFromCustomObjectProperty"));
		return ptr;
	}

};


// Class AIModule.AIDataProvider_QueryParams
// 0x0018 (0x0040 - 0x0028)
class UAIDataProvider_QueryParams : public UAIDataProvider
{
public:
	FName                                              ParamName;                                                // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FloatValue;                                               // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                IntValue;                                                 // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               BoolValue;                                                // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIDataProvider_QueryParams"));
		return ptr;
	}

};


// Class AIModule.AIHotSpotManager
// 0x0000 (0x0028 - 0x0028)
class UAIHotSpotManager : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIHotSpotManager"));
		return ptr;
	}

};


// Class AIModule.AISystem
// 0x00B0 (0x00F0 - 0x0040)
class UAISystem : public UAISystemBase
{
public:
	FStringClassReference                              PerceptionSystemClassName;                                // 0x0040(0x0010) (Edit, ZeroConstructor, Config, GlobalConfig)
	FStringClassReference                              HotSpotManagerClassName;                                  // 0x0050(0x0010) (Edit, ZeroConstructor, Config, GlobalConfig)
	float                                              AcceptanceRadius;                                         // 0x0060(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bFinishMoveOnGoalOverlap;                                 // 0x0064(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bAcceptPartialPaths;                                      // 0x0065(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bAllowStrafing;                                           // 0x0066(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	bool                                               bEnableBTAITasks;                                         // 0x0067(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, GlobalConfig, IsPlainOldData)
	UBehaviorTreeManager*                              BehaviorTreeManager;                                      // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	UEnvQueryManager*                                  EnvironmentQueryManager;                                  // 0x0070(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	UAIPerceptionSystem*                               PerceptionSystem;                                         // 0x0078(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<UAIAsyncTaskBlueprintProxy*>                AllProxyObjects;                                          // 0x0080(0x0010) (ZeroConstructor, Transient)
	UAIHotSpotManager*                                 HotSpotManager;                                           // 0x0090(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x58];                                      // 0x0098(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISystem"));
		return ptr;
	}


	void AILoggingVerbose();
	void AIIgnorePlayers();
};


// Class AIModule.AISense
// 0x0060 (0x0088 - 0x0028)
class UAISense : public UObject
{
public:
	FColor                                             DebugDrawColor;                                           // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	FString                                            DebugName;                                                // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	float                                              DefaultExpirationAge;                                     // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	TEnumAsByte<EAISenseNotifyType>                    NotifyType;                                               // 0x0044(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	unsigned char                                      bWantsNewPawnNotification : 1;                            // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance)
	unsigned char                                      bAutoRegisterAllPawnsAsSources : 1;                       // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	UAIPerceptionSystem*                               PerceptionSystemInstance;                                 // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x30];                                      // 0x0058(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense"));
		return ptr;
	}

};


// Class AIModule.AIPerceptionSystem
// 0x0100 (0x0128 - 0x0028)
class UAIPerceptionSystem : public UObject
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0028(0x0058) MISSED OFFSET
	TArray<UAISense*>                                  Senses;                                                   // 0x0080(0x0010) (ZeroConstructor)
	float                                              PerceptionAgingRate;                                      // 0x0090(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x94];                                      // 0x0094(0x0094) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIPerceptionSystem"));
		return ptr;
	}


	static void ReportPerceptionEvent(UObject* WorldContext, UAISenseEvent* PerceptionEvent);
	void ReportEvent(UAISenseEvent* PerceptionEvent);
	static bool RegisterPerceptionStimuliSource(UObject* WorldContext, UClass* Sense, AActor* Target);
	void OnPerceptionStimuliSourceEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	static UClass* GetSenseClassForStimulus(UObject* WorldContext, const FAIStimulus& Stimulus);
};


// Class AIModule.AIPerceptionComponent
// 0x0100 (0x01C8 - 0x00C8)
class UAIPerceptionComponent : public UActorComponent
{
public:
	float                                              HearingRange;                                             // 0x00C8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData)
	float                                              LoSHearingRange;                                          // 0x00CC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData)
	float                                              SightRadius;                                              // 0x00D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData)
	float                                              LoseSightRadius;                                          // 0x00D4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData)
	float                                              PeripheralVisionAngle;                                    // 0x00D8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET
	TArray<UAISenseConfig*>                            SensesConfig;                                             // 0x00E0(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance)
	UClass*                                            DominantSense;                                            // 0x00F0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x00F8(0x0010) MISSED OFFSET
	AAIController*                                     AIOwner;                                                  // 0x0108(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x80];                                      // 0x0110(0x0080) MISSED OFFSET
	FScriptMulticastDelegate                           OnPerceptionUpdated;                                      // 0x0190(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnTargetPerceptionUpdated;                                // 0x01A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x18];                                      // 0x01B0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIPerceptionComponent"));
		return ptr;
	}


	void RequestStimuliListenerUpdate();
	void OnOwnerEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	bool IsIgnored(AActor* Actor);
	void GetPerceivedHostileActors(TArray<AActor*>* OutActors);
	void GetPerceivedActors(UClass* SenseToUse, TArray<AActor*>* OutActors);
	bool GetActorsPerception(AActor* Actor, FActorPerceptionBlueprintInfo* Info);
};


// Class AIModule.AIPerceptionStimuliSourceComponent
// 0x0018 (0x00E0 - 0x00C8)
class UAIPerceptionStimuliSourceComponent : public UActorComponent
{
public:
	unsigned char                                      bAutoRegisterAsSource : 1;                                // 0x00C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Config)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00C9(0x0007) MISSED OFFSET
	TArray<UClass*>                                    RegisterAsSourceForSenses;                                // 0x00D0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIPerceptionStimuliSourceComponent"));
		return ptr;
	}


	void UnregisterFromSense(UClass* SenseClass);
	void UnregisterFromPerceptionSystem();
	void RegisterWithPerceptionSystem();
	void RegisterForSense(UClass* SenseClass);
};


// Class AIModule.AIResource_Movement
// 0x0000 (0x0038 - 0x0038)
class UAIResource_Movement : public UGameplayTaskResource
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIResource_Movement"));
		return ptr;
	}

};


// Class AIModule.AIResource_Logic
// 0x0000 (0x0038 - 0x0038)
class UAIResource_Logic : public UGameplayTaskResource
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AIResource_Logic"));
		return ptr;
	}

};


// Class AIModule.AISense_Blueprint
// 0x0028 (0x00B0 - 0x0088)
class UAISense_Blueprint : public UAISense
{
public:
	UClass*                                            ListenerDataType;                                         // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<UAIPerceptionComponent*>                    ListenerContainer;                                        // 0x0090(0x0010) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor)
	TArray<UAISenseEvent*>                             UnprocessedEvents;                                        // 0x00A0(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense_Blueprint"));
		return ptr;
	}


	float OnUpdate(TArray<UAISenseEvent*> EventsToProcess);
	void OnListenerUpdated(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
	void OnListenerUnregistered(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
	void OnListenerRegistered(AActor* ActorListener, UAIPerceptionComponent* PerceptionComponent);
	void K2_OnNewPawn(APawn* NewPawn);
	void GetAllListenerComponents(TArray<UAIPerceptionComponent*>* ListenerComponents);
	void GetAllListenerActors(TArray<AActor*>* ListenerActors);
};


// Class AIModule.AISense_Damage
// 0x0010 (0x0098 - 0x0088)
class UAISense_Damage : public UAISense
{
public:
	TArray<FAIDamageEvent>                             RegisteredEvents;                                         // 0x0088(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense_Damage"));
		return ptr;
	}


	static void ReportDamageEvent(UObject* WorldContext, AActor* DamagedActor, AActor* Instigator, float DamageAmount, const FVector& EventLocation, const FVector& HitLocation);
};


// Class AIModule.AISense_Hearing
// 0x0098 (0x0120 - 0x0088)
class UAISense_Hearing : public UAISense
{
public:
	int                                                MaxNoisesPerTick;                                         // 0x0088(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	int                                                MaxNoisesStored;                                          // 0x008C(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0090(0x0008) MISSED OFFSET
	TArray<FAINoiseEvent>                              NoiseEventsArrayA;                                        // 0x0098(0x0010) (ZeroConstructor)
	TArray<FAINoiseEvent>                              NoiseEventsArrayB;                                        // 0x00A8(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x10];                                      // 0x00B8(0x0010) MISSED OFFSET
	float                                              SpeedOfSoundSq;                                           // 0x00C8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x54];                                      // 0x00CC(0x0054) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense_Hearing"));
		return ptr;
	}


	static void ReportNoiseEvent(UObject* WorldContext, const FVector& NoiseLocation, float Loudness, AActor* Instigator, float MaxRange, const FName& Tag);
};


// Class AIModule.AISense_Prediction
// 0x0010 (0x0098 - 0x0088)
class UAISense_Prediction : public UAISense
{
public:
	TArray<FAIPredictionEvent>                         RegisteredEvents;                                         // 0x0088(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense_Prediction"));
		return ptr;
	}


	static void RequestPawnPredictionEvent(APawn* Requestor, AActor* PredictedActor, float PredictionTime);
	static void RequestControllerPredictionEvent(AAIController* Requestor, AActor* PredictedActor, float PredictionTime);
};


// Class AIModule.AISense_Sight
// 0x00C8 (0x0150 - 0x0088)
class UAISense_Sight : public UAISense
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0088(0x00B0) MISSED OFFSET
	int                                                MaxTracesPerTick;                                         // 0x0138(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              HighImportanceQueryDistanceThreshold;                     // 0x013C(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0140(0x0004) MISSED OFFSET
	float                                              MaxQueryImportance;                                       // 0x0144(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              SightLimitQueryImportance;                                // 0x0148(0x0004) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x014C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense_Sight"));
		return ptr;
	}

};


// Class AIModule.AISense_Team
// 0x0010 (0x0098 - 0x0088)
class UAISense_Team : public UAISense
{
public:
	TArray<FAITeamStimulusEvent>                       RegisteredEvents;                                         // 0x0088(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense_Team"));
		return ptr;
	}

};


// Class AIModule.AISense_Touch
// 0x0010 (0x0098 - 0x0088)
class UAISense_Touch : public UAISense
{
public:
	TArray<FAITouchEvent>                              RegisteredEvents;                                         // 0x0088(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISense_Touch"));
		return ptr;
	}

};


// Class AIModule.AISenseBlueprintListener
// 0x0000 (0x00A8 - 0x00A8)
class UAISenseBlueprintListener : public UUserDefinedStruct
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseBlueprintListener"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig
// 0x0008 (0x0030 - 0x0028)
class UAISenseConfig : public UObject
{
public:
	float                                              MaxAge;                                                   // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bStartsEnabled : 1;                                       // 0x002C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig_Blueprint
// 0x0008 (0x0038 - 0x0030)
class UAISenseConfig_Blueprint : public UAISenseConfig
{
public:
	UClass*                                            Implementation;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig_Blueprint"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig_Damage
// 0x0008 (0x0038 - 0x0030)
class UAISenseConfig_Damage : public UAISenseConfig
{
public:
	UClass*                                            Implementation;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig_Damage"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig_Hearing
// 0x0018 (0x0048 - 0x0030)
class UAISenseConfig_Hearing : public UAISenseConfig
{
public:
	UClass*                                            Implementation;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)
	float                                              HearingRange;                                             // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LoSHearingRange;                                          // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bUseLoSHearing : 1;                                       // 0x0040(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0041(0x0003) MISSED OFFSET
	FAISenseAffiliationFilter                          DetectionByAffiliation;                                   // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig_Hearing"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig_Prediction
// 0x0000 (0x0030 - 0x0030)
class UAISenseConfig_Prediction : public UAISenseConfig
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig_Prediction"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig_Sight
// 0x0020 (0x0050 - 0x0030)
class UAISenseConfig_Sight : public UAISenseConfig
{
public:
	UClass*                                            Implementation;                                           // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NoClear, IsPlainOldData)
	float                                              SightRadius;                                              // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              LoseSightRadius;                                          // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              PeripheralVisionAngleDegrees;                             // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	FAISenseAffiliationFilter                          DetectionByAffiliation;                                   // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	float                                              AutoSuccessRangeFromLastSeenLocation;                     // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x004C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig_Sight"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig_Team
// 0x0000 (0x0030 - 0x0030)
class UAISenseConfig_Team : public UAISenseConfig
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig_Team"));
		return ptr;
	}

};


// Class AIModule.AISenseConfig_Touch
// 0x0000 (0x0030 - 0x0030)
class UAISenseConfig_Touch : public UAISenseConfig
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseConfig_Touch"));
		return ptr;
	}

};


// Class AIModule.AISenseEvent
// 0x0000 (0x0028 - 0x0028)
class UAISenseEvent : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseEvent"));
		return ptr;
	}

};


// Class AIModule.AISenseEvent_Damage
// 0x0030 (0x0058 - 0x0028)
class UAISenseEvent_Damage : public UAISenseEvent
{
public:
	FAIDamageEvent                                     Event;                                                    // 0x0028(0x0030) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseEvent_Damage"));
		return ptr;
	}

};


// Class AIModule.AISenseEvent_Hearing
// 0x0030 (0x0058 - 0x0028)
class UAISenseEvent_Hearing : public UAISenseEvent
{
public:
	FAINoiseEvent                                      Event;                                                    // 0x0028(0x0030) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISenseEvent_Hearing"));
		return ptr;
	}

};


// Class AIModule.AISightTargetInterface
// 0x0000 (0x0028 - 0x0028)
class UAISightTargetInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AISightTargetInterface"));
		return ptr;
	}

};


// Class AIModule.AITask
// 0x0008 (0x0060 - 0x0058)
class UAITask : public UGameplayTask
{
public:
	AAIController*                                     OwnerController;                                          // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AITask"));
		return ptr;
	}

};


// Class AIModule.AITask_MoveTo
// 0x0050 (0x00B0 - 0x0060)
class UAITask_MoveTo : public UAITask
{
public:
	FScriptMulticastDelegate                           OnRequestFailed;                                          // 0x0060(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnMoveFinished;                                           // 0x0070(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FVector                                            MoveGoalLocation;                                         // 0x0080(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x008C(0x000C) MISSED OFFSET
	AActor*                                            MoveGoalActor;                                            // 0x0098(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MoveAcceptanceRadius;                                     // 0x00A0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldStopOnOverlap;                                     // 0x00A4(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldAcceptPartialPath;                                 // 0x00A5(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldUsePathfinding;                                    // 0x00A6(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x9];                                       // 0x00A7(0x0009) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.AITask_MoveTo"));
		return ptr;
	}


	static UAITask_MoveTo* AIMoveTo(AAIController* Controller, const FVector& GoalLocation, AActor* GoalActor, float AcceptanceRadius, TEnumAsByte<EAIOptionFlag> StopOnOverlap, TEnumAsByte<EAIOptionFlag> AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic);
};


// Class AIModule.BrainComponent
// 0x0060 (0x0128 - 0x00C8)
class UBrainComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C8(0x0008) MISSED OFFSET
	UBlackboardComponent*                              BlackboardComp;                                           // 0x00D0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	AAIController*                                     AIOwner;                                                  // 0x00D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x48];                                      // 0x00E0(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BrainComponent"));
		return ptr;
	}


	void StopLogic(const FString& Reason);
	void RestartLogic();
};


// Class AIModule.BehaviorTreeComponent
// 0x0160 (0x0288 - 0x0128)
class UBehaviorTreeComponent : public UBrainComponent
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0128(0x0020) MISSED OFFSET
	TArray<UBTNode*>                                   NodeInstances;                                            // 0x0148(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0x130];                                     // 0x0158(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BehaviorTreeComponent"));
		return ptr;
	}


	void SetDynamicSubtree(const FGameplayTag& InjectTag, UBehaviorTree* BehaviorAsset);
	float GetTagCooldownEndTime(const FGameplayTag& CooldownTag);
	void AddCooldownTagDuration(const FGameplayTag& CooldownTag, float CoolDownDuration, bool bAddToExistingDuration);
};


// Class AIModule.BTCompositeNode
// 0x0030 (0x0088 - 0x0058)
class UBTCompositeNode : public UBTNode
{
public:
	TArray<FBTCompositeChild>                          Children;                                                 // 0x0058(0x0010) (ZeroConstructor)
	TArray<UBTService*>                                Services;                                                 // 0x0068(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0078(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BTCompositeNode"));
		return ptr;
	}

};


// Class AIModule.BehaviorTree
// 0x0038 (0x0060 - 0x0028)
class UBehaviorTree : public UObject
{
public:
	UBTCompositeNode*                                  RootNode;                                                 // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	UBlackboardData*                                   BlackboardAsset;                                          // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<UBTDecorator*>                              RootDecorators;                                           // 0x0038(0x0010) (ZeroConstructor)
	TArray<FBTDecoratorLogic>                          RootDecoratorOps;                                         // 0x0048(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0058(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BehaviorTree"));
		return ptr;
	}

};


// Class AIModule.BehaviorTreeManager
// 0x0028 (0x0050 - 0x0028)
class UBehaviorTreeManager : public UObject
{
public:
	int                                                MaxDebuggerSteps;                                         // 0x0028(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	TArray<FBehaviorTreeTemplateInfo>                  LoadedTemplates;                                          // 0x0030(0x0010) (ZeroConstructor)
	TArray<UBehaviorTreeComponent*>                    ActiveComponents;                                         // 0x0040(0x0010) (ExportObject, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BehaviorTreeManager"));
		return ptr;
	}

};


// Class AIModule.BlackboardKeyType_Enum
// 0x0020 (0x0050 - 0x0030)
class UBlackboardKeyType_Enum : public UBlackboardKeyType
{
public:
	UEnum*                                             EnumType;                                                 // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	FString                                            EnumName;                                                 // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      bIsEnumNameValid : 1;                                     // 0x0048(0x0001) (Edit, DisableEditOnInstance, EditConst)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class AIModule.BlackboardKeyType_Enum"));
		return ptr;
	}

};


// Class AIModule.BlackboardKeyType_NativeEnum
// 0x0018 (0x0048 - 0x0030)
class UBlackboardKeyType_NativeEnum : public UBlackboardKeyType
{
public:
	FString                                            EnumName;                                                 // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
