#pragma once

// Sea of Thieves (2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct DS_ShoresOfGoldVariables.DS_ShoresOfGoldVariables
// 0x00B8
struct FDS_ShoresOfGoldVariables
{
	class AActor*                                      Grace_85_0E21BBB242FF38D6654E898B3348A9BA;                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      GraceProxy_86_DEB390E749BD4600B618F8BEC6D99727;           // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      MedallionCompassLocation_74_210E0A434CE88632D3C5DC9EB3ED9F09;// 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      GoldHoarderLockLocation_77_01A2D56A4FC25D0098D2AFA05CFEE8EB;// 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      MedallionLock_80_838740604A8E54A7452E57A7D6A61FC9;        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      GoldHoarderLock_84_6EA8818846D7E23FDF9AC2A7CABE7868;      // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      PirateLord_89_682636914D745EEB901CE1B9DD03907F;           // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      PirateLordProxy_93_E49D151C48E415CECADA8686ECE2FBA1;      // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      CoinSpawnLocation_96_21F92101460E6E44AC8F4694077AFA82;    // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      GoldHoarderEncounterLocation_100_9AD80D0F4841B3E2129BA1A1EF21DC55;// 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ChasmDoorLock_105_263C487F4B06C92938D2D7878CF6CF6B;       // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      TreasureRoomExit_108_803D645D47DACE874A769CAA4B4F1A91;    // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      CoinRevealTrigger_111_ECD6A5D44D08DBAB195AD5BE8DA6328B;   // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TAssetPtr<class AActor>                            TributePeakActor_114_0AB5EA7D43A8D127A54C39BBC4722991;    // 0x0068(0x0020) (Edit, BlueprintVisible)
	class AActor*                                      EntranceTeleportLocation_117_BFB45C804FEB74A17AAC9F82E6077255;// 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      TreasureTeleportLocation_120_9E73D0164A2D988B159D69A1A3076D2E;// 0x0090(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      CoinRevealReaction_123_35F76E3E4EB6E61253150C84813D297A;  // 0x0098(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ChasmDoorOpenReaction_126_6CF322804F242E19F7A4568923625C22;// 0x00A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      CaveMusic_129_6A45D6BB46860E739D26A9A3487C47F1;           // 0x00A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      TeleportStatue1_132_AE843F4A4E725F7CE115F0B6061CB354;     // 0x00B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
