#pragma once

// Sea of Thieves (2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_BP_Humanoid_FirstPerson_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Humanoid_FirstPerson.BP_Humanoid_FirstPerson_C
// 0x12C6C (0x14E9C - 0x2230)
class UBP_Humanoid_FirstPerson_C : public UFirstPersonAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x2230(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_D0188A614D143FB7821BC9B3CCA7655C;      // 0x2238(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2B8700FB4F8D370CE8590D99226C071C;// 0x2280(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_129FE3024D442BFB00CF33AD59DB42E7;// 0x2310(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_948AA19D4BBB26DE46D6F68AF0632D40;// 0x2350(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7DBB79E4444F18C00CFDD7ADF5C641C7;// 0x2390(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C156E52048447FFB87EC07A8137FDC76;// 0x23D8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8E6667E84202C651009EC68662D42034;// 0x2420(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_28B2F24E47E6D3C18AEA81846281D7E0;// 0x2468(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2B4A8ADF431650833CDDB3927BF5EF47;// 0x24B0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E9951E0C45CA7B3A40F1CEA234CE79F2;// 0x24F8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FE0684FA4DA5B73D4467C38655260D49;// 0x2540(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_9CD9B4E44081175D8066C99FEABD575B;// 0x2588(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1A10FD3243E979D42CB92A9E0389C99A;// 0x2628(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_577F1696465934275E74F6AFC6058707;// 0x2698(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F2A6A00042396DF212C52FAA8705B9AA;// 0x26E8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B4D1EFE4481D2C843B7A31ABD02DA5B7;// 0x2798(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A3C480144612CFBAE0DE2D82CC901541;// 0x2848(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_29ACD86045A3D644E2F06780D22FCF70;// 0x28E8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7B6B2E8243531812A43AC695DD2D4695;// 0x2958(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_777B7581432DB72AAC7AE0B7DB4182B4;// 0x29A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FF2E30AE470566A6EE0A99995C40BF74;// 0x29F0(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1A084AFE4178CB4E0AD3CB9CD222C27E;// 0x2A98(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7BFD74D44C548AC8CEE02CB3AE486F0D;// 0x2B08(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1C7E4DA545A0A63D0A7423A3FDA2D431;// 0x2B78(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F165A49C4CA138DCFCF69DBB3F83541C;// 0x2BC8(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3B249D6E479FA946B34141903D1CBFB0;// 0x2C18(0x00C0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE1161194E27CD1CC32B62B670B372A8;// 0x2CD8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F368A7F24F506C771BD82C95752E325A;// 0x2D28(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4D1B47F34381B8AE4E27CBAF554168A5;// 0x2D78(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_36F5984B49D837B85137C49FC9A9D17B;// 0x2DC8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DB01F11D48F268904277C9ADA2A9901C;// 0x2E18(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_06E2CB1F434A1E99FFCCFFB90CBE492F;// 0x2E60(0x00A8)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8EA8C45F40931A31D46406AB429D0C1D;// 0x2F08(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B8D1E2154FA5AC99B3E64FA52EE07EC1;// 0x2F58(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3202085A40AD5E0620EF6D9C6D5E3616;// 0x2FA8(0x00C0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_026EDE994444DC429291CD97E00E8BEB;// 0x3068(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_46D571D0486B8F37BE908088A724C9BE;// 0x30B8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE271CFE4BFA90BF3160E685A1A20241;// 0x3108(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_83B7F5534C077447DA94E087915D6503;// 0x3158(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BFB85F1345EBB8F3FC4622BA43CB4367;// 0x31A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_90F33FA84C5AB34A48B12F996703BEDE;// 0x31F0(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_DDE6B56447B642ACB11217A5006B1FB3;// 0x3298(0x0090)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6D7BA53247CC9BEC955ABBB519359F68;// 0x3328(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D0EC7340490F4016C6018CBE68F596D2;// 0x33C8(0x0090)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_64B9A7DD438218B1339E0DA17224AF33;// 0x3458(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_34E8653443F400DD7BCA0BACEA3F37AE;// 0x3508(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AAE2E5140E335DCB6C2358F14E4D8CA;// 0x3598(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F900935F49D992230DD78B8AFDC87012;// 0x35D8(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA9D62B442CAC6470510759CC47028BA;// 0x3648(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_927CB34045C3A632F15D3A87C93E8882;// 0x3688(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79EAD2674E9004B0943CE99382032BB3;// 0x36C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B28A44EA43484CF3CAA41B9D0A1466F9;// 0x3708(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DBF6FFF4FABF7A1FB5D54AFB78C34B3;// 0x3748(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_753E6A3C4E2B9ADDBF7DE6A2F37B4149;// 0x3788(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB3262B1482BEF0F8EB5EA8DED3AA27E;// 0x37C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C1B654AE48446548146379A0ADA342A5;// 0x3808(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94D232914CE207A62C243DABF29B1D39;// 0x3848(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D49029824FFABD54055266A4B1D0F078;// 0x3888(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F5409A74D39BAAE12B073AEAD11C830;// 0x38C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0393B7734364FB279A07BE8DD4E26B32;// 0x3908(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_81AE75D943BEE0611AADAF96519B79F8;// 0x3948(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E105872B47A850DA5C0E0BA4DF987AA9;// 0x3A50(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_605B167D4104185D2B3964A24CF41E92;// 0x3A98(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3839F7E14129DC8756D436B3A173A97D;// 0x3AD0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_820D617B441B04665F9DB4A864DDAE30;// 0x3B18(0x00B0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2414FD2A4C9A5AA676DB4E951A73E5C6;// 0x3BC8(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_27E78F814A610563337C299CDC625C0B;// 0x3C00(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1BA077CA47D946B39F36FC81806A0EB5;// 0x3D08(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_72D46F714D55C230DC4464A3BC9E7B55;// 0x3D50(0x00B0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2CED4B3143C99B8CBDBA079CAE7376A0;// 0x3E00(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DF8030724C0B3E88EB5945B61A276B65;// 0x3E38(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3E586B9048B5B51BB773DCA45D16985D;// 0x3F40(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_07069C9443BEB11D4085E5A234862D72;// 0x3F88(0x00B0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_EDE1A19541714B467DB4AD9288E64751;// 0x4038(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5218ABC940DE9A2A8C531BAE965970BB;// 0x4070(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7A9A7E4413865A4757C078B26ADD1E4;// 0x4178(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_76D380754989701A9BEE7C86DC27E3E5;// 0x41C0(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_983A065D44F2D1BF202A8091B1EC744F;// 0x41F8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CA0F377A46DE783A714451978F294EE7;// 0x42A8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4A36B9EE48DDFB6C90FC0CA953419F87;// 0x43B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C44C6B442F66F9F1C4808B957DA9D49;// 0x43F8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6D18536C4D6C5E74D11E4EA59800712A;// 0x4438(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_43F88B8B4E331B31A852D490FA8759C6;// 0x44E0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0065DD5E4AEF508DCC1F40A6FE280D8D;// 0x4590(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2B9CC8E4A873043809F748F674D371B;// 0x45D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64C97D8240BFB5D45B3CDFB5A21E685B;// 0x4610(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1391AB0C4353FB8672072CB0372E2D14;// 0x4650(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5FD9B2F4908D15B6512CB98AFC7EC6D;// 0x4690(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DB962564495322F1D6E0299F8D5F977;// 0x46D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9B0F834472B6D6E6D928C92CE64DDF1;// 0x4710(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F7DAEBC498F8AA46442A295D52A4EEA;// 0x4750(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AE3662640E5D930EC691DADD7A37914;// 0x4790(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB40443F4CC91A18E7F2FD9A3DCF649B;// 0x47D0(0x0040)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_BBAC39AC417A417A082A369EC48EF7F8;// 0x4810(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE0764E24580DA5A2D31909098420BA5;// 0x4848(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_5EA9047F48637B1836BC13872F24C2AA;// 0x4890(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E2463EE945357D91B4C6F5BE69AF9FEA;// 0x48C8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_147F3E5D4D4EF17A1207CAB46616F342;// 0x4978(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4A7645DF4004B0B784EB04BD9138BE00;// 0x4A80(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_0209655042582D3B23F30BA10E5C3C1F;// 0x4AC8(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2B7EB5DB4E43198D2E91019FDA98C28E;// 0x4B00(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8F294C4E41E3232362E06EB316D882E5;// 0x4BB0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D276690B4999C12EBBF5D5B7887A4AED;// 0x4CB8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_E402B38947840D8E2CF8DEBB28ADE435;// 0x4D00(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FA46522340E88018CDD393A4835AFEE0;// 0x4D38(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7FF634F540389C07EE91648A06B1A928;// 0x4DE8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2303FA6A43655D7344FED09C44548E08;// 0x4EF0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2071F87043470355B527FBA89ADC7A54;// 0x4F38(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_033A7878495D52DD0E1606A007910003;// 0x4F70(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_23E534104A87F765C276ECAE687C40FE;// 0x5020(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5FEA9B714AABE4087F76A483C163F72F;// 0x5128(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2FCCC4A4E7507A6B362EC94FEFCA83A;// 0x5170(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_12BDB6FD4D208047E9B269ABFD8784D6;// 0x51B0(0x00A8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_835549A04AD123C31FAC48A395B42963;// 0x5258(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F8FF6BF45A0241923039ABFF878B327;// 0x52F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B9D140B462925B0F74A51B6095F5895;// 0x5338(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D743353D417980747A3FD989D345634E;// 0x5378(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C8F9A914B30A2B8AD134A91FDF60E6D;// 0x53B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FAA7A9C042B877260702C0910C2592EC;// 0x53F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A995FA8445AE1C9F5F13A8CC5E17317;// 0x5438(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0BF7B09421E1B2C550E36900E73EE61;// 0x5478(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C73E2DD49BAA2E326CC6DA891D667D9;// 0x54B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_825FA43542896E7C744853B7CAA3AC15;// 0x54F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73BA2333404B0B2ED23A46BC6104482A;// 0x5538(0x0040)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_FF21551B4E429025ECF2158CFE876BF4;// 0x5578(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_68F1478E4869B35B0A4016802C82E4E0;// 0x55B0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2472EA954528905CFE3FBDA1883F4220;// 0x55F8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B97BA5314A764371437E6E95047832DE;// 0x5700(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_58AC7D7D4840BACD91C450980BC64658;// 0x5748(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8AE142E3464968BE1D7140A5418989C3;// 0x5850(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_14FA8C97492E9C23A67144B399259131;// 0x5898(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_40223A3E45CF753E3FC525B5192E9940;// 0x59A0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_90B3EC8C4D1FF150CEEDB8A6A4B67A84;// 0x59E8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D115A27D44BCB6DDA386DBBFA782AAB4;// 0x5AF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEDFBC5141BA8C728907FB8983991822;// 0x5B38(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_908601F64069338B174BD98079C75920;// 0x5B78(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0150BD349A4D2837B6C84B18CD6BEF0;// 0x5C20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67B9A90348EC7B69EE973FBDC9FFCA98;// 0x5C60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23C1957B4FB54DC48407F98B0C642CA8;// 0x5CA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_377B03FB4F35ED33391BEA97A45241ED;// 0x5CE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8599851F475CAD883D0593BB97C60A00;// 0x5D20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF8568B748E2986D61BB44BEE9B49F7D;// 0x5D60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5B15C8E47DB370C0ADA6483C25E58EC;// 0x5DA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44AD2BB342D0F2561FB94EB5F952B9E4;// 0x5DE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16DB626B48D6C2D7376D50BEA809159C;// 0x5E20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_402F52F544F90941492B34AC765CC050;// 0x5E60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_154E2A1249D724202CAC588DB6DFACB5;// 0x5EA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53656A0C401E9D8814612F88AE19B3D8;// 0x5EE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88F58F3049D75D378863E28B3E0BA04A;// 0x5F20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C85E32F845370E2C29BE8B9F2B5E7B66;// 0x5F60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2999983B4EA442EDF693CCB20E8CA34C;// 0x5FA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FC8234F4B54F1E3DF1012A5D3E1C031;// 0x5FE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82903E584D7994295D3ABE912B31B4CF;// 0x6020(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA15013E475FC7D90CB4E7BE15B3EACC;// 0x6060(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB2A78A0401E119194337BA137C9DFCA;// 0x60A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CABDB43844276933954B329B5CD68721;// 0x60E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2AF3EBE4F7779C9447545A0070EDEC5;// 0x6120(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F91E008443A5138B592211B4B1AA9753;// 0x6160(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88137F364C1010F700BD2B933548D6B6;// 0x61A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47FE7632495346574D701A8404459F74;// 0x61E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7421B970447C29586D0840936C0CC174;// 0x6220(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1CD9726946A348C8278A458BE991C17C;// 0x6260(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77DF910242FB159533AFC694EB125B5D;// 0x62A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C4CB6E149BFF7FD8AB5158633676E38;// 0x62E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E249442D47798C3780AF45BC524A461D;// 0x6320(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FCFF14647FD96E50E43228D82332CD2;// 0x6360(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5A7FEE6245CDA017C2DE728A6E606BAB;// 0x63A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A42D9EB744B6CE804DBD17B41AD5B0B0;// 0x63E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FB2171E4CC4B457E3E450A9CB895B4C;// 0x6420(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2779A63495AD4F9CB0096A9BD0A5B04;// 0x6460(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AEDF4A34C2D61E89D2A79B639639BBC;// 0x64A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4ADAC28340C232BA114903B64F558288;// 0x64E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F7A2C97433D404A4DC998977370830D;// 0x6520(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D448F914566A1826C8759B2A4ADC813;// 0x6560(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_929CB34C4E7D7A6E85D33A8BFBDF1104;// 0x65A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4D1AF754F6F49E7A2E9C1AA55EC9F17;// 0x65E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFA3BA424330A22F9116B099C00F9E0E;// 0x6620(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21FA0B324134F386F56F1AA2D09BCE0C;// 0x6660(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0918438400B4C872E957AB5B5A2E428;// 0x66A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D7D9EB641B60405F0301C9017BFA0E6;// 0x66E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B2D7522499CE15FFCE5A19C7B55CCC5;// 0x6720(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_371B571E4C7C9B4680137982B282C2C6;// 0x6760(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5A1BED85468CE1BAACAF0E9AC9CC8B69;// 0x67A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38E73C4946C2EAAABD54218217C56776;// 0x67E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B1CEA8741F54CB0F8C9848D92A89C08;// 0x6820(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FEDAC5C3463DB2532C5C1B9382F3EFCD;// 0x6860(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E478629049A73E37FF02C3B4079EDF27;// 0x68A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_395F39C942B943AF47CB8F976B8B6FC5;// 0x68E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8770D8C44F091D874E3570837632B5A1;// 0x6920(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0499B5341D5C49D92A21BB7EEE06016;// 0x6960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7487F2514542162ED8A59DB5A4EB533D;// 0x69A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72DAAD874BA28218D7322186245E07A6;// 0x69E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7302C5814CEA884CBC62EA96EA6FFC71;// 0x6A20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E441013463E9B447EC22BA1B139DB09;// 0x6A60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54FAF9EF46AA99D86C23E0BCF320A6C3;// 0x6AA0(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_18DC795D46D4AB8F17C4C1B75BA72746;// 0x6AE0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D776BA4D4F4B76E397214DA2E0AF6A9C;// 0x6B90(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6D9B0F84C4ABDE01FDFC0BD5B907134;// 0x6BE8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_11154144442F942724230E8443DE5E0D;// 0x6C40(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3ACD4F774A7DD0E475EE65ACC34B7ACA;// 0x6C88(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_533F33EC44E6722B4A905C96817524FA;// 0x6D90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D11ADE8C447A43923AE44494A9CEFD93;// 0x6DD8(0x0058)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_253496AD466EE83BAAAFF39AF64B9F67;// 0x6E30(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2E0E66A9497A30F778A8A9810E3CE9B2;// 0x6EA0(0x0108)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_B34A5EB94F6FFD6E10F271910C84C2DE;// 0x6FA8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBDF7E9F44DEBDCDC600F59EC664CFCE;// 0x7018(0x0058)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_239AD8F84B7916B83C664789C4C98839;// 0x7070(0x0108)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_134EAC7A497DBC89B94DE49B4356F2F5;// 0x7178(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BDE953394233401A3684D2A9973C0E57;// 0x71E8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C32BEC5A4A6B999400655180B790A1EC;// 0x7230(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0FF8C987496F87646C4226A4580FE982;// 0x7338(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7238CDEB45A05FF44D9612A1B5E577AE;// 0x7380(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_287702E64055739589A1A2BCEF7D7D41;// 0x73D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FF5730374914F2F6AB37429DA0514326;// 0x7418(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_420953DA45105C6D078EC8B71C8EDA3C;// 0x7470(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1AFB12A8465A366168751E85150E55C5;// 0x74B8(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BB2E6A864FD138E3A1FC35BA163266F0;// 0x7528(0x0108)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AA3FA92C40B6405AC23BE8B06FFE52BC;// 0x7630(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4764F7834BDE951FC33B489C02672DAC;// 0x7738(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E533A11424DA679C19233934C61C52A;// 0x7780(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D222BEC4446305B0F3AA0CA10AC19DC6;// 0x77D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B10445F43F89B0CFF512DB3E4405A53;// 0x7820(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AF5D5CD641C97635249D6B9E0FCA2F98;// 0x7878(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C5F815F14E886B88AB306088EC0D81B5;// 0x78C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_042C1F65474FAE5F7C9A5C8D505013E7;// 0x7918(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_10BD25514F2554FB84554892E6938FE1;// 0x7960(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6239FC494462BE90F371818CD0B76343;// 0x7A68(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B1DCEF0046C95F33E14C078EC0B364E0;// 0x7AB0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C04E42FB4CC41DF81EB1DDA56ACE77A6;// 0x7B08(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7FD527104FC788A6C9D7E7B708C4368A;// 0x7B50(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9E6B0B2448F36E99FC4D78A287D663BE;// 0x7BF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_89BD283B4F69A10535F5159E4CFAB212;// 0x7C40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E6B1DB44459A98DEF5F059A178A8EAB;// 0x7C98(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFCA7B1E42D52FF658E3DBB275B79289;// 0x7CE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A22B58A746CE63E1F695809768479B3D;// 0x7D20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8A65B5945E9BBAE51334B891812DA38;// 0x7D60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA661F9F4AD62C72ABBFF98402A05535;// 0x7DA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C8B1DD04E6B90A6E84C3EAEA254D36C;// 0x7DE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC2E69204E39DD097F7D77ACE38528D9;// 0x7E20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0178D7D3468564C585892E94CACA2799;// 0x7E60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_940184B44514CAC819E27E970184680C;// 0x7EA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2389DD79467A5DD71544B48F00A6E01A;// 0x7EE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49F26C134FFB0E19B09E2FB3EC674CC3;// 0x7F20(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_25970FB041FAF94111AAF18629169D7A;// 0x7F60(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_722706844AFD4F0D01E8969002789C8F;// 0x8068(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E10B89074A435563F15DBCB683566621;// 0x80B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_96B075ED4D082A61C62FA8A86C479BAB;// 0x8108(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B9FEF1A47E0DD3D5BFD798DDFB6E849;// 0x8150(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F01ED8344749D7D6534FBAE8D11C62D2;// 0x81A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC91638A45E05D20E474C59C1A1CF4E5;// 0x81F0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F01ED8344749D7D6534FBAE8D11C62D;// 0x8248(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E81318B34D8511A80043C2B9D3274D8B;// 0x8290(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AB3706D049EAF2AE8839FBAFBC8A1D83;// 0x8398(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3C6AF21E481615F06D5ED1B6D4389651;// 0x83E0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B45EE26748B9A2BD872B37A6990C7A22;// 0x8488(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F3CA53249FA1A4310AE2296B768EE26;// 0x84D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5AA90AC04049F02EE336CA9367222670;// 0x8510(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_123526EE4144B286DBA741B2FEA6E5B7;// 0x8550(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DCA53CB84E6601BC6FCB9BB03C134C7E;// 0x8590(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4206DD574F23C48A98B04DA1C5762873;// 0x85D0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5883EEB94A4E9554519AFF82E1878DFB;// 0x8610(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C2571E8B454C97BF5277CF9685FF264B;// 0x8668(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8AB0B9A547B3DC564F83B8B0609A0CBA;// 0x86B0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9A7340624EF8B0121F02F2A5DA94D2BF;// 0x8700(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B46034D4F6337B84774A18F56268C76;// 0x8748(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E1DF91E44DE1F1431629A94433F62103;// 0x87A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_77C8BDAB4EDB906473E4618D1B5D711A;// 0x87E8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E1DF91E44DE1F1431629A94433F62102;// 0x8840(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9028199045473BB076A69B8812086C29;// 0x8888(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E1DF91E44DE1F1431629A94433F6210;// 0x88E0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_196F472E4B2BE27B04E429B87E190DD9;// 0x8928(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8EDA082C495F57C37E70AE9403CDA7B5;// 0x89D0(0x0048)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_113DD02044BBC04D539786BBBE106D92;// 0x8A18(0x0110)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_42F5B7BB4DB01540751506871A26978D;// 0x8B28(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_56F2DE2B473F2348AA56C9BB8ABABA5B;// 0x8B78(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D725C16648CF5C6F3891F0B57CC3F60C;// 0x8C28(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7F4DCEEA4C715ACB1E1C179E418323C1;// 0x8C70(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BEC8329C4B5EF27D49B37880FEAC8674;// 0x8D20(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01FFAF124A976EA8AFA487BE818366A0;// 0x8E28(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DCDBE7814E8EC16DCA977DA50927ADE0;// 0x8E80(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C8A1FD94D655195BE7124849BE39D0F;// 0x8EC8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B6B0D1CC44CE7EBF4C7AEDB918E9CD50;// 0x8F20(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EEA9D7A940B822ED2476D28DB7F2EEF8;// 0x8F68(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_442D6B5D431E834414D146B030443C1D;// 0x8FC0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FC3515F4489411B54B44FBE600E70E4;// 0x9008(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6EB02F5F473A20C0EC5E4A9CA96E741E;// 0x9048(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_901288274FAD069F1203EAA2C7DDAD46;// 0x9088(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_612C4B1C41B908993D2FBDBE499D46DB;// 0x90C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_619D88B74C56AF22B4A19B9772AAFCAF;// 0x9108(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A69CC76C4D46CF5FFD3155A1AB55C8C3;// 0x9148(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_717283874E19F474AA87639B5CC447EC;// 0x9188(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE9CFB9F4AF3E48FE63BA29EACAA3C63;// 0x91C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D0F0E1741BD56DEC62329AED5CF6068;// 0x9208(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03ABDF4A4345AEA30888E184C7275C52;// 0x9248(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8424F4C41A89D9FE7BA8F9FCD4F3AF6;// 0x9288(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CE96BE84A7997C5AE4A3CA1CC11DF02;// 0x92C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77CAF299498195803A6C4D877AD495DD;// 0x9308(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C38E30914794A343BA467D8367B0A571;// 0x9348(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22303;// 0x9450(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC2;// 0x9498(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22302;// 0x95A0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF99854B44E1FFAEFFA05E9CC30E1E0C;// 0x95E8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B747C86944D3DEA7EE3E05AF827EC87E;// 0x96F0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB4;// 0x9738(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C15;// 0x9840(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AC6A2B3B4511958EEBE8C2988B40E07A;// 0x9888(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC;// 0x98D0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B2230;// 0x99D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_797F255D459C7814293DAA9783AA5905;// 0x9A20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_604441324C983CCBC4D71FA5CDDA95F1;// 0x9A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B5A4159D4DE7FEB4C65F5EA87BEFC5DF;// 0x9AC0(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C185EFCF4821B2936DE703AAFFE12F09;// 0x9B18(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_562957EE409443DC0FBAB5B39BCF4AFF;// 0x9BC8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED0;// 0x9C20(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2C1F570942461946533F96B1074F00B8;// 0x9C68(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CEFCA87042D0B922C00A899B93549E25;// 0x9D10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BAC980FE4F09933FBB789988CDEE1DAB;// 0x9D58(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BE23C99544F628EC541279971371CA56;// 0x9D98(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEB5DBEC4D18E334015C718A2671863B;// 0x9DD8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C99232741D366E265530693E53E0EAD;// 0x9E18(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_885866B543DD30363DF62E9DA332C8BA;// 0x9E58(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E76724248EDE265C48D3BA2798E732C;// 0x9E98(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C9EFA104875FFB2172FA8B957A41590;// 0x9ED8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA21FA8F426CDF8CE3B2E88AED77FA05;// 0x9F18(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFBAD1BC4C8B9B05AB51889DF2FE29C4;// 0x9F58(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87E63B2241D3A47669976BB98212639F;// 0x9F98(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4232AF9414B06122FA07B89D4C885E5;// 0x9FD8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6242580F4B496CC2B3BEA086F13532C1;// 0xA018(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E0FB565242F35E0CC7CC8E9D56B4E1A5;// 0xA058(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_751173444E5B0D5F486F52B67754272A;// 0xA098(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AEAD5684C658EE69F0941A1A77C10EA;// 0xA0D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A09715F4A83A456611E2AA11CF5036C;// 0xA118(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78E9238F4B1B281E8D0A489E2B634C5D;// 0xA158(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0290364409090813CD2548460F299DB;// 0xA198(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A06931E7475EA79253EC4E85B2D0BBC9;// 0xA1D8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD579AE845875E577C99BDAF2CDA2190;// 0xA230(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8DBACF184C327F61BE8EC2A191F95DFA;// 0xA278(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE75779F4797BBF2F08787B9D83E67C5;// 0xA2D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB076BFF45B66E3339AEFE90175D6B2A;// 0xA318(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_724A056A48BF1877BDC4739EFE3D9CFB;// 0xA370(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE0CFE544EACC1D50D6C5B9BD5B526E1;// 0xA3B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B1C0E344CE4D244B345459EAA264385;// 0xA3F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A5727864F58BBB00D6A118A31C516E1;// 0xA438(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C9847A1246DA7A421C59D88C48876D7F;// 0xA490(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D40264B49660B6683201699C8708E4F;// 0xA540(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0D4D3A594888750CF6507CA95BCB7D55;// 0xA598(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C111B5448E091E1799E2EACB65B6915;// 0xA5E0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_11CAE05F4B0E031100D0DF99A6BC19FD;// 0xA6E8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_73CFF3124FD0960B82293FBE7A2EFAC0;// 0xA730(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AACF9B77446CEA65B296B28CF3AB2011;// 0xA838(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6324914645DB563106B057B297910FC1;// 0xA880(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A70BF0AE499CD96BE2D251B8CA54EA52;// 0xA8D8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1570B7264C050675CE0C45A7D60A87E1;// 0xA920(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0241BF1542D9B5D80961BDBF11189B9D;// 0xA9C8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_09A2EAA445CA0440DF564D9464909AC1;// 0xAA10(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_75B3FA6F46445DA9565A77AF93680106;// 0xAA60(0x0048)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_2798666641C032BF9A9B748AE7C4EE52;// 0xAAA8(0x0110)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F9809F6743EDB8194DA7D69AB5BD7233;// 0xABB8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_242DC02E4539EF1B4276559B5FFBD89E;// 0xAC08(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A440D8334EC7ED4DC07AE6B750302811;// 0xACB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2823A80F4C9B5ADECA59509FC0FE617B;// 0xAD00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8977519F476344CF33BA888A97E8E228;// 0xAD58(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3EB586B744ECABB5A039468BC12552B7;// 0xADA0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_51034A3740919FADB271E2824E39E53B;// 0xADF0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EC7A58424327A68E762D198E57AAE8E8;// 0xAE38(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B633C75479EBD2686046AA92C141108;// 0xAEE8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A4CEBF53423F005A6D90B1A18DCA9E7E;// 0xAF40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A9462D38439BA77C61A93B86598EA664;// 0xAF98(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0CA863624B2C9693B05238A3E35ED033;// 0xAFE0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2D28F76E478B710EA9345DBDD88E16F6;// 0xB090(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_678A6B9D49CB5BBAB2EA12AEA8193D10;// 0xB198(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9A0C04D249D5EB49933BABBEAC7F2173;// 0xB1F0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5D1B280F4E62852208563D80F583884C;// 0xB238(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_548A0F274B6C096B06797384102D9FA6;// 0xB2E0(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_816BF7E8414DF91B477C638AED5947D2;// 0xB328(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_67D245924FF395E5AD33D6ADFD3AFEDF;// 0xB370(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D300E40E44A817FE9E6035BB31044EFD;// 0xB418(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_755AB7FD4355B5C347203297CD39805D;// 0xB460(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4B2424E24041FE698CEB8F88D52C65D8;// 0xB510(0x0090)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_260FF2AF4585E2064693B7A025A5C336;// 0xB5A0(0x0090)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_53209D924AB639131BF4C395BE8837E7;// 0xB630(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1DF4298E47785363EED2AD9C1C68A1B6;// 0xB680(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0F6A769C4E2E3D06E66EA98232E96584;// 0xB6C8(0x00B0)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_9B1C7C7E4F940C91EAF98BAD9B094A7B;// 0xB778(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C52F638E4BF80B4DBE6BBD8D923EA419;// 0xB7C8(0x0048)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_9993E16A49BAD500CB10DC9A424458A0;// 0xB810(0x0050)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_46C2CD6244061F4017B2F68FCD8186D5;// 0xB860(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0627BA604BA43F809E9BD697D207D272;// 0xB8A8(0x0048)
	struct FAnimNode_HIKSolve                          AnimGraphNode_HIKSolve_ECBECB834333AC1DC5AE5096041D6774;  // 0xB8F0(0x0080)
	struct FAnimNode_HIKReach                          AnimGraphNode_HIKReach_E42BD3E8401C10A894C498B2E9584CC1;  // 0xB970(0x0080)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_CE015F0A43EECEA9CA37099DADE92127;// 0xB9F0(0x0050)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_8BE99C564AA6F979DADE2FBB2226B4C3;// 0xBA40(0x0050)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_3AF3546C43C6BAE285D73D8F9A08D603;// 0xBA90(0x0050)
	struct FAnimNode_HIKReach                          AnimGraphNode_HIKReach_DBD67FFD4536F215D08511B3C367CBD6;  // 0xBAE0(0x0080)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_14714C244A05F2E5A296C79CEA23AFB4;// 0xBB60(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C6E9941A48999F3CFEA38C9217F3D72F;// 0xBBA8(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4A49EBD3452092FB53AFD1B1D2826BB7;// 0xBC50(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FB23FFE84DF57BFFE9799BB26D2E91AA;// 0xBC98(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F628C2E74AAC9CBD9B96E6B42D61ED13;// 0xBCE0(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3A76EE35475951C79F92F8BCFDB7FCD5;// 0xBD28(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7173227A47E93B8C298A2CAD2AED65A4;// 0xBDC8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_172E7ACF452FC7027A89B6B817E502E2;// 0xBE10(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E498E6374CE9F0F04120E184C81D950F;// 0xBE58(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2ED6FDD242F34A548D3E9A854C42B9AC;// 0xBEA0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2AA22C4947DADD91F7F7A0A58361A3CB;// 0xBF40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B4CBBAA8421AA606252F6EB7274B3319;// 0xBF88(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_691327534C04446C25AFBEB0070ADD47;// 0xBFC8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8529EFF94C15CEF950484B820B6B88E7;// 0xC008(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AF25A6F4F29F44D23143C8054985AEA;// 0xC048(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46B408EE47CA39582B44BE9AAB992220;// 0xC088(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83C36CD041C68E58560BE08D643B9465;// 0xC0C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_267FF4D645C612A95AA8EBBD77F7EA8C;// 0xC108(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6DDE5C5646DFDFA11F3C1A9C4A805379;// 0xC148(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EB2311F45F9646B4B2B078CDA9034EB;// 0xC188(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B2A691F2465BF8BFD07BD6B5A4531A29;// 0xC1C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_917906FB43EE9D97EDCF49B38992F62D;// 0xC208(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DDE0DF94D1DA2AEBD67FBB6A0D9C698;// 0xC248(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC3848804ABA1D99208684A623BE8492;// 0xC288(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_341737F94DA1531508BD0291FFFCC276;// 0xC2C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5DBAD6B246638C8277BCB5B0B5048671;// 0xC308(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C36AE9194BC2DF68BAC7CA884F969522;// 0xC348(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2732DF7647EF095600903782E98BEC8B;// 0xC388(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70DAF08E4D465FC81180348EBCB99829;// 0xC3C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91688AB5424199861D0DD2A579DD80BB;// 0xC408(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BE4B97343A2AEFE678D3CB4FA07181E;// 0xC448(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8AAEF112440CBD374C8E809CD45F4C12;// 0xC488(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C28F395431AC6F9CA66F0AE13FB9CBB;// 0xC4C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5807F6B74E52737299A6C1AD86C8247D;// 0xC508(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42929259439955B3D04C68AA3394366E;// 0xC548(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5FB4C6A4F1050616F166A8CB3EF770F;// 0xC588(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C27553714E1A286B88CD2A8B6DA054AD;// 0xC5C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33BB35DF4D4761BB6D2E90AC9753DAEC;// 0xC608(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73DDD4E04111F1E1471B029AABD19007;// 0xC648(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE44775743940573EC8FDE80F26BD0A6;// 0xC688(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CC6DD2D480B7FDFADA910A47A8746B4;// 0xC6C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0DF7BAA343F65A88FD86B48973B3F81C;// 0xC708(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_147ACE0149DF4FA79F2D75A161776F79;// 0xC748(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D23FB7D441FEEDFA61CF9C97F33BDE7D;// 0xC788(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EB9979324374E83D06E3618ADFEA483F;// 0xC7C8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_140EC6C0434F994FEBCD04AC45537CD4;// 0xC820(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B3A6773421CA2157130E9975CDD57F2;// 0xC868(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BCB319ED43113F3970C997BAAB439A95;// 0xC8A8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8FBA818B4966BE188A4577B624E1B167;// 0xC918(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_55186521469F80EA74889FA3F0B5337E;// 0xC968(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6B93AC264E2A8A21D60AA2A26D6EF65E;// 0xC9C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D7CD8048435F6F22136616BA41250D75;// 0xCA08(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E561C9E437E7E7E03347FB0DDFF06F6;// 0xCA60(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_314A7D2746B230294D5CD4955B8F132D;// 0xCAA8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FF02B50D46DA264D7B4BD18F92BBEEB6;// 0xCB50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_518330AC4235D7EB06D0DBA76A2786A3;// 0xCB98(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_672FB149430766CE5B4F81A3D526686E;// 0xCBF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C272E318485591480FAAF9918480A22C;// 0xCC38(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DDBE055D4BA55A55061B579E2021AC64;// 0xCC90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA855BC446951C0559D5569751811D53;// 0xCCD8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_24E77D9548AD64B390322EA85D1F3DA6;// 0xCD30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C580ED643067E5A44B5E18E8142D617;// 0xCD78(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB17E2F44C952B9C3AC4818B1E534C7C;// 0xCDB8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19E4A419489EE086ADEFA1A7F128758C;// 0xCE10(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A6476EF485B507D346C7AA0B69E9650;// 0xCE68(0x0058)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8B553C94C20F1EE3A4D2F8ADA9DA0E22;// 0xCEC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1BF86D3A4074DA318A4F04AD7EDCD07B;// 0xCF00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFFE6F8146E4E7E5771965BF561C93F42;// 0xCF40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4C64A44BA7B8B1F28CD3A4DDFBF5DC2;// 0xCF80(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2DC6E8BD4285F3FE895EFDBEB1CB3073;// 0xCFC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1107755E409BDC5021CE90BEF8C1ABF42;// 0xD018(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B53649AE43AAC0519EE54DB784FF26B9;// 0xD060(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C4C9A50D44CE963EB99707B1817863772;// 0xD0B0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F43DCF3A4EF9A2AEA5AD40A0AA44FA3A;// 0xD0F8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DFAAC78146E32BAD526C3D9FBB705C5E2;// 0xD148(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F064A24F4D676339548F4D991D4BCC46;// 0xD190(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8B553C94C20F1EE3A4D2F8ADA9DA0E2;// 0xD238(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E06DE57540ABFD6A2024D2A4980FB603;// 0xD278(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFFE6F8146E4E7E5771965BF561C93F4;// 0xD2B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4C64A44BA7B8B1F28CD3A4DDFBF5DC;// 0xD2F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14134DF74581D6BDBF2E0B9DB933A3F6;// 0xD338(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1107755E409BDC5021CE90BEF8C1ABF4;// 0xD390(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_193303E7439ACEE3A8F4C5904F92EEF5;// 0xD3D8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C4C9A50D44CE963EB99707B181786377;// 0xD428(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B1D5FEA04622FD8FEE7E8DB2832915B0;// 0xD470(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DFAAC78146E32BAD526C3D9FBB705C5E;// 0xD4C0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0D2D41904F0A5BEDD985B8BF57E4A1B2;// 0xD508(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7717F9244EE32E34AA6D6CA50DEEF540;// 0xD5B0(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_76C8251A413748D4282A81B67964C640;// 0xD660(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3194720A457B7A509C77CEAFDBA24337;// 0xD710(0x00A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_307DFF144E84A02037641EB88CEE35FD;// 0xD7B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CE540B3D43C2A475782DDCB11B919E83;// 0xD7F8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F4E3940D48026D5649B932BEAB1E9F66;// 0xD850(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F06118D64E4854B84AF6A0A9F713B058;// 0xD898(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2291CDFC41BCA6839426CF9E05996203;// 0xD940(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1C4C59264B5BB736AE41528A126B3AFB;// 0xD988(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E495725544F40CD669CBD79CFF583B2B;// 0xDA38(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91F42035475901E9442309B7F118DBD5;// 0xDA90(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_515644C14A81D27C109E6A92F1A52F8F;// 0xDAE8(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_28A70A1B4868DF6B6A0C1F90EC9D84CC;// 0xDB30(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D091A584840F78CA15A5F9CBC62AD47;// 0xDBF0(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B67A74BB4793DD7022C5AD8141247505;// 0xDC48(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_92B26E294205102337F8218D60317932;// 0xDCA0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BAAB0B5248907D6140FF4098CE56F974;// 0xDD50(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C26789CB45CDE09F741C0E9629BE9206;// 0xDDA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1F4BAE645667ADF569200A9F829A043;// 0xDDF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57A52DDD4AE556E1807C2CAB96A9712C;// 0xDE30(0x0040)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3BBAA4EE41ED876608B24FBB402255BD;// 0xDE70(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1B0154384C1EABBC4520C69A9C1A9DC6;// 0xDF30(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_11C83FBF4EC11C63C63C9F914A60650E;// 0xDF88(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_29CF7A374414F0DAA94FF5BD72A4A73C;// 0xDFD0(0x0058)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1D28739E427B01F64AF823864119E287;// 0xE028(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_345CCE7D4B02B8A01F9F7D902B0A54D7;// 0xE098(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CA4A36934BD751B60300C4A5DEB09520;// 0xE0E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9795D4564D2DAE68CD830D9EA65DCC0B;// 0xE130(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0CC916914B8ED56C76B7C0A9A7560956;// 0xE188(0x00C0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6386A3C44E494EC13EEC6EAD2BD25AD9;// 0xE248(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FBBB7CC24CF10EDCEAE8F1BF39844C29;// 0xE290(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DA18BF644C388E9C64D28FBA3C65513D;// 0xE338(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D4617AA142CE9E35081CE59BCFE79436;// 0xE380(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CE2BAB4045B25D33779CDAB7B98D4EDE;// 0xE3D8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4252B08846EC00A0C41040AC3D82792C;// 0xE420(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9BCFD340486FDBE613DB2EB9D445B28E;// 0xE528(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52E036D84EED41F1DED8BF912AD5640B;// 0xE570(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A189C5C4F74B1E5AAA31B88F1995DFA;// 0xE5B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEE5C30B48918F31D8C36BBF9CF07DCB;// 0xE5F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_835706C24A9B24BDC070C19A5073395D;// 0xE630(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FACF014946BD9E3E2372AD80C99C66F6;// 0xE670(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A06361A743F89335FA1E4EA66F2EF58C;// 0xE6B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6DDA5A6D4C9F78D2EE24C6BE3BD1ADD1;// 0xE708(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_54B95FAB42E066488FAEF2B8F3EDAFC7;// 0xE750(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_540E150C47A2520AC1C306AB58C79DCB;// 0xE7A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1EFA34DB45C280823224DAABC8A233F6;// 0xE7F0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D85A8BAA472C15758CF09EBB94156FBB;// 0xE898(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_649BF86A4D6A216F7744B7802E47D2062;// 0xE8E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15E991D44A979EDE98BAA2B6A0EFD0E1;// 0xE920(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5B74CAD43F22B992257F8A5663D522A4;// 0xE960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B29D0A8A469DF46330216F8014F0BD0D4;// 0xE9A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94DA18434D25C436795DADB4F81AB2482;// 0xE9E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C95AF3E742AB299BB45CE3BBAF3687B62;// 0xEA20(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4E9DBC6246B06CEB029F5682972FC962;// 0xEA60(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F8432034516A39A3F41BAA6533F84FF2;// 0xEB68(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_53CC13204D322D425F51EB9E6644EAD1;// 0xEBB0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B9EC67004313FAFF883A389EA7155E904;// 0xECB8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_98F6EFC54BE9781051F5DC9A8029FF1F;// 0xED00(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6C91C4C74F42C08166B9F28A9997BCC0;// 0xEDA0(0x0108)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7A5372F24155522A266CDFBC86845AEE;// 0xEEA8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_020E6A2C417AA6773647C6BE3AAA80844;// 0xEFB0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_40624CB9408DC83F0DB27080D1B2A53F;// 0xEFF8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD5625104F543AF19EBB05804C72A7774;// 0xF100(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E5200C2B4908F13860CF26A8E67C74E7;// 0xF148(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DF796E344291B1946AE31A8066053E96;// 0xF1F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_649BF86A4D6A216F7744B7802E47D206;// 0xF238(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D7C38EC4CAE22DADC18869D0C7E7D6E;// 0xF278(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5B74CAD43F22B992257F8A5663D522A3;// 0xF2B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B29D0A8A469DF46330216F8014F0BD0D3;// 0xF2F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94DA18434D25C436795DADB4F81AB248;// 0xF338(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C95AF3E742AB299BB45CE3BBAF3687B6;// 0xF378(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44A420AB411E6BB9F310FABB04A37FE7;// 0xF3B8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F8432034516A39A3F41BAA6533F84FF;// 0xF410(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8589C1E242658F44C3674481EA2B366D3;// 0xF458(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B9EC67004313FAFF883A389EA7155E903;// 0xF4B0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DC17CCB94FCD34162DB8DF88FD948878;// 0xF4F8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_020E6A2C417AA6773647C6BE3AAA80843;// 0xF600(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B14F6E4C42954CBB827F3BB35A8AC25D3;// 0xF648(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD5625104F543AF19EBB05804C72A7773;// 0xF6A0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C4CEB2934D7B6B5DFFDA44B0575A3855;// 0xF6E8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_47DF4D7E4C2231B46CA932964D4B3A17;// 0xF790(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EACC97424EEC2540D90616A95D5577F5;// 0xF7D8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6C09643F40CF75409F05E99FE7979641;// 0xF880(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF1364674F23DF8D8717BDAB5FF18062;// 0xF8C8(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A2776BBA4C431762C50C87B6E32F6649;// 0xF908(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3535BB164A3D6EA1E3002EBCC2C36182;// 0xF978(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48D2691A4E670255C8368E9D035ECA8B;// 0xF9B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D21F95D4687726F4B964281EBA0ACE8;// 0xF9F8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AF1EA6D444A9D8F6F0EDF59C51E4B09F;// 0xFA50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8ED430774C769C54B8AD4F8563D59ADD;// 0xFA98(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBFD6761444BB66D2392EEAC45447723;// 0xFAF0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_52572D6B4B4F930FE99E28B23909FE30;// 0xFB38(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7838FFDA4AA4DCA66270E08786B8AE19;// 0xFBE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F766E29483FC1AE9B2D8CBA4589421F;// 0xFC20(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DFC20B024615280C001F8AB3CD52C152;// 0xFC60(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_44F2BE4741380C20E4D47699472A7ED2;// 0xFCB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B6FDF0ED41E4797C3B9150931CD2A778;// 0xFD00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_676EA3854B771E6814FE43B32E6AC749;// 0xFD58(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3FA3DB2E468344DDD727B2AB6CDE3EBF;// 0xFDA0(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D2A87BF94F909ADCA66E7C8A35E659CD;// 0xFE48(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA1DFFBB42A939470D6F16A443707D78;// 0xFEB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F9818B54AB1419F1EF8E5800CCB2C7E;// 0xFEF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_770AFD814131A7B1AEDB3382982A8736;// 0xFF38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54E9685748BFCFABC7AA9BB1B957D818;// 0xFF78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E17D7F444F25D03DA69654AA498A6F4C;// 0xFFB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA0384E54F96D7D053627F88E08669CB;// 0xFFF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AD377A14A29BB3CAF122C9A9D0D7FDE;// 0x10038(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF74C8834B54AEE4A27E83811BDE3CA5;// 0x10078(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B8C4ACE4D3BF3DE50C07A98C237ADDF;// 0x100B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FA015DA4FAEB79DE0F3A6B97901F620;// 0x100F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D18D0C4342754FEE1820989928D36345;// 0x10138(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63BFA8DE46AD045F7FFABEA73603D528;// 0x10178(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4E4A01414793CD12F15B10B7E81E63E8;// 0x101B8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_992B1F56461A2481154B59828669F90D;// 0x10208(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9EE53B454BE5BC6BDFF48692B54683B1;// 0x10250(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FAE897E44AF03D11B5B544B0A168EF6B;// 0x102A0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_03393B4A40A186EB033C27A4D94F8990;// 0x102E8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D029C47847D4D66F921D199E00AF1C02;// 0x10338(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_81B0D70F47EB7148BCDE05B6E23E75CE;// 0x10380(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_54386DB146A1C52D59217D95270F0174;// 0x103D0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A0B7C5824BFF6C411F3F91B3CE8C6D40;// 0x10418(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0AD632B444CAD0BAED2225A4D8480004;// 0x10468(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92A489FA42540ABCAC3AFBB62EF9529E;// 0x10508(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87D7DFBD45771BBB777DE98ED82E2EBD;// 0x10548(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD9172EA400842A93FC51EA7AB5868DA;// 0x10588(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DD8CB5D64FA811EBE9FF1C9860C450D9;// 0x105C8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2787646D4FE0067F098BC0BDAB807BD7;// 0x106D0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E05905F049D97A45B83EB48691139149;// 0x10718(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_59BCCD4745865B28CD06E686D9D17208;// 0x10768(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7912B59E4042F1017F3272BA40A1F532;// 0x107B0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0BD4E3EC4CFC3FD2AFD8B691BF0FD7C7;// 0x108B8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_525A42304474E8C6E169E9A29D390906;// 0x10900(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8F2DE434A9D9AF78D98F8A3D3DEE7F0;// 0x109A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64DC74E1446A67964621DABB91D29D87;// 0x109E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1F5ABAC4CC8171880114EBEF5C6DA30;// 0x10A28(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_97103FF84815E6466B13FD8A93B9263E;// 0x10A68(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE561F3445C865094F535590722F7F50;// 0x10B70(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_C83100BF4B80EBBD2132BABA0EE5E4D4;// 0x10BB8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_933FA9FC43908395DEB0E9A210CAA7BB;// 0x10C08(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_52C6E52B4637E82E823BCBA24175110B;// 0x10C50(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6EAEF841451304B23BE5DB9A84A88833;// 0x10D58(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1C97CC344EC8BD52A92180A452B6E3C2;// 0x10DA0(0x00A8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_05997EC140D17EEBFC3355A16159831C;// 0x10E48(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E5A045ED4AE33F7D5C5300A5CCB4A5FB;// 0x10EE8(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7108FAE744831D00A83359A7AFD06EEF;// 0x10F88(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8A5D63A841348E27DCD37D97D62E72A8;// 0x10FD8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B33900DB4A5027D68831ABBF942D6B86;// 0x11020(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8426350045323907E207BC9C79FA8574;// 0x110C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11B8280F468470C79BC0BE85B88C4EB1;// 0x11110(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D62BF41491C23400EDDF3A919B72A40;// 0x11150(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FAB512245F8F725FC795F9D6C19AECA;// 0x11190(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B23880CA46281EC43C57CE97FA18EF8B;// 0x111D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2A521915487BD0375E2FF3A68AFF3F28;// 0x11210(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_894B66DD4D136E5FDF69EA82975DF5F6;// 0x11250(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE1FE21D446E8A51C288A0B15AF935AF;// 0x11290(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93C5A93540BE5FE1783FC790FDD3E397;// 0x112D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67A76BF04ED2F66105CCC6B1B05D4E37;// 0x11310(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F6CA06DD43554A3690C1EAAFFB742885;// 0x11350(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE254727489A4A39467563A7DDFFFB44;// 0x11390(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F82A3CF545C45C9424CA58BC769803F4;// 0x113D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6727E80348CD4230190E85BC61123F76;// 0x11410(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_231D9420489E474C86B4AAB810368A0E;// 0x11450(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1155BC6C488562796C7B5AA2661C67EB;// 0x11490(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89EE80EF4D5A9DEAFFBDA8857A264B14;// 0x114D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_727F31A048C3938140E5F9859FCBB426;// 0x11510(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC1D03CB4C3F556F6521E5BB5D74B64C;// 0x11550(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A6A1288B4CFB0D59AB4FC79116A96849;// 0x11590(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_35EDB90247DC06ADFE8EF0A83F54C4A1;// 0x11640(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_873DE3B24C11E74E321E4983E3D350D5;// 0x11748(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99F19DDF45EC43CFB6C6978F841A1ED5;// 0x117A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9CE2B8A441368124786C5A4A93A29D0;// 0x117E8(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FABEABC04E72E611C8A6F18F165BFCCE;// 0x11828(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E8C7780F4DE4F29F6A6A21B597BD10E9;// 0x118D8(0x0108)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9DF45A2B4D27863BF377C7A7FA0A3F1C;// 0x119E0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0A1191C343F2E0073771DDB8437ABA28;// 0x11AE8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A0BE98D34E5CB80A8FD7F9B0ECB2A37C;// 0x11B30(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_30C0A1FB40E67E6719F749A3B2303B91;// 0x11BE0(0x0108)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_72EA10674FFD3878120DEEA20BA660CD;// 0x11CE8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_72B91D6B430BBE767DA290B688F11C43;// 0x11DF0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4A17D3424727780FCF3E8E9559A72264;// 0x11E38(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D4AC73924F87759B440C1EB07B5F1C65;// 0x11EE8(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F17FD9914A568EA3933B40A8F0C46E3A;// 0x11FF0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D73561A34C8391C6E80CE1A21158B127;// 0x12048(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7ED5120F40FFD99B429DE5A6A4EF26E6;// 0x12090(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2CDA055846A5DEDC2AEECE8FE981714F;// 0x12140(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8F0D5597473564D6818E7FA3FCA2D781;// 0x12248(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A107D739425ABD1D8F2192B6CD1CFA75;// 0x122F8(0x0058)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F26398C544B4F5AF1E499B965DE34811;// 0x12350(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_500C00FE4B1E462CFB5FF9BD89D31B42;// 0x12458(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_73966A594AE5D1E30E076AA69363EEF8;// 0x124A0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BE565A364977E278B5F49CA24F11B8D8;// 0x12550(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14A241094514D7AC08AF2D9D648CD21F;// 0x12658(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF21CD4C4FD496871F1564A6716656E6;// 0x126B0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_19418384401D047BEA93868D4A08F2C4;// 0x126F8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_06E0247C4D7CED0F9B7DE2B41E667F75;// 0x127A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6487C8764696032E1B74FAA7BB8FA9CC;// 0x127E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C923ECE94529D346878585B6BBDE981D;// 0x12828(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94DB998940A7BF876C8EDA8303827EFF;// 0x12868(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E61ACB884206408767A7F58191D9AB2F;// 0x128A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_535159DD42454B2041459FA5C6B8549F;// 0x128E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4E9B79417E537B26EC6CAF14D33837;// 0x12928(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A7E10B4442D6F6725A589CB170B690F5;// 0x12968(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBCC6A804DC7338DB36823824C0A08CA;// 0x129A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64CF38F14250D8AC9DE8A9BB1E73BD4E;// 0x129E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_059CC46A45B37AB57290909B5462472A;// 0x12A28(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77D3DB2C438A1416704FE3985AF839CC;// 0x12A68(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC6AB72349457E258AE068B39C9C2594;// 0x12AA8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E561CB24BCAC71E315426B4A1508713;// 0x12AE8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E872A71B44E8854EB5CFB2AE65C77682;// 0x12B28(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F62CDC95405C937ADC3EE6A4117AD40D;// 0x12B68(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB6043184FF6E877191A33B79D43B898;// 0x12BA8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_72485C45485871AD898D90B2744B1A58;// 0x12BE8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_44F111154FFF993EE74E6D866431F16D;// 0x12CF0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_11D9BD7C44B9E23D31DE03B687C96A78;// 0x12D38(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A33A89E64F09CB72D75CA3B8DAC88914;// 0x12DE8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1719C6C14D195494430CA3B7D4237A42;// 0x12E40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4069D5294969EC79633418A26E03B3C7;// 0x12E98(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_D178D5AA49C8EDFC5D579D9ADF3812A3;// 0x12EE0(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_388CC5B64688352252BB0B929DDD5C2B;// 0x12F30(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_172D2F374DA5F379615C80AEB0153105;// 0x12FE0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_952CF4AA427481757CBBCB9ECF3D7F7A;// 0x13030(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_479B7DDF48DC3AEA1328DBB8DF0B455E;// 0x13078(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BC87E42D45B48C54F72433AD16506FCE;// 0x130C8(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_5357D82C4D3D47BDEBF889998236AB19;// 0x13178(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_051C9C544EDBF73ECC0AFC98395B9B53;// 0x131C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCE90CA344F247D6ECD843B193AEECF4;// 0x13210(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82BC725745A626E0AE8827A5D5BDF6BA;// 0x13250(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_542ADF5348E043300D69F0BDACE24D5D;// 0x13290(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5B74CAD43F22B992257F8A5663D522A2;// 0x132D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B29D0A8A469DF46330216F8014F0BD0D2;// 0x13310(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B974ED249BD4E68B9B893946D693622;// 0x13350(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E9084CB4E35A281967A70829F9EECA2;// 0x13390(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8589C1E242658F44C3674481EA2B366D2;// 0x133D0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B9EC67004313FAFF883A389EA7155E902;// 0x13428(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8004490B4243DEAB6F3112828F4F1F07;// 0x13470(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_020E6A2C417AA6773647C6BE3AAA80842;// 0x13578(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B14F6E4C42954CBB827F3BB35A8AC25D2;// 0x135C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD5625104F543AF19EBB05804C72A7772;// 0x13618(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C0540F3A42B5D732B88908926C6F24F1;// 0x13660(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_93ACFC81434DA471025761A0D602852D;// 0x13768(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3D8EA7D444D3693FA212ACB8C270D2FD;// 0x137B0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0A7809BD4083683A736DACB91193518E;// 0x13858(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12C42D6444069346151DC5B3EE1D2D6C;// 0x138A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35A3C80E45DFC22115E33DB558C6D270;// 0x138E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5B74CAD43F22B992257F8A5663D522A;// 0x13920(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B29D0A8A469DF46330216F8014F0BD0D;// 0x13960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87535897417AE5B17EA4B5839CB9942F;// 0x139A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E05E893B451F2055A8FBE4835444BE1D;// 0x139E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8589C1E242658F44C3674481EA2B366D;// 0x13A20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B9EC67004313FAFF883A389EA7155E90;// 0x13A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A4122F04F096388473D9382BA7BC8F0;// 0x13AC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_020E6A2C417AA6773647C6BE3AAA8084;// 0x13B18(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B14F6E4C42954CBB827F3BB35A8AC25D;// 0x13B60(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD5625104F543AF19EBB05804C72A777;// 0x13BB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E98F36B84C74BF0C6937098CDC9714CE;// 0x13C00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F607DE4B4F3258CFD781489D45541A7C;// 0x13C58(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E7B7A0C848C5EBD346FAE7BF230FC127;// 0x13CA0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4296EB4B4DAA36D934A780A820FECA08;// 0x13D48(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1C19981D48DFAD3CE1453CB9A9D8DCED;// 0x13D90(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_48E2DA1C4B68D9823B3AFCAE19E12FDA;// 0x13E38(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9E9304F044DACDE33415F18A883FBFAE;// 0x13E80(0x00A8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_77BAEC0B454FAB9177B86887F10A5CBD;      // 0x13F28(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AC10C99548114CF51ABC2D9499C447B2;// 0x13F88(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7623E6AF46BD4AC349AB789A99CD4CAF;// 0x13FD0(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_787AB0784DAB91CD62BD08AD23FFEFAC;// 0x14080(0x0090)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_12A760774ACB60E43098029BEB05978B;// 0x14110(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1941DE8B448E37DD8660CFAD8DABD0C8;// 0x14158(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E96598BF46ACF4C6AF46D391D3E641D3;// 0x141A0(0x0090)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1103CBD948AD60C898B3848FCC475622;// 0x14230(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_34F8BD844EF9873F3A9CB38DED4F1F72;// 0x142F0(0x0090)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7B1F2FE344014482C07B5B9D773FDF0E;// 0x14380(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6CAB69E84167D694DD4706B6F7430FF9;// 0x143C8(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6459E0CD4418225059AD519E9F254E1F;// 0x14410(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_39A65C1D4871E78CC6DE9E9EB0D0E714;// 0x144A0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C41587F14FE941888EFD2585733E931C;// 0x144E8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ED965A744BD79BF82D5351A1B4DF5D9B;// 0x14530(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C7950B754A9067EDA60263AFBF25C8BC;// 0x14578(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_47EEE190494242CE41106AAE49F5EF48;// 0x14608(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_82BCF1CE44A69F25099C0FB1A78C6EDD;// 0x14650(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3099A91147875EB98BA64CA4FB8EA0AB;// 0x14698(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B6502AF344DF2E3629FC3F89BA192E48;// 0x146E0(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_FE73416E4AA9169E045C8797AD339CCA;// 0x14770(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6B6290204DD1AC9D1773F0B045B1C84B;// 0x147B8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0543155845BBC29CC3AC90A79D2C4F45;// 0x14800(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7643933C400B12E8BAF606BB456ADC67;// 0x148B0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CFF0489742B071CB9AA291B93B4FD189;// 0x148F8(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C9CBC4CF47540937A4D21E9C95BA8381;// 0x14988(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3CFC6F94421CFDBBBF92E08179A2862F;// 0x149D0(0x0048)
	struct FScriptMulticastDelegate                    EventUpper;                                               // 0x14A18(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x8];                                       // 0x14A28(0x0008) MISSED OFFSET
	struct FTransform                                  LHIKRelativeOffset;                                       // 0x14A30(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FTransform                                  RHIKRelativeOffset;                                       // 0x14A60(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FTransform                                  ChestIKRelativeOffset;                                    // 0x14A90(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              IKStretchSpine;                                           // 0x14AC0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IKStretchArms;                                            // 0x14AC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              IKStretchLegs;                                            // 0x14AC8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x14ACC(0x0004) MISSED OFFSET
	class UAnimationData*                              AnimationData;                                            // 0x14AD0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 LocomotionBlendspaceUpper;                                // 0x14AD8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FBP_TurningAnimations                       TurnLeftAnimations;                                       // 0x14AE0(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_TurningAnimations                       TurnRightAnimations;                                      // 0x14AF8(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               TurnOutShuffle;                                           // 0x14B10(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               JumpStartAnimation;                                       // 0x14B18(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 JumpCycleBlendspace;                                      // 0x14B20(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               JumpPreImpact;                                            // 0x14B28(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class AActor*                                      ControlledObject;                                         // 0x14B30(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	struct FObjectMessagingHandle                      RelinquishedControlEventHandle;                           // 0x14B38(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FObjectMessagingHandle                      TakenControlOfObjectEventHandle;                          // 0x14B80(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               WheelInto;                                                // 0x14BC8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FBP_WheelTurns                              WheelLeftTurn;                                            // 0x14BD0(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_WheelTurns                              WheelRightTurn;                                           // 0x14BE8(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_WheelArmOverlay                         WheelLeftArm;                                             // 0x14C00(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_WheelArmOverlay                         WheelRightArm;                                            // 0x14C10(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               CapstanAttach;                                            // 0x14C20(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CapstanDetach;                                            // 0x14C28(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UBlendSpace1D*>                       CapstanNeutral;                                           // 0x14C30(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UBlendSpace1D*>                       CapstanPush;                                              // 0x14C40(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UBlendSpace1D*>                       CapstanPull;                                              // 0x14C50(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UBlendSpace1D*                               CapstanUpperIntentBS;                                     // 0x14C60(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FBP_AnimSequenceVariants                    WheelLeftFingerIdleAnimations;                            // 0x14C68(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_AnimSequenceVariants                    WheelRightFingerIdleAnimations;                           // 0x14C78(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	int                                                CurrentRightHandIdle_1;                                   // 0x14C88(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurrentRightHandIdle_2;                                   // 0x14C8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurrentLeftHandIdle_1;                                    // 0x14C90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurrentLeftHandIdle_2;                                    // 0x14C94(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FBP_SailControlLogic                        SailControlLogic;                                         // 0x14C98(0x0028) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               CameraAdditiveDefaultYaw;                                 // 0x14CC0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CameraAdditiveWheelYaw;                                   // 0x14CC8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CameraAdditiveCapstanYaw;                                 // 0x14CD0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CameraAdditiveSailYaw;                                    // 0x14CD8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CameraAdditiveDefaultPitch;                               // 0x14CE0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CameraAdditiveWheelPitch;                                 // 0x14CE8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CameraAdditiveCapstanPitch;                               // 0x14CF0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               CameraAdditiveSailPitch;                                  // 0x14CF8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 OutOfRunBlendspace;                                       // 0x14D00(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 JumpLandLightBlendspace;                                  // 0x14D08(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 JumpLandHeavyBlendSpaces;                                 // 0x14D10(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      CharacterType_;                                           // 0x14D18(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ELadderState>                          LadderState;                                              // 0x14D20(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x14D21(0x0003) MISSED OFFSET
	float                                              LadderAnimationTime;                                      // 0x14D24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               IdleAnimation;                                            // 0x14D28(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                HandOverlayMontage;                                       // 0x14D30(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FAthenaAnimationDeathAnimData               DeathAnims;                                               // 0x14D38(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAthenaAnimationSwimmingAnimData            SwimmingAnims;                                            // 0x14D58(0x0068) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                      CurrentItem;                                              // 0x14DC0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FAthenaAnimationCannonConcealedAnimData     ConcealedCannonAnims;                                     // 0x14DC8(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                               ContinuousUse1Chosen;                                     // 0x14DD8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x14DD9(0x0007) MISSED OFFSET
	struct FObjectMessagingHandle                      EventDockedToObjectHandle;                                // 0x14DE0(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FObjectMessagingHandle                      EventUndockedFromObjectHandle;                            // 0x14E28(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               Camera_Additive_Ladder_Yaw;                               // 0x14E70(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               Camera_Additive_Ladder_Pitch;                             // 0x14E78(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFemale;                                                 // 0x14E80(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x14E81(0x0003) MISSED OFFSET
	float                                              WantedLeftArmForce;                                       // 0x14E84(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WantedRightArmForce;                                      // 0x14E88(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RowboatCameraAdjustment;                                  // 0x14E8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LeftOarActive;                                            // 0x14E90(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               RightOarActive;                                           // 0x14E91(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x14E92(0x0002) MISSED OFFSET
	struct FRandomStream                               IdlesRandomStream;                                        // 0x14E94(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("AnimBlueprintGeneratedClass BP_Humanoid_FirstPerson.BP_Humanoid_FirstPerson_C"));
		return ptr;
	}


	void ItemWielded(const TScriptInterface<class UWieldableInterface>& Item, struct FWieldAnimationParams* AnimParams);
	void Start_Stow(bool InputPin);
	void Start_Wield(const TScriptInterface<class UWieldableInterface>& Wielded_Item);
	void Update_Athena_Character(class AAthenaCharacter* AthenaCharacter);
	void CapstanRotationSpeed(float RotationSpeed);
	void DockingInterface(const struct FBP_Docking& Docking);
	void CapstanForce(float IndividualForce, const struct FTransform& LH_IK, const struct FTransform& RH_IK, class AActor* Actor);
