#pragma once

// Sea of Thieves (1.0.5) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Basic.hpp"
#include "SoT_RareAudio_classes.hpp"
#include "SoT_AthenaInput_classes.hpp"
#include "SoT_ObjectMessaging_classes.hpp"
#include "SoT_Engine_classes.hpp"
#include "SoT_AthenaSocketLookup_classes.hpp"
#include "SoT_AthenaRigging_classes.hpp"
#include "SoT_Maths_classes.hpp"
#include "SoT_Interaction_classes.hpp"
#include "SoT_CoreUObject_classes.hpp"
#include "SoT_CoherentUIGTPlugin_classes.hpp"
#include "SoT_AthenaAI_classes.hpp"
#include "SoT_Wind_classes.hpp"
#include "SoT_ActionStateMachine_classes.hpp"
#include "SoT_Animation_classes.hpp"
#include "SoT_Water_classes.hpp"
#include "SoT_InputCore_classes.hpp"
#include "SoT_PositionalVoice_classes.hpp"
#include "SoT_DebugMenu_classes.hpp"
#include "SoT_RareEngine_classes.hpp"
#include "SoT_GameService_classes.hpp"
#include "SoT_GameplayDebugger_classes.hpp"
#include "SoT_StudiosAutomation_classes.hpp"
#include "SoT_PirateGenerator_classes.hpp"
#include "SoT_Kraken_classes.hpp"
#include "SoT_AIModule_classes.hpp"
#include "SoT_WwiseAudio_classes.hpp"
#include "SoT_JsonUtilities_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Athena.ControlObjectActionRuleParams
// 0x0010
struct FControlObjectActionRuleParams
{
	TArray<TEnumAsByte<EWieldableItemSize>>            WieldableItemSizesToDisableControl;                       // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.IntentPredictorParams
// 0x0014
struct FIntentPredictorParams
{
	float                                              MaxValue;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DF];                                     // 0x0004(0x01DF) MISSED OFFSET
	float                                              MaxError;                                                 // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinError;                                                 // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinCorrectionVelocity;                                    // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinValue;                                                 // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.IntentPredictor
// 0x0018
struct FIntentPredictor
{
	struct FIntentPredictorParams                      Params;                                                   // 0x0000(0x0014) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.PlayerStat
// 0x0010
struct FPlayerStat
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.AchievementCriteria
// 0x0020
struct FAchievementCriteria
{
	TEnumAsByte<EPlayerStatsOperator>                  Operator;                                                 // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1E2];                                     // 0x0001(0x01E2) MISSED OFFSET
	struct FPlayerStat                                 PlayerStat;                                               // 0x01E3(0x0010) (Edit)
	uint64_t                                           Threshold;                                                // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AchievementDefinition
// 0x0020
struct FAchievementDefinition
{
	TArray<struct FAchievementCriteria>                UnlockCriteria;                                           // 0x0000(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x1D3];                                     // 0x0010(0x01D3) MISSED OFFSET
	struct FName                                       DevCenterId;                                              // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       FriendlyName;                                             // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.SkeletonAICharacterAudioStrategyAudioEvents
// 0x0028
struct FSkeletonAICharacterAudioStrategyAudioEvents
{
	class UWwiseEvent*                                 LeaveStrategyOneShot;                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UClass*                                      AIStrategy;                                               // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 PlayStrategyLoop;                                         // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 StopStrategyLoop;                                         // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 StartStrategyOneShot;                                     // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.ReplicatedAIPartsData
// 0x0010
struct FReplicatedAIPartsData
{
	int                                                TeamColorIndex;                                           // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DF];                                     // 0x0004(0x01DF) MISSED OFFSET
	class UAIPartsCategory*                            PartsCategory;                                            // 0x01E3(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                MeshIndex;                                                // 0x01E3(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AnimNotifyWwiseObserver
// 0x0018
struct FAnimNotifyWwiseObserver
{
	TArray<class UWwiseEvent*>                         AdditionalEventsToTrigger;                                // 0x0000(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x1D3];                                     // 0x0010(0x01D3) MISSED OFFSET
	class UWwiseEvent*                                 OnEventPosted;                                            // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAIEngageEnemyData
// 0x0010
struct FAthenaAIEngageEnemyData
{
	float                                              BestTargetRange;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DF];                                     // 0x0004(0x01DF) MISSED OFFSET
	class UClass*                                      EngageEnemyMethod;                                        // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAIItemEngageEnemyMethods
// 0x0018
struct FAthenaAIItemEngageEnemyMethods
{
	TArray<struct FAthenaAIEngageEnemyData>            EngageEnemyDataList;                                      // 0x0000(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x1D3];                                     // 0x0010(0x01D3) MISSED OFFSET
	class UClass*                                      ItemCategory;                                             // 0x01E3(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationCapstan
// 0x0158
struct FAthenaAnimationCapstan
{
	class AActor*                                      ControlledObject;                                         // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	float                                              IntentInterpSpeed;                                        // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   CapstanAngularVelocityRange;                              // 0x01E3(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   AnimationRemapSpeedRange;                                 // 0x01E3(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AngularVelocityInterpSpeed;                               // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FSocketId                                   LeftHandMaleSocket;                                       // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandMaleSocket;                                      // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   LeftHandFemaleSocket;                                     // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandFemaleSocket;                                    // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	float                                              TranslationStrength;                                      // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationStrength;                                         // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AnimationOverride;                                        // 0x01E3(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EAthenaAnimationCapstanState>          CapstanState;                                             // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              AngularVelocityWanted;                                    // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLocomotion
// 0x0040
struct FAthenaAnimationLocomotion
{
	float                                              TurnRateToDisableTurns;                                   // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DF];                                     // 0x0004(0x01DF) MISSED OFFSET
	struct FVector                                     CharacterVelocity;                                        // 0x01E3(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WantedMovementSpeed;                                      // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CharacterMoving;                                          // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RunStopWanted;                                            // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TurnRate;                                                 // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentYaw;                                               // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentDirection;                                         // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               TurningActive;                                            // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               TurningLeft;                                              // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsSwimming;                                               // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnderwaterSwimming;                                     // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MinimumMoveSpeedToTriggerRunStop;                         // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InterpSpeed;                                              // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.WieldAnimationParams
// 0x0001
struct FWieldAnimationParams
{
	TEnumAsByte<EWieldAnimationLocation>               WieldLocation;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectLocomotionAnimations
// 0x0038
struct FAthenaAnimationObjectLocomotionAnimations
{
	class UBlendSpace*                                 LocomotionSwimming;                                       // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UBlendSpace*                                 Locomotion1;                                              // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion2;                                              // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion3;                                              // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion4;                                              // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningLeft;                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningRight;                                   // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimations
// 0x0020
struct FAthenaAnimationObjectJumpingAnimations
{
	class UBlendSpace*                                 LandLight;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UBlendSpace*                                 Start;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Cycle;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 PreImpact;                                                // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectEquipAnimations
// 0x0028
struct FAthenaAnimationObjectEquipAnimations
{
	class UAnimSequence*                               Drop;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UAnimSequence*                               Equip;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 EquipSwimming;                                            // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               UnEquip;                                                  // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Pickup;                                                   // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectIdleAnimations
// 0x0018
struct FAthenaAnimationObjectIdleAnimations
{
	class UAnimSequence*                               Idle3;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UAnimSequence*                               Idle1;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Idle2;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShot
// 0x0030
struct FAthenaAnimationObjectActionOneShot
{
	class UAnimSequence*                               AlternateFail;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	TArray<class UAnimSequence*>                       MainAction;                                               // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               MainFail;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       AlternateAction;                                          // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousSwimming
// 0x0020
struct FAthenaAnimationObjectActionContinuousSwimming
{
	class UBlendSpace*                                 MainOutSwimming;                                          // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UBlendSpace*                                 MainInSwimming;                                           // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainOneShotInSwimming;                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainCycleSwimming;                                        // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLocomotionTurningAnimData
// 0x0008
struct FAthenaAnimationLocomotionTurningAnimData
{
	class UAnimSequence*                               Turn90;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStruct
// 0x0090
struct FAthenaAnimationObjectActionContinuousStruct
{
	class UAnimSequence*                               TurnOutAlt;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UAnimSequence*                               MainInto;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               OneShotInto;                                              // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               MainCycleIdle;                                            // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainCycleLocomotion;                                      // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               UseMainCycleJump;                                         // 0x01E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectJumpingAnimations     MainCycleJump;                                            // 0x01E3(0x0020) (Edit, BlueprintVisible)
	class UAnimSequence*                               MainOutOf;                                                // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               MainFail;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x01E3(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningLeftAlt;                                           // 0x01E3(0x0008) (Edit, BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningRightAlt;                                          // 0x01E3(0x0008) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuous
// 0x0120
struct FAthenaAnimationObjectActionContinuous
{
	struct FAthenaAnimationObjectActionContinuousStruct AlternateContinuousActions;                               // 0x0000(0x0090) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x153];                                     // 0x0090(0x0153) MISSED OFFSET
	struct FAthenaAnimationObjectActionContinuousStruct MainContinuousActions;                                    // 0x01E3(0x0090) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShotPitchOverride
// 0x0030
struct FAthenaAnimationObjectActionOneShotPitchOverride
{
	class UBlendSpace1D*                               AlternateFail;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	TArray<class UBlendSpace1D*>                       MainAction;                                               // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UBlendSpace1D*                               MainFail;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace1D*>                       AlternateAction;                                          // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimationsPitchOverride
// 0x0020
struct FAthenaAnimationObjectJumpingAnimationsPitchOverride
{
	class UBlendSpace1D*                               LandLight;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UBlendSpace1D*                               Start;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               Cycle;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               PreImpact;                                                // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStructPitchOverride
// 0x0080
struct FAthenaAnimationObjectActionContinuousStructPitchOverride
{
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x0000(0x0020) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x1C3];                                     // 0x0020(0x01C3) MISSED OFFSET
	class UBlendSpace1D*                               MainInto;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainCycleIdle;                                            // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainCycleLocomotion;                                      // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace1D*>                       VariantCycleIdle;                                         // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               UseMainCycleJump;                                         // 0x01E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride MainCycleJump;                                            // 0x01E3(0x0020) (Edit, BlueprintVisible)
	class UBlendSpace1D*                               MainOutOf;                                                // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainFail;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousPitchOverride
// 0x0100
struct FAthenaAnimationObjectActionContinuousPitchOverride
{
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride AlternateContinuousActions;                               // 0x0000(0x0080) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x163];                                     // 0x0080(0x0163) MISSED OFFSET
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride MainContinuousActions;                                    // 0x01E3(0x0080) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectComplexOneShot
// 0x0028
struct FAthenaAnimationObjectComplexOneShot
{
	class UAnimSequence*                               HeavyAttackStunRecover;                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UAnimSequence*                               WarmUp;                                                   // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               WarmUpFromBlock;                                          // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Action;                                                   // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Recover;                                                  // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectMeleeV2
// 0x0128
struct FAthenaAnimationObjectMeleeV2
{
	class UBlendSpace*                                 LungeWarmupLocomotion;                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacks;                                             // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacksStatic;                                       // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> SwimmingComboAttacks;                                     // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FAthenaAnimationObjectComplexOneShot        HeavyAttack;                                              // 0x01E3(0x0028) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectComplexOneShot        SwimmingHeavyAttack;                                      // 0x01E3(0x0028) (Edit, BlueprintVisible)
	class UAnimSequence*                               BlockingMainInto;                                         // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               BlockingIntoFromCombat;                                   // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpace;                                   // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequences;                                // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               BlockingOut;                                              // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               BlockingMainIntoSwimming;                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpaceSwimming;                           // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequencesSwimming;                        // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               BlockingOutSwimming;                                      // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectJumpingAnimations     BlockingJump;                                             // 0x01E3(0x0020) (Edit, BlueprintVisible)
	class UBlendSpace*                                 CombatLocomotion;                                         // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningLeft;                              // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningRight;                             // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurnOut;                                  // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Dodge;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectFacial
// 0x0070
struct FAthenaAnimationObjectFacial
{
	TArray<class UAnimMontage*>                        MeleeBlockReact;                                          // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData00[0x1D3];                                     // 0x0010(0x01D3) MISSED OFFSET
	TArray<class UAnimMontage*>                        PrimaryContinuous;                                        // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryContinuous;                                      // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        PrimaryOneShot;                                           // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryOneShot;                                         // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeBlocking;                                            // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeAttack;                                              // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotion
// 0x0010
struct FAthenaAnimationSkeletonKnockbackLocomotion
{
	class UAnimSequence*                               Backwards;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UAnimSequence*                               Forwards;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotionStrength
// 0x0020
struct FAthenaAnimationSkeletonKnockbackLocomotionStrength
{
	struct FAthenaAnimationSkeletonKnockbackLocomotion HighStrength;                                             // 0x0000(0x0010) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x1D3];                                     // 0x0010(0x01D3) MISSED OFFSET
	struct FAthenaAnimationSkeletonKnockbackLocomotion LowStrength;                                              // 0x01E3(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationCoreObjectAnimations
// 0x0860
struct FAthenaAnimationCoreObjectAnimations
{
	class UAnimSequence*                               ScreamStun;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	struct FAthenaAnimationObjectLocomotionAnimations  Locomotion;                                               // 0x01E3(0x0038) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectLocomotionAnimations  AlternateLocomotion;                                      // 0x01E3(0x0038) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     Jumping;                                                  // 0x01E3(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     AlternateJumping;                                         // 0x01E3(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectEquipAnimations       Equipping;                                                // 0x01E3(0x0028) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        Idles;                                                    // 0x01E3(0x0018) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        AlternateIdles;                                           // 0x01E3(0x0018) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionPrimarySingle;                                      // 0x01E3(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionPrimaryContinuous;                                  // 0x01E3(0x0120) (Edit, BlueprintVisible)
	bool                                               PrimaryActionPitchOverride;                               // 0x01E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionPrimarySinglePitchOverride;                         // 0x01E3(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionPrimaryContinuousPitchOverride;                     // 0x01E3(0x0100) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionSecondarySingle;                                    // 0x01E3(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionSecondaryContinuous;                                // 0x01E3(0x0120) (Edit, BlueprintVisible)
	bool                                               SecondaryActionPitchOverride;                             // 0x01E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionSecondarySinglePitchOverride;                       // 0x01E3(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionSecondaryContinuousPitchOverride;                   // 0x01E3(0x0100) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectMeleeV2               MeleeV2;                                                  // 0x01E3(0x0128) (Edit, BlueprintVisible)
	class UAnimSequence*                               HandAdditive;                                             // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FTransform                                  OffsetLeftHand;                                           // 0x01E3(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FTransform                                  OffsetRightHand;                                          // 0x01E3(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FWieldAnimationParams                       Params;                                                   // 0x01E3(0x0001) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectFacial                Facial;                                                   // 0x01E3(0x0070) (Edit, BlueprintVisible)
	bool                                               RangedWeapon;                                             // 0x01E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationSkeletonKnockbackLocomotionStrength KnockBack;                                                // 0x01E3(0x0020) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x65D];                                     // 0x0203(0x065D) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationObjectTargetingOptions
// 0x003C
struct FAthenaAnimationObjectTargetingOptions
{
	struct FVector                                     VirtualPivotOffsetLerped;                                 // 0x0000(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1D7];                                     // 0x000C(0x01D7) MISSED OFFSET
	TEnumAsByte<EObjectPitchTargetingLimbs>            ArmSelection;                                             // 0x01E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UpperClampTargetingAngle;                                 // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LowerClampTargetingAngle;                                 // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShoulderInfluenceUpper;                                   // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShoulderInfluenceLower;                                   // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetUpper;                                  // 0x01E3(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetLower;                                  // 0x01E3(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               LockHandOrientation;                                      // 0x01E3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationPitchControlStates
// 0x0168
struct FAthenaAnimationPitchControlStates
{
	struct FAthenaAnimationObjectTargetingOptions      Action2Water;                                             // 0x0000(0x003C) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x1A7];                                     // 0x003C(0x01A7) MISSED OFFSET
	struct FAthenaAnimationObjectTargetingOptions      StandardPassive;                                          // 0x01E3(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      StandardWater;                                            // 0x01E3(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1;                                                  // 0x01E3(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1Water;                                             // 0x01E3(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action2;                                                  // 0x01E3(0x003C) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelay
// 0x000C
struct FAthenaAnimationFirstPersonTurnDelay
{
	float                                              DelayInSpeed;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DF];                                     // 0x0004(0x01DF) MISSED OFFSET
	float                                              MaxAngle;                                                 // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DelayOutSpeed;                                            // 0x01E3(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelayStates
// 0x0020
struct FAthenaAnimationFirstPersonTurnDelayStates
{
	float                                              InvTurnDelayAngle;                                        // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DF];                                     // 0x0004(0x01DF) MISSED OFFSET
	struct FAthenaAnimationFirstPersonTurnDelay        PassiveState;                                             // 0x01E3(0x000C) (Edit, BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelay        ContinuousUse;                                            // 0x01E3(0x000C) (Edit, BlueprintVisible)
	float                                              TurnDelayAngle;                                           // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLoadObjectsWrapper
// 0x09F0
struct FAthenaAnimationLoadObjectsWrapper
{
	class UClass*                                      ObjectID;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	struct FAthenaAnimationCoreObjectAnimations        ObjectAnimation;                                          // 0x01E3(0x0860) (Edit, BlueprintVisible)
	struct FAthenaAnimationPitchControlStates          ObjectTargeting3rdPerson;                                 // 0x01E3(0x0168) (Edit, BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelayStates  FirstPersonTurnDelay;                                     // 0x01E3(0x0020) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData01[0x7ED];                                     // 0x0203(0x07ED) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationHandHeldItemParams
// 0x0020
struct FAthenaAnimationHandHeldItemParams
{
	bool                                               Reload;                                                   // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1E2];                                     // 0x0001(0x01E2) MISSED OFFSET
	bool                                               LeftArmOverlayActive;                                     // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               RightArmOverlayActive;                                    // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               UpperBodyOverlayActive;                                   // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               FullBodyOverlayActive;                                    // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SpineOverlayActive;                                       // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SpineLockActive;                                          // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ObjectActive;                                             // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ObjectOverrideStateActive;                                // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class FString                                      OverlayAnimationName;                                     // 0x01E3(0x0010) (BlueprintVisible, ZeroConstructor)
	TEnumAsByte<EItemPassiveState>                     ObjectPassiveState;                                       // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               QuickStow;                                                // 0x01E3(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationIdleVariantChange
// 0x0010
struct FAthenaAnimationIdleVariantChange
{
	bool                                               VariantCompleted;                                         // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1E2];                                     // 0x0001(0x01E2) MISSED OFFSET
	float                                              CurrentTime;                                              // 0x01E3(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TriggerTime;                                              // 0x01E3(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VariantID;                                                // 0x01E3(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.HandOnWheelAnimationRanges
// 0x0040
struct FHandOnWheelAnimationRanges
{
	struct FFloatRange                                 RightHandOnWheelB;                                        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1D3];                                     // 0x0010(0x01D3) MISSED OFFSET
	struct FFloatRange                                 LeftHandOnWheelA;                                         // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 LeftHandOnWheelB;                                         // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightHandOnWheelA;                                        // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.WheelIKActivationRanges
// 0x0040
struct FWheelIKActivationRanges
{
	struct FFloatRange                                 RightArmDownRangeB;                                       // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1D3];                                     // 0x0010(0x01D3) MISSED OFFSET
	struct FFloatRange                                 LeftArmDownRangeA;                                        // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 LeftArmDownRangeB;                                        // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightArmDownRangeA;                                       // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationWheel
// 0x01D0
struct FAthenaAnimationWheel
{
	class AActor*                                      ControlledObject;                                         // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	struct FSocketId                                   LeftHandMaleSocket;                                       // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandMaleSocket;                                      // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   LeftHandFemaleSocket;                                     // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandFemaleSocket;                                    // 0x01E3(0x0020) (Edit, DisableEditOnInstance)
	float                                              TranslationStrength;                                      // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationStrength;                                         // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x01E3(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FHandOnWheelAnimationRanges                 HandOnWheelAnimationRanges;                               // 0x01E3(0x0040) (Edit, DisableEditOnInstance)
	struct FWheelIKActivationRanges                    WheelArmIKDownWithinRange;                                // 0x01E3(0x0040) (Edit, DisableEditOnInstance)
	TEnumAsByte<EWheelAnimationType>                   WheelAnimationType;                                       // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WheelTime;                                                // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WheelDirection;                                           // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RightFingerAlpha;                                         // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LeftFingerAlpha;                                          // 0x01E3(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               LeftWheelArmDown;                                         // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RightWheelArmDown;                                        // 0x01E3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationControllableFacialAnimData
// 0x0028
struct FAthenaAnimationControllableFacialAnimData
{
	class UAnimSequence*                               CannonAim;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1DB];                                     // 0x0008(0x01DB) MISSED OFFSET
	class UBlendSpace1D*                               Capstan;                                                  // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SailAction;                                               // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SailIdle;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CannonFire;                                               // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationFacialAnimData
// 0x0080
struct FAthenaAnimationFacialAnimData
{
	TEnumAsByte<EFacialPriority>                       CurrentFacialPriority;                                    // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1E2];                                     // 0x0001(0x01E2) MISSED OFFSET
	int                                                FacialIdleAnimationIndex0;                                // 0x01E3(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FacialIdleAnimationIndex1;                                // 0x01E3(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       IdleAnimations;                                           // 0x01E3(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               Death;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               HitReact;                                                 // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationControllableFacialAnimData  Controllables;                                            // 0x01E3(0x0028) (Edit, BlueprintVisible)
	class UAnimMontage*                                Sick;                                                     // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Cough;                                                    // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               UnderwaterIdle;                                           // 0x01E3(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
