#pragma once

// Sea of Thieves (2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Engine_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.ActorComponent
// 0x00A0 (0x00C8 - 0x0028)
class UActorComponent : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	FActorComponentTickFunction                        PrimaryComponentTick;                                     // 0x0030(0x0050) (Edit, DisableEditOnInstance)
	TArray<FName>                                      ComponentTags;                                            // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<FSimpleMemberReference>                     UCSModifiedProperties;                                    // 0x0090(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x10];                                      // 0x00A0(0x0010) MISSED OFFSET
	TArray<UAssetUserData*>                            AssetUserData;                                            // 0x00B0(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData02 : 3;                                        // 0x00C0(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x00C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bNetAddressable : 1;                                      // 0x00C0(0x0001)
	unsigned char                                      UnknownData03 : 3;                                        // 0x00C0(0x0001)
	unsigned char                                      UnknownData04 : 6;                                        // 0x00C1(0x0001)
	unsigned char                                      bCreatedByConstructionScript : 1;                         // 0x00C1(0x0001) (Deprecated)
	unsigned char                                      bInstanceComponent : 1;                                   // 0x00C1(0x0001) (Deprecated)
	unsigned char                                      bAutoActivate : 1;                                        // 0x00C2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsActive : 1;                                            // 0x00C2(0x0001) (Net, Transient)
	unsigned char                                      bEditableWhenInherited : 1;                               // 0x00C2(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData05 : 5;                                        // 0x00C2(0x0001)
	unsigned char                                      UnknownData06 : 3;                                        // 0x00C3(0x0001)
	unsigned char                                      bNeedsLoadForClient : 1;                                  // 0x00C3(0x0001) (Edit)
	unsigned char                                      bNeedsLoadForServer : 1;                                  // 0x00C3(0x0001) (Edit)
	TEnumAsByte<EComponentNetDormancy>                 TargetNetDormancy;                                        // 0x00C4(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EComponentCreationMethod>              CreationMethod;                                           // 0x00C5(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x00C6(0x0002) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.ActorComponent"));
		return ptr;
	}


	void ToggleActive();
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetIsReplicated(bool ShouldReplicate);
	void SetComponentTickEnabled(bool bEnabled);
	void SetActive(bool bNewActive, bool bReset);
	void RemoveTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	void ReceiveBeginPlay();
	void OnRep_IsActive();
	void K2_DestroyComponent(UObject* Object);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool IsActive();
	TEnumAsByte<EComponentNetDormancy> GetTargetNetDormancy();
	AActor* GetOwner();
	bool FlushNetDormancy();
	void Deactivate();
	bool ComponentHasTag(const FName& Tag);
	void AddTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(AActor* PrerequisiteActor);
	void Activate(bool bReset);
};


// Class Engine.Actor
// 0x03A8 (0x03D0 - 0x0028)
class AActor : public UObject
{
public:
	FActorTickFunction                                 PrimaryActorTick;                                         // 0x0028(0x0050) (Edit, DisableEditOnInstance)
	float                                              CustomTimeDilation;                                       // 0x0078(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bAllowRemovalFromServerWhenCollisionMerged : 1;           // 0x007C(0x0001) (Edit)
	unsigned char                                      bAllowRemovalFromServerWhenAutomaticallyInstanced : 1;    // 0x007C(0x0001) (Edit)
	unsigned char                                      bHidden : 1;                                              // 0x007C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bNetTemporary : 1;                                        // 0x007C(0x0001)
	unsigned char                                      bNetStartup : 1;                                          // 0x007C(0x0001)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                 // 0x007C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bAlwaysRelevant : 1;                                      // 0x007C(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bReplicateMovement : 1;                                   // 0x007C(0x0001) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      bTearOff : 1;                                             // 0x007D(0x0001)
	unsigned char                                      bExchangedRoles : 1;                                      // 0x007D(0x0001) (Transient)
	unsigned char                                      bPendingNetUpdate : 1;                                    // 0x007D(0x0001) (Transient)
	unsigned char                                      bNetLoadOnClient : 1;                                     // 0x007D(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                // 0x007D(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bBlockInput : 1;                                          // 0x007D(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00 : 1;                                        // 0x007D(0x0001)
	unsigned char                                      bCanBeInCluster : 1;                                      // 0x007D(0x0001) (Edit)
	unsigned char                                      UnknownData01 : 2;                                        // 0x007E(0x0001)
	unsigned char                                      bActorEnableCollision : 1;                                // 0x007E(0x0001)
	unsigned char                                      UnknownData02 : 1;                                        // 0x007E(0x0001)
	unsigned char                                      bReplicateAttachment : 1;                                 // 0x007E(0x0001)
	unsigned char                                      UnknownData03 : 1;                                        // 0x007E(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x007E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData04[0x1];                                       // 0x007F(0x0001) MISSED OFFSET
	FScriptMulticastSparseDelegate                     OnPreNetOwnershipChange;                                  // 0x0080(0x0001) (InstancedReference, BlueprintAssignable)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0081(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x6];                                       // 0x0082(0x0006) MISSED OFFSET
	AActor*                                            Owner;                                                    // 0x0088(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EActorSpawnRestrictions>               SpawnRestrictions;                                        // 0x0090(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0091(0x0003) MISSED OFFSET
	FRepMovement                                       ReplicatedMovement;                                       // 0x0094(0x0038) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      UnknownData07[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET
	FRepAttachment                                     AttachmentReplication;                                    // 0x00D0(0x0048) (Net, Transient)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x0118(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x1];                                       // 0x0119(0x0001) MISSED OFFSET
	TEnumAsByte<EAutoReceiveInput>                     AutoReceiveInput;                                         // 0x011A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x1];                                       // 0x011B(0x0001) MISSED OFFSET
	int                                                InputPriority;                                            // 0x011C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	UInputComponent*                                   InputComponent;                                           // 0x0120(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              NetCullDistanceSquared;                                   // 0x0128(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x4];                                       // 0x012C(0x0004) MISSED OFFSET
	int                                                NetTag;                                                   // 0x0130(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              NetUpdateTime;                                            // 0x0134(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              NetUpdateFrequency;                                       // 0x0138(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NetPriority;                                              // 0x013C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LastNetUpdateTime;                                        // 0x0140(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	FName                                              NetDriverName;                                            // 0x0144(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                             // 0x014C(0x0001) (BlueprintVisible)
	unsigned char                                      bCanBeDamaged : 1;                                        // 0x014C(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bActorIsBeingDestroyed : 1;                               // 0x014C(0x0001) (Transient, DuplicateTransient)
	unsigned char                                      bCollideWhenPlacing : 1;                                  // 0x014C(0x0001)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                   // 0x014C(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bRelevantForNetworkReplays : 1;                           // 0x014C(0x0001)
	unsigned char                                      UnknownData11[0x3];                                       // 0x014D(0x0003) MISSED OFFSET
	TEnumAsByte<ESpawnActorCollisionHandlingMethod>    SpawnCollisionHandlingMethod;                             // 0x0150(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0x7];                                       // 0x0151(0x0007) MISSED OFFSET
	APawn*                                             Instigator;                                               // 0x0158(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	TArray<AActor*>                                    Children;                                                 // 0x0160(0x0010) (ZeroConstructor, Transient)
	USceneComponent*                                   RootComponent;                                            // 0x0170(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<AMatineeActor*>                             ControllingMatineeActors;                                 // 0x0178(0x0010) (ZeroConstructor, Transient)
	float                                              InitialLifeSpan;                                          // 0x0188(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x4];                                       // 0x018C(0x0004) MISSED OFFSET
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;              // 0x0190(0x0001)
	unsigned char                                      UnknownData14[0x7];                                       // 0x0191(0x0007) MISSED OFFSET
	TArray<FName>                                      Layers;                                                   // 0x0198(0x0010) (ZeroConstructor)
	FActorPtr                                          ParentComponentActor;                                     // 0x01A8(0x0008)
	TArray<TWeakObjectPtr<class AActor>>               ChildComponentActors;                                     // 0x01B0(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData15[0x8];                                       // 0x01C0(0x0008) MISSED OFFSET
	unsigned char                                      bActorSeamlessTraveled : 1;                               // 0x01C8(0x0001)
	unsigned char                                      bIgnoresOriginShifting : 1;                               // 0x01C8(0x0001) (Edit)
	unsigned char                                      bEnableAutoLODGeneration : 1;                             // 0x01C8(0x0001) (Edit)
	unsigned char                                      UnknownData16[0x7];                                       // 0x01C9(0x0007) MISSED OFFSET
	TArray<FName>                                      Tags;                                                     // 0x01D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	FName                                              Feature;                                                  // 0x01E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	uint64_t                                           HiddenEditorViews;                                        // 0x01E8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	FScriptMulticastSparseDelegate                     OnActorBeginOverlap;                                      // 0x01F0(0x0001) (InstancedReference, BlueprintAssignable)
	FScriptMulticastSparseDelegate                     OnActorEndOverlap;                                        // 0x01F1(0x0001) (InstancedReference, BlueprintAssignable)
	FScriptMulticastSparseDelegate                     OnActorHit;                                               // 0x01F2(0x0001) (InstancedReference, BlueprintAssignable)
	FScriptMulticastSparseDelegate                     OnDestroyed;                                              // 0x01F3(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData17[0x3C];                                      // 0x01F4(0x003C) MISSED OFFSET
	FScriptMulticastSparseDelegate                     OnEndPlay;                                                // 0x0230(0x0001) (InstancedReference, BlueprintAssignable)
	bool                                               bDoOverlapNotifiesOnLoad;                                 // 0x0231(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData18[0xF6];                                      // 0x0232(0x00F6) MISSED OFFSET
	TArray<UActorComponent*>                           BlueprintCreatedComponents;                               // 0x0328(0x0010) (ExportObject, ZeroConstructor)
	TArray<UActorComponent*>                           InstanceComponents;                                       // 0x0338(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData19[0x8];                                       // 0x0348(0x0008) MISSED OFFSET
	TArray<AActor*>                                    ChildActorInterfaceProviders;                             // 0x0350(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData20[0x68];                                      // 0x0360(0x0068) MISSED OFFSET
	double                                             DormancyLingeringInSeconds;                               // 0x03C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.Actor"));
		return ptr;
	}


	void UserConstructionScript();
	void TearOff();
	void SnapRootComponentTo(AActor* InParentActor, const FName& InSocketName);
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetReplicates(bool bInReplicates);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetOwner(AActor* NewOwner);
	void SetLifeSpan(float InLifespan);
	void SetIgnoreNetTransformUpdates(bool bInIgnoreNetTransformUpdates);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorScale3D(const FVector& NewScale3D);
	bool SetActorRotation(const FRotator& NewRotation);
	void SetActorRelativeScale3D(const FVector& NewRelativeScale);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void RemoveTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveRadialDamage(float DamageReceived, UDamageType* DamageType, const FVector& Origin, const FHitResult& HitInfo, AController* InstigatedBy, AActor* DamageCauser);
	void ReceivePointDamage(float Damage, UDamageType* DamageType, const FVector& HitLocation, const FVector& HitNormal, UPrimitiveComponent* HitComponent, const FName& BoneName, const FVector& ShotFromDirection, AController* InstigatedBy, AActor* DamageCauser);
	void ReceiveHit(UPrimitiveComponent* MyComp, AActor* Other, UPrimitiveComponent* OtherComp, bool bSelfMoved, const FVector& HitLocation, const FVector& HitNormal, const FVector& NormalImpulse, const FHitResult& Hit);
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAnyDamage(float Damage, UDamageType* DamageType, AController* InstigatedBy, AActor* DamageCauser);
	void ReceiveActorOnReleased();
	void ReceiveActorOnInputTouchLeave(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnter(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnd(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchBegin(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnClicked();
	void ReceiveActorEndOverlap(AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(AActor* OtherActor);
	void ReceiveActorBeginCursorOver();
	void OnRep_Role();
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void OnEndPlayDynamicMulticastEvent__DelegateSignature(AActor* EndPlayActor);
	void OnDestroyedDynamicMulticastEvent__DelegateSignature(AActor* DeletedActor);
	void MakeNoise(float Loudness, APawn* NoiseInstigator, const FVector& NoiseLocation, float MaxRange, const FName& Tag);
	UMaterialInstanceDynamic* MakeMIDForMaterial(UMaterialInterface* Parent);
	bool K2_TeleportTo(const FVector& DestLocation, const FRotator& DestRotation);
	bool K2_SetActorTransform(const FTransform& NewTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetActorRelativeTransform(const FTransform& NewRelativeTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetActorRelativeRotation(const FRotator& NewRelativeRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetActorRelativeLocation(const FVector& NewRelativeLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	bool K2_SetActorLocationAndRotation(const FVector& NewLocation, const FRotator& NewRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	bool K2_SetActorLocation(const FVector& NewLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_OnReset();
	void K2_OnEndViewTarget(APlayerController* PC);
	void K2_OnBecomeViewTarget(APlayerController* PC);
	USceneComponent* K2_GetRootComponent();
	FRotator K2_GetActorRotation();
	FVector K2_GetActorLocation();
	void K2_DestroyComponent(UActorComponent* Component);
	void K2_DestroyActor();
	void K2_AttachRootComponentToActor(AActor* InParentActor, const FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentTo(USceneComponent* InParent, const FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransform(const FTransform& DeltaTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddActorWorldRotation(const FRotator& DeltaRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddActorWorldOffset(const FVector& DeltaLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddActorLocalTransform(const FTransform& NewTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddActorLocalRotation(const FRotator& DeltaRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddActorLocalOffset(const FVector& DeltaLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	bool IsOverlappingActor(AActor* Other);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasNetOwner();
	bool HasAuthority();
	float GetVerticalDistanceTo(AActor* OtherActor);
	FVector GetVelocity();
	FTransform GetTransform();
	bool GetTickableWhenPaused();
	unsigned char GetPxActorCapacityForPhysXAggregate();
	AActor* GetParentActor();
	AActor* GetOwner();
	void GetOverlappingComponents(TArray<UPrimitiveComponent*>* OverlappingComponents);
	void GetOverlappingActors(UClass* ClassFilter, TArray<AActor*>* OverlappingActors);
	float GetLifeSpan();
	UObject* GetInterfaceImplementer(UClass* InterfaceClass);
	AController* GetInstigatorController();
	APawn* GetInstigator();
	FVector GetInputVectorAxisValue(const FKey& InputAxisKey);
	float GetInputAxisValue(const FName& InputAxisName);
	float GetInputAxisKeyValue(const FKey& InputAxisKey);
	float GetHorizontalDotProductTo(AActor* OtherActor);
	float GetHorizontalDistanceTo(AActor* OtherActor);
	float GetDotProductTo(AActor* OtherActor);
	float GetDistanceTo(AActor* OtherActor);
	TArray<UActorComponent*> GetComponentsByTag(UClass* ComponentClass, const FName& Tag);
	TArray<UActorComponent*> GetComponentsByClass(UClass* ComponentClass);
	void GetComponentInterfacesByClass(UClass* InterfaceClass, TArray<UActorComponent*>* OutInterfaces);
	UActorComponent* GetComponentInterfaceByClass(UClass* InterfaceClass);
	UActorComponent* GetComponentByClass(UClass* ComponentClass);
	AActor* GetAttachParentActor();
	FVector GetActorUpVector();
	float GetActorTimeDilation();
	FVector GetActorScale3D();
	FVector GetActorRightVector();
	FVector GetActorRelativeScale3D();
	FVector GetActorForwardVector();
	void GetActorEyesViewPoint(FVector* OutLocation, FRotator* OutRotation);
	bool GetActorEnableCollision();
	void GetActorBounds(bool bOnlyCollidingComponents, FVector* Origin, FVector* BoxExtent);
	void ForceNetUpdate();
	bool FlushNetDormancy();
	void EnableInput(APlayerController* PlayerController);
	void DisableInput(APlayerController* PlayerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void AttachRootComponentToNoReplication(USceneComponent* InParent, const FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void AttachActorToActorNoReplication(AActor* InParentActor, const FName& InSocketName, bool bWeldSimulatedBodies);
	void AddTickPrerequisiteComponent(UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(AActor* PrerequisiteActor);
	UActorComponent* AddComponent(const FName& TemplateName, bool bManualAttachment, const FTransform& RelativeTransform, UObject* ComponentTemplateContext);
	bool ActorHasTag(const FName& Tag);
};


// Class Engine.DataAsset
// 0x0000 (0x0028 - 0x0028)
class UDataAsset : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.DataAsset"));
		return ptr;
	}

};


// Class Engine.BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintFunctionLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.BlueprintFunctionLibrary"));
		return ptr;
	}

};


// Class Engine.SceneComponent
// 0x01E8 (0x02B0 - 0x00C8)
class USceneComponent : public UActorComponent
{
public:
	USceneComponent*                                   AttachParent;                                             // 0x00C8(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<USceneComponent*>                           AttachChildren;                                           // 0x00D0(0x0010) (ExportObject, ZeroConstructor, Transient)
	FName                                              AttachSocketName;                                         // 0x00E0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bRequiresCustomLocation : 1;                              // 0x00E8(0x0001)
	unsigned char                                      bAbsoluteLocation : 1;                                    // 0x00E8(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteTranslation : 1;                                 // 0x00E8(0x0001) (Deprecated)
	unsigned char                                      bAbsoluteRotation : 1;                                    // 0x00E8(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteScale : 1;                                       // 0x00E8(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bVisible : 1;                                             // 0x00E8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bHiddenInGame : 1;                                        // 0x00E8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bShouldUpdatePhysicsVolume : 1;                           // 0x00E8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bBoundsChangeTriggersStreamingDataRebuild : 1;            // 0x00E9(0x0001)
	unsigned char                                      bUseAttachParentBound : 1;                                // 0x00E9(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bComponentIsUnionOfChildren : 1;                          // 0x00E9(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00 : 1;                                        // 0x00E9(0x0001)
	unsigned char                                      bJitterReduction : 1;                                     // 0x00E9(0x0001) (Edit)
	unsigned char                                      UnknownData01 : 1;                                        // 0x00E9(0x0001)
	unsigned char                                      CacheRootVelocity : 1;                                    // 0x00E9(0x0001) (Edit)
	unsigned char                                      bWorldToComponentUpdated : 1;                             // 0x00E9(0x0001) (Transient)
	unsigned char                                      UnknownData02[0xE];                                       // 0x00EA(0x000E) MISSED OFFSET
	TWeakObjectPtr<class APhysicsVolume>               PhysicsVolume;                                            // 0x00F8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1C];                                      // 0x0100(0x001C) MISSED OFFSET
	FVector                                            RelativeScale3D;                                          // 0x011C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	FVector                                            RelativeLocation;                                         // 0x0128(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	FRotator                                           RelativeRotation;                                         // 0x0134(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0xE0];                                      // 0x0140(0x00E0) MISSED OFFSET
	TEnumAsByte<EComponentMobility>                    Mobility;                                                 // 0x0220(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EDetailMode>                           DetailMode;                                               // 0x0221(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0xA];                                       // 0x0222(0x000A) MISSED OFFSET
	FVector                                            ComponentVelocity;                                        // 0x022C(0x000C) (ZeroConstructor, IsPlainOldData)
	FScriptMulticastDelegate                           PhysicsVolumeChangedDelegate;                             // 0x0238(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData06[0x10];                                      // 0x0248(0x0010) MISSED OFFSET
	TArray<FName>                                      SocketVelocitiesToCache;                                  // 0x0258(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData07[0x48];                                      // 0x0268(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.SceneComponent"));
		return ptr;
	}

	FBoxSphereBounds GetBounds()
	{
		return *reinterpret_cast<FBoxSphereBounds*>(reinterpret_cast<uintptr_t>(this) + 0x100);
	}


	void ToggleVisibility(bool bPropagateToChildren);
	void SnapTo(USceneComponent* InParent, const FName& InSocketName);
	bool SharesBasis(USceneComponent* Other);
	void SetWorldScale3D(const FVector& NewScale);
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
	void SetRelativeScale3D(const FVector& NewScale3D);
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool OldValue);
	void OnRep_Transform();
	bool K2_TryGetCachedSocketVelocity(const FName& SocketName, FVector* OutVelocity);
	void K2_SetWorldTransform(const FTransform& NewTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetWorldRotation(const FRotator& NewRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetWorldLocationAndRotation(const FVector& NewLocation, const FRotator& NewRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetWorldLocation(const FVector& NewLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetRelativeTransform(const FTransform& NewTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetRelativeRotation(const FRotator& NewRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetRelativeLocationAndRotation(const FVector& NewLocation, const FRotator& NewRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_SetRelativeLocation(const FVector& NewLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	FTransform K2_GetComponentToWorld();
	FVector K2_GetComponentScale();
	FRotator K2_GetComponentRotation();
	FVector K2_GetComponentLocation();
	void K2_AttachTo(USceneComponent* InParent, const FName& InSocketName, TEnumAsByte<EAttachLocation> AttachType, bool bWeldSimulatedBodies);
	void K2_AddWorldTransform(const FTransform& DeltaTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddWorldRotation(const FRotator& DeltaRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddWorldOffset(const FVector& DeltaLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddRelativeRotation(const FRotator& DeltaRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddRelativeLocation(const FVector& DeltaLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddLocalTransform(const FTransform& DeltaTransform, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddLocalRotation(const FRotator& DeltaRotation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	void K2_AddLocalOffset(const FVector& DeltaLocation, bool bSweep, bool bTeleport, FHitResult* SweepHitResult);
	bool IsVisible();
	bool IsSimulatingPhysics(const FName& BoneName);
	bool IsAnySimulatingPhysics();
	FVector GetUpVector();
	FTransform GetSocketTransform(const FName& InSocketName, TEnumAsByte<ERelativeTransformSpace> TransformSpace);
	FRotator GetSocketRotation(const FName& InSocketName);
	FQuat GetSocketQuaternion(const FName& InSocketName);
	FVector GetSocketLocation(const FName& InSocketName);
	FVector GetRightVector();
	FTransform GetRelativeTransform();
	APhysicsVolume* GetPhysicsVolume();
	void GetParentComponents(TArray<USceneComponent*>* Parents);
	int GetNumChildrenComponents();
	FVector GetForwardVector();
	FVector GetComponentVelocity();
	void GetChildrenComponents(bool bIncludeAllDescendants, TArray<USceneComponent*>* Children);
	USceneComponent* GetChildComponent(int ChildIndex);
	FName GetAttachSocketName();
	USceneComponent* GetAttachParent();
	FTransform GetAttachedBasisTransform();
	TArray<FName> GetAllSocketNames();
	bool DoesSocketExist(const FName& InSocketName);
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};


// Class Engine.Pawn
// 0x0078 (0x0448 - 0x03D0)
class APawn : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x03D0(0x0008) MISSED OFFSET
	unsigned char                                      bUseControllerRotationPitch : 1;                          // 0x03D8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseControllerRotationYaw : 1;                            // 0x03D8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseControllerRotationRoll : 1;                           // 0x03D8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bCanAffectNavigationGeneration : 1;                       // 0x03D8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData01[0x3];                                       // 0x03D9(0x0003) MISSED OFFSET
	float                                              BaseEyeHeight;                                            // 0x03DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAutoReceiveInput>                     AutoPossessPlayer;                                        // 0x03E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAutoPossessAI>                        AutoPossessAI;                                            // 0x03E1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x03E2(0x0006) MISSED OFFSET
	UClass*                                            AIControllerClass;                                        // 0x03E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	APlayerState*                                      PlayerState;                                              // 0x03F0(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      RemoteViewPitch;                                          // 0x03F8(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x03F9(0x0007) MISSED OFFSET
	AController*                                       LastHitBy;                                                // 0x0400(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	AController*                                       Controller;                                               // 0x0408(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x18];                                      // 0x0410(0x0018) MISSED OFFSET
	FVector                                            ControlInputVector;                                       // 0x0428(0x000C) (ZeroConstructor, Transient, IsPlainOldData)
	FVector                                            LastControlInputVector;                                   // 0x0434(0x000C) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x8];                                       // 0x0440(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.Pawn"));
		return ptr;
	}


	void SpawnDefaultController();
	void SetCanAffectNavigationGeneration(bool bNewValue);
	void ReceiveUnpossessed(AController* OldController);
	void ReceivePossessed(AController* NewController);
	void PawnMakeNoise(float Loudness, const FVector& NoiseLocation, bool bUseNoiseMakerLocation, AActor* NoiseMaker);
	void OnRep_PlayerState();
	void OnRep_Controller();
	void LaunchPawn(const FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);
	FVector K2_GetMovementInputVector();
	bool IsMoveInputIgnored();
	bool IsLocallyControlled();
	bool IsControlled();
	FVector GetPendingMovementInputVector();
	FVector GetNavAgentLocation();
	UPawnMovementComponent* GetMovementComponent();
	static AActor* GetMovementBaseActor(APawn* Pawn);
	FVector GetLastMovementInputVector();
	FRotator GetControlRotation();
	AController* GetController();
	FRotator GetBaseAimRotation();
	void DetachFromControllerPendingDestroy();
	FVector ConsumeMovementInputVector();
	void AddMovementInput(const FVector& WorldDirection, float ScaleValue, bool bForce);
	void AddControllerYawInput(float Val);
	void AddControllerRollInput(float Val);
	void AddControllerPitchInput(float Val);
};


// Class Engine.Character
// 0x0198 (0x05E0 - 0x0448)
class ACharacter : public APawn
{
public:
	USkeletalMeshComponent*                            Mesh;                                                     // 0x0448(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	UCharacterMovementComponent*                       CharacterMovement;                                        // 0x0450(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	UCapsuleComponent*                                 CapsuleComponent;                                         // 0x0458(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	FBasedMovementInfo                                 BasedMovement;                                            // 0x0460(0x0038)
	FBasedMovementInfo                                 ReplicatedBasedMovement;                                  // 0x0498(0x0038) (Net)
	FVector                                            BaseTranslationOffset;                                    // 0x04D0(0x000C) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x04DC(0x0004) MISSED OFFSET
	FQuat                                              BaseRotationOffset;                                       // 0x04E0(0x0010) (IsPlainOldData)
	unsigned char                                      ReplicatedMovementMode;                                   // 0x04F0(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	bool                                               bInBaseReplication;                                       // 0x04F1(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x04F2(0x0002) MISSED OFFSET
	float                                              CrouchedEyeHeight;                                        // 0x04F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsCrouched : 1;                                          // 0x04F8(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bPressedJump : 1;                                         // 0x04F8(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bClientUpdating : 1;                                      // 0x04F8(0x0001) (Transient)
	unsigned char                                      bClientWasFalling : 1;                                    // 0x04F8(0x0001) (Transient)
	unsigned char                                      bClientResimulateRootMotion : 1;                          // 0x04F8(0x0001) (Transient)
	unsigned char                                      bSimGravityDisabled : 1;                                  // 0x04F8(0x0001)
	unsigned char                                      bServerMoveIgnoreRootMotion : 1;                          // 0x04F8(0x0001) (Transient)
	unsigned char                                      UnknownData02[0x3];                                       // 0x04F9(0x0003) MISSED OFFSET
	float                                              JumpKeyHoldTime;                                          // 0x04FC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	float                                              JumpMaxHoldTime;                                          // 0x0500(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0504(0x0004) MISSED OFFSET
	FScriptMulticastDelegate                           OnReachedJumpApex;                                        // 0x0508(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0x10];                                      // 0x0518(0x0010) MISSED OFFSET
	FScriptMulticastDelegate                           OnCharacterMovementUpdated;                               // 0x0528(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData05[0x8];                                       // 0x0538(0x0008) MISSED OFFSET
	FRootMotionMovementParams                          ClientRootMotionParams;                                   // 0x0540(0x0040) (Transient)
	TArray<FSimulatedRootMotionReplicatedMove>         RootMotionRepMoves;                                       // 0x0580(0x0010) (ZeroConstructor, Transient)
	FRepRootMotionMontage                              RepRootMotion;                                            // 0x0590(0x0040) (Net)
	unsigned char                                      UnknownData06[0x10];                                      // 0x05D0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.Character"));
		return ptr;
	}


	void UnCrouch(bool bClientSimulation);
	void StopJumping();
	void StopAnimMontage(UAnimMontage* AnimMontage);
	void SetReplicateMovement(bool bInReplicateMovement);
	float PlayAnimMontage(UAnimMontage* AnimMontage, float InPlayRate, const FName& StartSectionName);
	void OnWalkingOffLedge(const FVector& PreviousFloorImpactNormal, const FVector& PreviousFloorContactNormal, const FVector& PreviousLocation, float TimeDelta);
	void OnRep_RootMotion();
	void OnRep_ReplicatedBasedMovement();
	void OnRep_IsCrouched();
	void OnLaunched(const FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);
	void OnLanded(const FHitResult& Hit);
	void OnJumped();
	void LaunchCharacter(const FVector& LaunchVelocity, bool bXYOverride, bool bZOverride);
	void K2_UpdateCustomMovement(float DeltaTime);
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void K2_OnMovementModeChanged(TEnumAsByte<EMovementMode> PrevMovementMode, TEnumAsByte<EMovementMode> NewMovementMode, unsigned char PrevCustomMode, unsigned char NewCustomMode);
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void Jump();
	bool IsPlayingRootMotion();
	bool IsPlayingNetworkedRootMotionMontage();
	bool IsJumpProvidingForce();
	UAnimMontage* GetCurrentMontage();
	void Crouch(bool bClientSimulation);
	void ClientCheatWalk();
	void ClientCheatGhost();
	void ClientCheatFly();
	bool CanJumpInternal();
	bool CanJump();
};


// Class Engine.AnimInstance
// 0x0418 (0x0440 - 0x0028)
class UAnimInstance : public UObject
{
public:
	USkeleton*                                         CurrentSkeleton;                                          // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<FAnimTickRecord>                            UngroupedActivePlayers;                                   // 0x0030(0x0010) (ZeroConstructor, Transient)
	TArray<FAnimGroupInstance>                         SyncGroups;                                               // 0x0040(0x0010) (ZeroConstructor, Transient)
	TArray<FActiveVertexAnim>                          VertexAnims;                                              // 0x0050(0x0010) (ZeroConstructor, Transient)
	TEnumAsByte<ERootMotionMode>                       RootMotionMode;                                           // 0x0060(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bWarnAboutBlueprintUsage;                                 // 0x0061(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0062(0x0006) MISSED OFFSET
	FScriptMulticastDelegate                           OnMontageBlendingOut;                                     // 0x0068(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnMontageStarted;                                         // 0x0078(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnMontageEnded;                                           // 0x0088(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnStateEntered;                                           // 0x0098(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnStateExited;                                            // 0x00A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnStateInitialised;                                       // 0x00B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	FScriptMulticastDelegate                           OnAnimUpdated;                                            // 0x00C8(0x0010) (ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData01[0x70];                                      // 0x00D8(0x0070) MISSED OFFSET
	bool                                               bQueueMontageEvents;                                      // 0x0148(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0xF7];                                      // 0x0149(0x00F7) MISSED OFFSET
	TArray<FAnimNotifyEvent>                           ActiveAnimNotifyState;                                    // 0x0240(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData03[0x100];                                     // 0x0250(0x0100) MISSED OFFSET
	int16_t                                            SlotNodeInitializationCounter;                            // 0x0350(0x0002) (ZeroConstructor, Transient, IsPlainOldData)
	int16_t                                            GraphTraversalCounter;                                    // 0x0352(0x0002) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x54];                                      // 0x0354(0x0054) MISSED OFFSET
	bool                                               bBoneCachesInvalidated;                                   // 0x03A8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x8F];                                      // 0x03A9(0x008F) MISSED OFFSET
	unsigned char                                      UnknownData06 : 1;                                        // 0x0438(0x0001)
	unsigned char                                      bBlueprintAnimUpdateEnabled : 1;                          // 0x0438(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData07[0x7];                                       // 0x0439(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.AnimInstance"));
		return ptr;
	}


	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic);
	APawn* TryGetPawnOwner();
	void StopSlotAnimation(float InBlendOutTime, const FName& SlotNodeName);
	void SetMorphTarget(const FName& MorphTargetName, float Value);
	UAnimMontage* PlaySlotAnimationAsDynamicMontage(UAnimSequenceBase* Asset, const FName& SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int LoopCount, float BlendOutTriggerTime);
	float PlaySlotAnimation(UAnimSequenceBase* Asset, const FName& SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int LoopCount);
	void Montage_Stop(float InBlendOutTime, UAnimMontage* Montage);
	void Montage_SetPlayRate(UAnimMontage* Montage, float NewPlayRate);
	void Montage_SetNextSection(const FName& SectionNameToChange, const FName& NextSection, UAnimMontage* Montage);
	void Montage_Resume(UAnimMontage* Montage);
	float Montage_Play(UAnimMontage* MontageToPlay, float InPlayRate);
	void Montage_Pause(UAnimMontage* Montage);
	void Montage_JumpToSectionsEnd(const FName& SectionName, UAnimMontage* Montage);
	void Montage_JumpToSection(const FName& SectionName, UAnimMontage* Montage);
	bool Montage_IsPlaying(UAnimMontage* Montage);
	bool Montage_IsActive(UAnimMontage* Montage);
	FName Montage_GetCurrentSection(UAnimMontage* Montage);
	void LockAIResources(bool bLockMovement, bool LockAILogic);
	bool IsPlayingSlotAnimation(UAnimSequenceBase* Asset, const FName& SlotNodeName);
	float GetSyncGroupPosition(const FName& Name);
	float GetStateWeight(int MachineIndex, int StateIndex);
	float GetRelevantAnimTimeRemainingFraction(int MachineIndex, int StateIndex);
	float GetRelevantAnimTimeRemaining(int MachineIndex, int StateIndex);
	float GetRelevantAnimTimeFraction(int MachineIndex, int StateIndex);
	float GetRelevantAnimTime(int MachineIndex, int StateIndex);
	float GetRelevantAnimLength(int MachineIndex, int StateIndex);
	USkeletalMeshComponent* GetOwningComponent();
	AActor* GetOwningActor();
	float GetMaxPlayingAnimTimeRemaining(int MachineIndex, int StateIndex);
	float GetMaxAnimTimeRemaining(int MachineIndex, int StateIndex);
	float GetInstanceTransitionTimeElapsedFraction(int MachineIndex, int TransitionIndex);
	float GetInstanceTransitionTimeElapsed(int MachineIndex, int TransitionIndex);
	float GetInstanceTransitionCrossfadeDuration(int MachineIndex, int TransitionIndex);
	float GetInstanceStateWeight(int MachineIndex, int StateIndex);
	float GetInstanceCurrentStateElapsedTime(int MachineIndex);
	float GetInstanceAssetPlayerTimeFromEndFraction(int AssetPlayerIndex);
	float GetInstanceAssetPlayerTimeFromEnd(int AssetPlayerIndex);
	float GetInstanceAssetPlayerTimeFraction(int AssetPlayerIndex);
	float GetInstanceAssetPlayerTime(int AssetPlayerIndex);
	float GetInstanceAssetPlayerLength(int AssetPlayerIndex);
	float GetCurveValue(const FName& CurveName);
	FName GetCurrentStateName(int MachineIndex);
	float GetCurrentStateElapsedTime(int MachineIndex);
	static float GetAnimAssetPlayerTimeFromEndFraction(UAnimationAsset* AnimAsset, float CurrentTime);
	float GetAnimAssetPlayerTimeFromEnd(UAnimationAsset* AnimAsset, float CurrentTime);
	static float GetAnimAssetPlayerTimeFraction(UAnimationAsset* AnimAsset, float CurrentTime);
	static float GetAnimAssetPlayerLength(UAnimationAsset* AnimAsset);
	void ClearMorphTargets();
	float CalculateDirection(const FVector& Velocity, const FRotator& BaseRotation);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintUninitializeAnimation();
	void BlueprintPostEvaluateAnimation();
	void BlueprintInitializeAnimation();
	void AnimNotify_Sound(UAnimNotify* Notify);
};


// Class Engine.AnimNotify
// 0x0010 (0x0038 - 0x0028)
class UAnimNotify : public UObject
{
public:
	bool                                               PlayedWithSequencer;                                      // 0x0028(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0029(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.AnimNotify"));
		return ptr;
	}


	bool Received_Notify(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation);
	FString GetNotifyName();
};


// Class Engine.AnimNotifyState
// 0x0000 (0x0028 - 0x0028)
class UAnimNotifyState : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Engine.AnimNotifyState"));
		return ptr;
	}


	bool Received_NotifyTick(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation, float FrameDeltaTime);
	bool Received_NotifyEnd(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation);
	bool Received_NotifyBegin(USkeletalMeshComponent* MeshComp, UAnimSequenceBase* Animation, float TotalDuration);
	FString GetNotifyName();
};


// Class Engine.AnimNotifyState_TimedParticleEffect
// 0x0030 (0x0058 - 0x0028)
class UAnimNotifyState_TimedParticleEffect : public UAnimNotifyState
{
public:
	UParticleSystem*                                   PSTemplate;                                               // 0x0028(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FName                                              SocketName;                                               // 0x0030(0x0008) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FVector                                            LocationOffset;                                           // 0x0038(0x000C) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FRotator                                           RotationOffset;                                           // 0x0044(0x000C) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bOwnerOnlySee;                                            // 0x0050(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bOwnerNoSee;                                              // 0x0051(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bDestroyAtEnd;                                            // 0x0052(0x0001) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
