#pragma once

// Sea of Thieves (1.4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_BP_Anim_PetParrot_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Anim_PetParrot.BP_Anim_PetParrot_C
// 0x7688 (0x7D98 - 0x0710)
class UBP_Anim_PetParrot_C : public UWieldablePetAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0710(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_21CD194741A6E61FC58A21810E5A6526;      // 0x0718(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF952B00499FE620CC7975B32FDA5512;// 0x0760(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B7FE73C74593131C3F60ADA71AC7B8A1;// 0x07A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A5E2116411D49FF98C527A2DB7E247A;// 0x07E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_464010C0433FC0EF1826E2B41EBB7D8F;// 0x0820(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_333A7D1F4100179BF59938B655F1AF2F;// 0x0860(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C3FB3D2943E676833683C4A85ED2E535;// 0x08A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BC35DC04D4C99E23EFAB9AC386323B9;// 0x08E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF20C50A45E2BB601AB285AA8CCEA8C6;// 0x0920(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C3C89C654FC9811C7B2AC8AF7809A459;// 0x0960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8163D8404FBAB7B56325828383E60895;// 0x09A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DBDFBFE44A2C82FD9A8EFBA9D5A8DD03;// 0x09E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DBC05B55412A10BCACFC43BE805833C8;// 0x0A20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0BBEF6404084AD03446CDCA45FD4054D2;// 0x0A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A6F765B7484AFAEB309765B1ECB6E90B;// 0x0AC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_049251C04E6ED15EADDA4FB3E0EDA8FD;// 0x0B18(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CC796EE4423E27C89BDB5294EDC6A464;// 0x0B60(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BAD736F54941881A971AC7B744D9B294;// 0x0BB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83E40CDC4A7BDB92258145AC8187E56A;// 0x0BF8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC07F7DF414090601BD4DDADBF099B5D;// 0x0C38(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C5D79C15449BD4C30E72F69063A7889D;// 0x0C90(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5FE5159547262445830498BE2823DF85;// 0x0D40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CCC1B1524984C535B85947A987165825;// 0x0D98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FB6CF837496A9EF949E619ADBE1459A9;// 0x0DE0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E371AF5244C7E4338DA73F8F656C3C1D;// 0x0E38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3BE3BAF46B855119A36FB954C140D30;// 0x0E80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C20674824F814966F9C36CAA4D717194;// 0x0EC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37300297453C554279B6BB9F936F8919;// 0x0F00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B3D1B114AFC89455C5643940A0F325A;// 0x0F40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4A99CE1C4D1426189AC75A80E137CA69;// 0x0F80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67C045DD4B603B0C7D4A0892951C4EEF;// 0x0FC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43FB5FB147F09F4F2DDE959F649459B5;// 0x1000(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB9E2A99416BDBD218CCB49C73657C4B;// 0x1040(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A0A96D164CBA8336BF7F819C11DE7D9A;// 0x1080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3268D219446C9C090FACA99172DF1052;// 0x10C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47AD6EBF4B3CAF32E333BB8D6B7C6144;// 0x1100(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03E7441B43E91C9F7C281697B95A0519;// 0x1140(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA8F7AFB467754754F8FB8A55BCC04A5;// 0x1180(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F900F953474E6FC918ED279543217AE1;// 0x11C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F19DC634FA4041E98679281C37F7ADB;// 0x1200(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D71E04B475698F50D719196C78831FF;// 0x1240(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5906B5F24797CCD664133EB6D0856275;// 0x1280(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F6F1E6D74D4685681F27B087E13F2ABD;// 0x12C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2EFC6A64EE0A41698E0549AE91B0CF0;// 0x1300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B52A91F42FB0C2B277335B2544942A6;// 0x1340(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EFA3CD8546C743943E7859AD14B003D0;// 0x1380(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDF1B79940AEB1767DB37498B65F2A03;// 0x13C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69ED07AD43CCB2075ABCFD935D6E88FB;// 0x1400(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C00C32E14C86F5A9AD16C4A98B81AAEC;// 0x1440(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B90B985C43B1CE3348EF789763F4A826;// 0x1480(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1E5B9B7454B34277D027CB6CA2FAECC;// 0x14C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7402B2EF43E4631E9B8AC3B0B76A67D3;// 0x1500(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CB864FF47FBC64A3F546F868B7CF0D8;// 0x1540(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_656B79C746E6BFFC8511A38995E43B52;// 0x1580(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1074407C41C8306FD8738BBAD57ABAE6;// 0x15C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_234197E741E40C39DF0A8D805D5FFD6D;// 0x1600(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AD198324641490435C0E7B73F3040F6;// 0x1640(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F9B745D473D661C42B7D6AED21E24EB;// 0x1680(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFC21B744F06A7394240E88600595F63;// 0x16C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FF6A7EC4B360D9CDC3DD2B7F706CDBA;// 0x1700(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D9AE8054DFC5FCA8BB6BAB8D288947B;// 0x1740(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_852115314D85B9DF23FCB782873C93DC;// 0x1780(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_411A9C494CBB052BAB24CF9A209CD9EB;// 0x17C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB64C5A84F4908AEDD934F8F07F6BD1C;// 0x1800(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF89DD624F6F64A383A7359CE4794452;// 0x1840(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0A68C6B413A28FA48343FB2378100C5;// 0x1880(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EB26B3C49C72ED8316616B8BB7518DC;// 0x18C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_760435BE489DA31DF6E7009D71777A5D;// 0x1900(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_870541BF43753BB5923C75ACDD3B721B;// 0x1940(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD8D1EDE475EEEC04FF3589ACDF43E03;// 0x1980(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11FFA9D74E087633EF6652BB74166EDB;// 0x19C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D6F4D7F45F4B257782197B03E7CFF6B;// 0x1A00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5EC0F9E0439503EAB24D6883FBF35AED;// 0x1A40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D6D071404DFED5502A416C9C0AC3B164;// 0x1A80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9404C3D34FC1B82DE40BE88C212C5FA7;// 0x1AC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3903B4AB4FBB3E70813221BA5CC092C3;// 0x1B00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40CD0D734F446ABB49B334A9B596B762;// 0x1B40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E29E4A3A459BCA20AA1EA188D0C2966E;// 0x1B80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_017BA7E941C372CB64DE98A495789204;// 0x1BC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2DF3E3904E4F6301BAE3AFAF6F43D35C;// 0x1C00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33C81F3242BCBB8CDE426CA2CA7F9E8E;// 0x1C40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E5670E341DAD9079A60EBAD1F4FCC52;// 0x1C80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A83A6214C4DB283E956A18023C77B29;// 0x1CC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43E3AC6249652231BCB6029263CCB05F;// 0x1D00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E3E49CA44EFF8D6C037CEBB16FC47E0;// 0x1D40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76D1FE774D60BB802EBA78831BB7F717;// 0x1D80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94F406CE48A82A4A68A38196E3A4EA79;// 0x1DC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7ED235FB41CF8AA203E5648C9E0F8B2D;// 0x1E00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D9C97C5423448146A4C9491D86A1FB8;// 0x1E40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC385D03491BAE4F2D29B7AD95D0C9D1;// 0x1E80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA2074434FE1669A12A53091474B9167;// 0x1EC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BFD224F4A9C874920DE0D828D21059C;// 0x1F00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E57F82FF46C670E2CE849F873DDBBC8C;// 0x1F40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30642E9F45ED0F2AB6C5A8809A8D3771;// 0x1F80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CA8B860B4699E4CE514176BA43793133;// 0x1FC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55A06A9B47C081FB326C1EB0A36AFBB4;// 0x2000(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D41CDB2C431F6D803858D4869C5A9C4D;// 0x2040(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E2A21C19464B8549773DD78E42BC98D9;// 0x2080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2BE3BFF145F5C469DF3D299B5EB3A7C0;// 0x20C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E04A13E4F11E4CA298EC28EAC73C8EE;// 0x2100(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FF6A045473644F16856A483ADECD105;// 0x2140(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9DF1BFE41F003E218D373BD07E7B5F1;// 0x2180(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BAA8482A470821D76334BAA4343770AF;// 0x21C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_267F7FBE464DCD7755E9DE85A195A9A6;// 0x2200(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32E9FB4B4B8F43FC436AC0AF17486F67;// 0x2240(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1347EB3F4C9F21D2A098C8A42C006E69;// 0x2280(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33F9155148E61651C4F8D791D8D1A7BC;// 0x22C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B88B51B84A6192CBBC32FC921735B444;// 0x2300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52488D95455B906211C06698535313752;// 0x2340(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA7694F748D6D910B4E4A8879CAC39D8;// 0x2380(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4B5E84834204A988C63ADC9BF4D0E919;// 0x23C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39A3C7DD442B25A0D33F3B8B19BC4E1D;// 0x2400(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4480C5694707AD406B6E2E9B9C072935;// 0x2440(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A9627C0404B252483BA9EA1ABD94AD9;// 0x2480(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D5203194C1B28E1EFD08B8B58591454;// 0x24C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9500FF524EF034F028DFA3BEB4C3133A;// 0x2500(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2CD993EC4D5B2639C1F2138BC8BB0BB5;// 0x2540(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77187375470665C819E4BD93D6D6ABDE;// 0x2580(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A99;// 0x25C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918119;// 0x2600(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61679;// 0x2640(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF9;// 0x2698(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD49;// 0x26E0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B772010;// 0x2738(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_04A878074F870E22335284B7F1043CBD;// 0x2780(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_46C05FFB4E119B14FAA4BFA8E4A5A78F;// 0x2828(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A98;// 0x2870(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918118;// 0x28B0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61678;// 0x28F0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF8;// 0x2948(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD48;// 0x2990(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77209;// 0x29E8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_898197A443A369EFDBC2C5844D3A207B;// 0x2A30(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A98DEF94678D4D3A5857EA9F5862F8D;// 0x2AD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A97;// 0x2B20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918117;// 0x2B60(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61677;// 0x2BA0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF7;// 0x2BF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD47;// 0x2C40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77208;// 0x2C98(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E7D249854A5B94A09891FFBD1B8C43DB;// 0x2CE0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_43C1B9C64DE807331E576A8C68E47F87;// 0x2D88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A96;// 0x2DD0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918116;// 0x2E10(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61676;// 0x2E50(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF6;// 0x2EA8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD46;// 0x2EF0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77207;// 0x2F48(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C205745346456D5E0CA84BABE21BB22A;// 0x2F90(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_30CF251B4F0F2F63ED1A168C0565C265;// 0x3038(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A95;// 0x3080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918115;// 0x30C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61675;// 0x3100(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF5;// 0x3158(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD45;// 0x31A0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77206;// 0x31F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5C89547F416CA151FF20B6B3D6704A58;// 0x3240(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_205627384445294FAE2053B347D8B835;// 0x32E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A94;// 0x3330(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918114;// 0x3370(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61674;// 0x33B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF4;// 0x3408(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD44;// 0x3450(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77205;// 0x34A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DFA7DB224BA80B38192CFDBE23F71CA7;// 0x34F0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9768C55E45FC2D65D23E33B7DA15420D;// 0x3598(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A93;// 0x35E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918113;// 0x3620(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61673;// 0x3660(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF3;// 0x36B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD43;// 0x3700(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77204;// 0x3758(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6CA24E964D04FC2F64F14D80530E88E8;// 0x37A0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FBE72B13457663F587B3A18B78036FA3;// 0x3848(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A92;// 0x3890(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918112;// 0x38D0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B61672;// 0x3910(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF2;// 0x3968(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD42;// 0x39B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77203;// 0x3A08(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E2982B3544A55D5A1561F89324576BB6;// 0x3A50(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B66F356A4D207FA1626A9BB42F891F7B;// 0x3AF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB662FF643D2D99280E2EFB235FCBA4D;// 0x3B40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C2235D3B4BD15F4E1E6B909A896A125D;// 0x3B98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F1213FCE4D0AE742575E35AFBE1E89A3;// 0x3BE0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F27C7DF641FCA69FDF86FCB693CFF176;// 0x3C38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A40E847143C323394AFA9D8277552C79;// 0x3C80(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C87B498F4C61BF75D83F3699A76718D7;// 0x3CD8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38F5BF154021EE006671EF9AAA51DE2C;// 0x3D20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1063707E45A04D8DDADD529DE38537C7;// 0x3D78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE85;// 0x3DC0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_71D72A5A4A5DCBA523E96D8BB42FEB345;// 0x3E00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA5;// 0x3E58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A7CEA264A2CA4B247B87C9E7EADCD823;// 0x3EA0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB95;// 0x3EF8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8865EF464FB4AB6EB2B9B9BCC7E5C927;// 0x3F40(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_88C980334B07F47D2E63F5ACFAC346A7;// 0x3FE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D7D1B1BD4BA8087DFF4C6A80587A8349;// 0x4030(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FC38BBD421392B8E97E279990643EB8;// 0x4070(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4F8F4E14EF57978F0200B9306596A05;// 0x40B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6202058F4D92C18D988836BDC6C48D74;// 0x40F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6BD33A5043B4E92AEF7CD786C10D559B;// 0x4130(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E24367D44D0D30C95274C984550A2CFC;// 0x4170(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_73E4A03B4F3A571D7C56F2A5297FD383;// 0x41C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A1C4D0F417CAC6A9EA317A5922F5FDC;// 0x4210(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F439996F4E7B011E100FEB91B7011FE3;// 0x4268(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A0C8D6B54DD60A3333244F97750E053B;// 0x42B0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_03FC3315481EF2C058642B8B5F3A22E8;// 0x42F0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FC2E4C404122C74EEFA6B29B97536C6E;// 0x4348(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F2F6889B4A31EABBBB1A1F8EF71451FF;// 0x4390(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8A0819EE43B0769917C587BD5B7C41A5;// 0x43E8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_20130DEA44AF7AEC6AD5FF8A8B3F4020;// 0x4430(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_31640C104D8A69CA61F6BA9435395DBA;// 0x44D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0673505B4EE36D9F1FC8A6816857DE2B;// 0x4520(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BC09897F4339E2DF545696BF27F38B70;// 0x4578(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_032B84F240609305955727BFEE0C4545;// 0x45C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AFE852114458D167BC193C8CC34E0551;// 0x4618(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_83D945A346C5B7C4C4B339A7B0B3AD2E;// 0x4660(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_211224A44863F8E75CCE4C8AB1A4ABEC;// 0x46B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D3B68DCE45B03F96E121A1B93CD5261A;// 0x4700(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FDD75BB54A90E20248718E8D648BCC5A;// 0x4758(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_89FBF99A4E86C84A420B2B8CF25AD60B;// 0x47A0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B72D6E52448B2FE9D1D89CBBA3D5864A;// 0x47F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82DE1D1E429B3EC3803BB9B77E62073B2;// 0x4840(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4DFEA8994BE8183C2AAA929FAF57CB242;// 0x4898(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_45B3618441D8FD82DABFA5ABB88F6D77;// 0x48E0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0BBEF6404084AD03446CDCA45FD4054D;// 0x4938(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B19CCF304A932CC3F3CA37989AA413AD;// 0x4980(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F8F3346490458B5A7183BBDB39E6B93;// 0x49D8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_040125664F055143CA83418D57C62CEE2;// 0x4A20(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9437995F495BE9BC1B82C987324C1D052;// 0x4B28(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C9A2ACE345E61BDC655B7FB49CA5E7DC2;// 0x4B70(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3345D7C54E122D212C2F698F9C4C25C92;// 0x4C18(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_05FB639A4C979BB9D42E8498BD33A06C;// 0x4C60(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_243E415443B11B516E8F8880DE967696;// 0x4CB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2D7874854273F40A740DB1B388B4F036;// 0x4D00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B2F471B2438350E521D031893FA3A01C;// 0x4D58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82DE1D1E429B3EC3803BB9B77E62073B;// 0x4DA0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4DFEA8994BE8183C2AAA929FAF57CB24;// 0x4DF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5360DDD74AF16358B592D6907865F970;// 0x4E40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FBEAE04D4AB8C11998F58D9FFB4A06CE;// 0x4E98(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_040125664F055143CA83418D57C62CEE;// 0x4EE0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9437995F495BE9BC1B82C987324C1D05;// 0x4FE8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C9A2ACE345E61BDC655B7FB49CA5E7DC;// 0x5030(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3345D7C54E122D212C2F698F9C4C25C9;// 0x50D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C89D1F6147DA937965D98C9895B56F61;// 0x5120(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9535D1C7452D76EDBF85128884B9E0E8;// 0x5178(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB43503C4B3F4D0767CADD8009CC692E;// 0x51C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9C0EBBA141DDBAC1381F38AD2990BA45;// 0x5218(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F68B8C1C4348D1BAEC5BBCA8AF0726E6;// 0x5260(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2FC462264102F822E4581A92056B0B9B;// 0x52B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE84;// 0x5300(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_71D72A5A4A5DCBA523E96D8BB42FEB344;// 0x5340(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA4;// 0x5398(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A7CEA264A2CA4B247B87C9E7EADCD822;// 0x53E0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB94;// 0x5438(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6917FEDC46C265E1908772A23D3749D6;// 0x5480(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4493CA434FF5EA59FF0DDFB19EA444C4;// 0x5528(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE83;// 0x5570(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_71D72A5A4A5DCBA523E96D8BB42FEB343;// 0x55B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA3;// 0x5608(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A7CEA264A2CA4B247B87C9E7EADCD82;// 0x5650(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB93;// 0x56A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D1C657054827D8DBDD52EDA418A92F0D;// 0x56F0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4F9FB95E4181F181BEEF2E83C3195006;// 0x5798(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CF61EE9F4494276CC6DE00838A52A8B6;// 0x57E0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7BE661FE4F43C40047CA01AFCDFB3E66;// 0x5838(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_491ECCC349B2C3347FC203A052F35761;// 0x5880(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_477587D144B5EDCAA90394BC22673129;// 0x58D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CDBD9F2E45ADBCC7E124DD8FB9D43071;// 0x5920(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4EB9434843D78F7B1A81DC96BE4B0178;// 0x5978(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7147322D4870AB508A6D189B32ABB9FD;// 0x59C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7AAD7DED49425D76D880C8A5C948B20C;// 0x5A18(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_452EA15C44B99B93641F0D9E8679AA0B;// 0x5A60(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_620CD22641DED8C3FC87F2818CF1DAA3;// 0x5AB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CD9F586D41D7B6F16394A4B46B1BF128;// 0x5B00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A59FF89846A73229A8C818B875F9769C;// 0x5B58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8D190D948345B0903D3079CF2A2C496;// 0x5BA0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_440B378C432A0164B3B1C2B70F9B8C8F;// 0x5BF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ED437FB4433FFF5FA40D3E8CAD4CB39A;// 0x5C40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_329A56F248A29B9FC3E2BD91AC1A6180;// 0x5C98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EDBBFF7C4D3E8863422FDB8D1F3860A4;// 0x5CE0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6A3F5B4D4970EFE3A79D96933528EB2B;// 0x5D38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_786062CF4B2965D0058B9BBB6E5FA5D02;// 0x5D80(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_07C9E32B410A3928CCEB0FA1E37F9CDB2;// 0x5DD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE82;// 0x5E20(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_71D72A5A4A5DCBA523E96D8BB42FEB342;// 0x5E60(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA2;// 0x5EB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20CD9F5D4D9CFD273FF16184453956A32;// 0x5F00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB92;// 0x5F58(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_57964E5640053928C566609C0C476E852;// 0x5FA0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C6A7DB4F487C5016D69887A7D72D80F02;// 0x6048(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9689B5A4C3BB49BB73E7F933B0C2B1F;// 0x6090(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A9;// 0x60D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E62091811;// 0x6110(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82789DF6458F01D5F556D390F90B6167;// 0x6150(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF;// 0x61A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A52C1B843AA6FC07B001CB2296F0AD4;// 0x61F0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77202;// 0x6248(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BC15BAED48E24F4CC719068E38D0E302;// 0x6290(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0C872364429A7C29536A3C9E06439031;// 0x6338(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B976B710493EF408B68794B70C07F9C4;// 0x6380(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_076BABF54A21D844310FBEA603AF0743;// 0x6428(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC97545C448E1D4350F93A80D0D9F276;// 0x6470(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FDF859E4DF20300A8BC028A89D9A702;// 0x64B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_253FEA80468B79AC0F61D0B0EFDFF7AC;// 0x64F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D2CF643428498890674C0802E023D4C;// 0x6530(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_99FC788D438155EAFD7B1E91329B4B19;// 0x6570(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10FC25604347C74B7B5000821FE389C3;// 0x65B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C98B1994C05E4252F2FE4A4E535AEA3;// 0x65F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_566CEE0F40297EA1F3C608A70BC25ED7;// 0x6630(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4F2F25BA4B237657236CDE9100C291AC;// 0x6670(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_838978C14E639E314854248E855C2286;// 0x66C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EEC2DC9647C111F8129BA4817B440BC8;// 0x6710(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7035E93A4211B3044622C18F1EBBD7A1;// 0x6768(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_500D2BCB4FCF00C14A6CBBB906016DC2;// 0x67B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_03FA4AA44D85E207016FE896B6CABAEE;// 0x6808(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_81B6BD3943D9A96BD9ED5E8ED3982D58;// 0x6850(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EA33407A4592EAC76556A5A51392E06E;// 0x68A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4353D6C24348B435736EA09DFE28ABC8;// 0x68F0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BA9F7140425B60C3B85C409581D83175;// 0x6930(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A304CA442D7020DD2D0B4BDD79E924D;// 0x69D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_237511784B144993FCB1379E1EB39EE02;// 0x6A18(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFF40B914B8A799EA675BFB84FBE5137;// 0x6A58(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44376B314A106BABF5EEBF8135BFEC7B2;// 0x6A98(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B94D46343C61DC2E6BD84B8951A3C9E;// 0x6AD8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_47F17E3E486C8ED797A24AA4E6192EC8;// 0x6B18(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C3F81EB14D8770E016695D9287B605F6;// 0x6C20(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D177FF4840AE633809077D9B695DA0032;// 0x6C68(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B7E16ADE403A6333FF78B8B9FB2A559D2;// 0x6CC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_978E65D8495D427923D848A301B93EAA2;// 0x6D08(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5FF04AD44D3FBF54566AD1B8C61BD21F2;// 0x6D60(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9685FA7B46FF7C1922296B90AC7F49CE;// 0x6DA8(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3D4602A142004CAD75AC138D2EBC283B;// 0x6E50(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F297FAA147B82EDAA2B3AD97A8EFF67C;// 0x6EC0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C966EDC440B33018C6C8BE819C1377B4;// 0x6F70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90A1031D41CD1E055B5CB6A2C506D545;// 0x6FB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB5A066D4402E61D723CA2856742B5DD;// 0x6FF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D77246C48209E160156DF97BC612EDB;// 0x7030(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D2DD3AB4A40CC2DA18F2CAEF0CA47DE;// 0x7070(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52488D95455B906211C0669853531375;// 0x70B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51864FDF473394B24ECDCB83FBB887E4;// 0x70F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CD83675433917B40D4D62BDB4D13221;// 0x7130(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71180B5848E0B5D260418595D40B4448;// 0x7170(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4DA0DB2C4D170240A5D522AA7784325C;// 0x71B0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_786062CF4B2965D0058B9BBB6E5FA5D0;// 0x71F0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_07C9E32B410A3928CCEB0FA1E37F9CDB;// 0x7248(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE8;// 0x7290(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_71D72A5A4A5DCBA523E96D8BB42FEB34;// 0x72D0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA;// 0x7328(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20CD9F5D4D9CFD273FF16184453956A3;// 0x7370(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB9;// 0x73C8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_57964E5640053928C566609C0C476E85;// 0x7410(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C6A7DB4F487C5016D69887A7D72D80F0;// 0x74B8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CF74AAA2458F68ECF87EAEB7667A1BD2;// 0x7500(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AB83E9944E3A2843BF04DDBC14A161A7;// 0x7608(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41C2C8EE41B604695AE654BA23C29F30;// 0x7650(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1433896B422DD02F722E888BCA82B256;// 0x76A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_237511784B144993FCB1379E1EB39EE0;// 0x76F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44376B314A106BABF5EEBF8135BFEC7B;// 0x7730(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D177FF4840AE633809077D9B695DA003;// 0x7770(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B7E16ADE403A6333FF78B8B9FB2A559D;// 0x77C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_978E65D8495D427923D848A301B93EAA;// 0x7810(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5FF04AD44D3FBF54566AD1B8C61BD21F;// 0x7868(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9686E1AB453C8231555FA691ECE91566;// 0x78B0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B7720;// 0x7958(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1DEF106A4629BE203143D2AB248EBAE2;// 0x79A0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99879163458DB39050F11B8F371FC8B5;// 0x7A48(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D3C843E5464DFEE227EA7EACF913C662;// 0x7A90(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AF927BE141F1A4D6155538990D89CC68;// 0x7AD8(0x00A8)
	struct FPetAnimationDataBeingHeld                  PetHeldAnimations;                                        // 0x7B80(0x0098) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPetAnimationDataRoaming                    PetRoamingAnimations;                                     // 0x7C18(0x0180) (Edit, BlueprintVisible, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("AnimBlueprintGeneratedClass BP_Anim_PetParrot.BP_Anim_PetParrot_C"));
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetParrot_AnimGraphNode_TransitionResult_AF952B00499FE620CC7975B32FDA5512();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetParrot_AnimGraphNode_TransitionResult_B7FE73C74593131C3F60ADA71AC7B8A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetParrot_AnimGraphNode_TransitionResult_464010C0433FC0EF1826E2B41EBB7D8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetParrot_AnimGraphNode_TransitionResult_333A7D1F4100179BF59938B655F1AF2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetParrot_AnimGraphNode_TransitionResult_C3FB3D2943E676833683C4A85ED2E535();
