#pragma once

// Sea of Thieves (2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Basic.hpp"
#include "SoT_Athena_enums.hpp"
#include "SoT_ObjectMessaging_classes.hpp"
#include "SoT_AthenaAI_classes.hpp"
#include "SoT_CoreUObject_classes.hpp"
#include "SoT_Pets_classes.hpp"
#include "SoT_AthenaInput_classes.hpp"
#include "SoT_Maths_classes.hpp"
#include "SoT_Engine_classes.hpp"
#include "SoT_AthenaRigging_classes.hpp"
#include "SoT_AthenaSocketLookup_classes.hpp"
#include "SoT_Fire_classes.hpp"
#include "SoT_RareAudio_classes.hpp"
#include "SoT_Tales_classes.hpp"
#include "SoT_CoherentUIGTPlugin_classes.hpp"
#include "SoT_Watercrafts_classes.hpp"
#include "SoT_Animation_classes.hpp"
#include "SoT_StatusEffects_classes.hpp"
#include "SoT_ActionStateMachine_classes.hpp"
#include "SoT_InputCore_classes.hpp"
#include "SoT_Interaction_classes.hpp"
#include "SoT_DebugMenu_classes.hpp"
#include "SoT_RareEngine_classes.hpp"
#include "SoT_Kraken_classes.hpp"
#include "SoT_AIShips_classes.hpp"
#include "SoT_StudiosAutomation_classes.hpp"
#include "SoT_GameService_classes.hpp"
#include "SoT_GameplayDebugger_classes.hpp"
#include "SoT_Wind_classes.hpp"
#include "SoT_ShipDamage_classes.hpp"
#include "SoT_AIModule_classes.hpp"
#include "SoT_PirateGenerator_classes.hpp"
#include "SoT_Time_classes.hpp"
#include "SoT_Sessions_classes.hpp"
#include "SoT_Water_classes.hpp"
#include "SoT_PositionalVoice_classes.hpp"
#include "SoT_Repair_classes.hpp"
#include "SoT_EmotingFramework_classes.hpp"
#include "SoT_Retraction_classes.hpp"
#include "SoT_AthenaEngine_classes.hpp"
#include "SoT_WwiseAudio_classes.hpp"
#include "SoT_Tethering_classes.hpp"
#include "SoT_AthenaServerMigration_classes.hpp"
#include "SoT_JsonUtilities_classes.hpp"
#include "SoT_Cooking_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Athena.ControlObjectActionRuleParams
// 0x0010
struct FControlObjectActionRuleParams
{
	TArray<TEnumAsByte<EWieldableItemSize>>            WieldableItemSizesToDisableControl;                       // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.MastCollisionProfiles
// 0x0028
struct FMastCollisionProfiles
{
	struct FName                                       CollisionDisabledProfile;                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       PlayerAndItemsCollisionProfile;                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       PlayerOnlyCollisionProfile;                               // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       ItemsOnlyCollisionProfile;                                // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       ProjectilesOnlyCollisionProfile;                          // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.MastPhysicsComponents
// 0x0038
struct FMastPhysicsComponents
{
	class UPrimitiveComponent*                         MastBaseComponent;                                        // 0x0000(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UPrimitiveComponent*                         MastTopComponent;                                         // 0x0008(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UPrimitiveComponent*                         MastWeldedPhysicsBodyComponent;                           // 0x0010(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UPrimitiveComponent*                         WeldedCrowsNestComponent;                                 // 0x0018(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UPrimitiveComponent*                         UnweldedCrowsNestComponent;                               // 0x0020(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class UPrimitiveComponent*>                 UnweldedCrossBeamComponents;                              // 0x0028(0x0010) (BlueprintVisible, ExportObject, ZeroConstructor)
};

// ScriptStruct Athena.MastDamageAudioParams
// 0x00B0
struct FMastDamageAudioParams
{
	struct FWwiseEmitter                               MastHingeAudioEmitter;                                    // 0x0000(0x0020)
	class UWwiseObjectPoolWrapper*                     MastHingeAudioPool;                                       // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FWwiseEmitter                               MastImpactAudioEmitter;                                   // 0x0028(0x0020)
	class UWwiseObjectPoolWrapper*                     MastImpactAudioPool;                                      // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MastDamaged;                                              // 0x0050(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MastFallingStart;                                         // 0x0058(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MastFallingStop;                                          // 0x0060(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MasthHoistingStart;                                       // 0x0068(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MastHoistingStop;                                         // 0x0070(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MastHoistingComplete;                                     // 0x0078(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MastFallComplete;                                         // 0x0080(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 MastFallenStop;                                           // 0x0088(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       MastDamageLevelAudioSwitch;                               // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       MastHoistingSpeedAudioSwitch;                             // 0x0098(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       MastAngleRTPC;                                            // 0x00A0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       MastFallingSpeedRTPC;                                     // 0x00A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.IntentPredictorParams
// 0x0014
struct FIntentPredictorParams
{
	float                                              MaxError;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinError;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinCorrectionVelocity;                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinValue;                                                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxValue;                                                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.IntentPredictor
// 0x0018
struct FIntentPredictor
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	struct FIntentPredictorParams                      Params;                                                   // 0x0004(0x0014) (Edit)
};

// ScriptStruct Athena.ImpactDamageEvent
// 0x0058
struct FImpactDamageEvent
{
	struct FGuid                                       AttackId;                                                 // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamagerType;                                              // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      Instigator;                                               // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ProjectileActor;                                          // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0028(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     SurfaceNormal;                                            // 0x0034(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0040(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DamageAmount;                                             // 0x004C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DamageSpread;                                             // 0x0050(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHealthChangedReason>                  Reason;                                                   // 0x0054(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.PlayerStat
// 0x0010
struct FPlayerStat
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.AchievementCriteria
// 0x0020
struct FAchievementCriteria
{
	struct FPlayerStat                                 PlayerStat;                                               // 0x0000(0x0010) (Edit)
	uint64_t                                           Threshold;                                                // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EPlayerStatsOperator>                  Operator;                                                 // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.AchievementDefinition
// 0x0020
struct FAchievementDefinition
{
	struct FName                                       DevCenterId;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       FriendlyName;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FAchievementCriteria>                UnlockCriteria;                                           // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.LookAtOffset
// 0x0088
struct FLookAtOffset
{
	float                                              LookAtPitchRate;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LookAtYawRate;                                            // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LookAtYawRawScale;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LookAtPitchRawScale;                                      // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x78];                                      // 0x0010(0x0078) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationLocomotion
// 0x0040
struct FAthenaAnimationLocomotion
{
	struct FVector                                     CharacterVelocity;                                        // 0x0000(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WantedMovementSpeed;                                      // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CharacterMoving;                                          // 0x0010(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RunStopWanted;                                            // 0x0011(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	float                                              TurnRate;                                                 // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentYaw;                                               // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentDirection;                                         // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               TurningActive;                                            // 0x0020(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               TurningLeft;                                              // 0x0021(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsSwimming;                                               // 0x0022(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnderwaterSwimming;                                     // 0x0023(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MinimumMoveSpeedToTriggerRunStop;                         // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InterpSpeed;                                              // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurnRateToDisableTurns;                                   // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0030(0x0010) MISSED OFFSET
};

// ScriptStruct Athena.WieldAnimationParams
// 0x0040
struct FWieldAnimationParams
{
	TEnumAsByte<EWieldAnimationLocation>               WieldLocation;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0001(0x000F) MISSED OFFSET
	struct FTransform                                  PropOffset;                                               // 0x0010(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectLocomotionAnimations
// 0x0038
struct FAthenaAnimationObjectLocomotionAnimations
{
	class UBlendSpace*                                 Locomotion1;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion2;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion3;                                              // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion4;                                              // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningLeft;                                    // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningRight;                                   // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LocomotionSwimming;                                       // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimations
// 0x0020
struct FAthenaAnimationObjectJumpingAnimations
{
	class UBlendSpace*                                 Start;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Cycle;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 PreImpact;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LandLight;                                                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectEquipAnimations
// 0x0028
struct FAthenaAnimationObjectEquipAnimations
{
	class UAnimSequence*                               Equip;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 EquipSwimming;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               UnEquip;                                                  // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Pickup;                                                   // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Drop;                                                     // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectIdleAnimations
// 0x0018
struct FAthenaAnimationObjectIdleAnimations
{
	class UAnimSequence*                               Idle1;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Idle2;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Idle3;                                                    // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShot
// 0x0030
struct FAthenaAnimationObjectActionOneShot
{
	TArray<class UAnimSequence*>                       MainAction;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               MainFail;                                                 // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       AlternateAction;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               AlternateFail;                                            // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousSwimming
// 0x0020
struct FAthenaAnimationObjectActionContinuousSwimming
{
	class UBlendSpace*                                 MainInSwimming;                                           // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainOneShotInSwimming;                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainCycleSwimming;                                        // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainOutSwimming;                                          // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLocomotionTurningAnimData
// 0x0008
struct FAthenaAnimationLocomotionTurningAnimData
{
	class UAnimSequence*                               Turn90;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStruct
// 0x0090
struct FAthenaAnimationObjectActionContinuousStruct
{
	class UAnimSequence*                               MainInto;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               OneShotInto;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               MainCycleIdle;                                            // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainCycleLocomotion;                                      // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               UseMainCycleJump;                                         // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectJumpingAnimations     MainCycleJump;                                            // 0x0028(0x0020) (Edit, BlueprintVisible)
	class UAnimSequence*                               MainOutOf;                                                // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               MainFail;                                                 // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x0058(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningLeftAlt;                                           // 0x0078(0x0008) (Edit, BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningRightAlt;                                          // 0x0080(0x0008) (Edit, BlueprintVisible)
	class UAnimSequence*                               TurnOutAlt;                                               // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuous
// 0x0120
struct FAthenaAnimationObjectActionContinuous
{
	struct FAthenaAnimationObjectActionContinuousStruct MainContinuousActions;                                    // 0x0000(0x0090) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousStruct AlternateContinuousActions;                               // 0x0090(0x0090) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShotPitchOverride
// 0x0030
struct FAthenaAnimationObjectActionOneShotPitchOverride
{
	TArray<class UBlendSpace1D*>                       MainAction;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UBlendSpace1D*                               MainFail;                                                 // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace1D*>                       AlternateAction;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UBlendSpace1D*                               AlternateFail;                                            // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimationsPitchOverride
// 0x0020
struct FAthenaAnimationObjectJumpingAnimationsPitchOverride
{
	class UBlendSpace1D*                               Start;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               Cycle;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               PreImpact;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               LandLight;                                                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStructPitchOverride
// 0x0080
struct FAthenaAnimationObjectActionContinuousStructPitchOverride
{
	class UBlendSpace1D*                               MainInto;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainCycleIdle;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainCycleLocomotion;                                      // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace1D*>                       VariantCycleIdle;                                         // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               UseMainCycleJump;                                         // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride MainCycleJump;                                            // 0x0030(0x0020) (Edit, BlueprintVisible)
	class UBlendSpace1D*                               MainOutOf;                                                // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainFail;                                                 // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x0060(0x0020) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousPitchOverride
// 0x0100
struct FAthenaAnimationObjectActionContinuousPitchOverride
{
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride MainContinuousActions;                                    // 0x0000(0x0080) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride AlternateContinuousActions;                               // 0x0080(0x0080) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectComplexOneShot
// 0x0028
struct FAthenaAnimationObjectComplexOneShot
{
	class UAnimSequence*                               WarmUp;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               WarmUpFromBlock;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Action;                                                   // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Recover;                                                  // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               HeavyAttackStunRecover;                                   // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectMeleeV2
// 0x0128
struct FAthenaAnimationObjectMeleeV2
{
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacks;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacksStatic;                                       // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> SwimmingComboAttacks;                                     // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FAthenaAnimationObjectComplexOneShot        HeavyAttack;                                              // 0x0030(0x0028) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectComplexOneShot        SwimmingHeavyAttack;                                      // 0x0058(0x0028) (Edit, BlueprintVisible)
	class UAnimSequence*                               BlockingMainInto;                                         // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               BlockingIntoFromCombat;                                   // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpace;                                   // 0x0090(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequences;                                // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               BlockingOut;                                              // 0x00A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               BlockingMainIntoSwimming;                                 // 0x00B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpaceSwimming;                           // 0x00B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequencesSwimming;                        // 0x00C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               BlockingOutSwimming;                                      // 0x00D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectJumpingAnimations     BlockingJump;                                             // 0x00D8(0x0020) (Edit, BlueprintVisible)
	class UBlendSpace*                                 CombatLocomotion;                                         // 0x00F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningLeft;                              // 0x0100(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningRight;                             // 0x0108(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurnOut;                                  // 0x0110(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Dodge;                                                    // 0x0118(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LungeWarmupLocomotion;                                    // 0x0120(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectFacial
// 0x0070
struct FAthenaAnimationObjectFacial
{
	TArray<class UAnimMontage*>                        PrimaryContinuous;                                        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryContinuous;                                      // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        PrimaryOneShot;                                           // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryOneShot;                                         // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeBlocking;                                            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeAttack;                                              // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeBlockReact;                                          // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotion
// 0x0010
struct FAthenaAnimationSkeletonKnockbackLocomotion
{
	class UAnimSequence*                               Forwards;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Backwards;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotionStrength
// 0x0020
struct FAthenaAnimationSkeletonKnockbackLocomotionStrength
{
	struct FAthenaAnimationSkeletonKnockbackLocomotion LowStrength;                                              // 0x0000(0x0010) (Edit, BlueprintVisible)
	struct FAthenaAnimationSkeletonKnockbackLocomotion HighStrength;                                             // 0x0010(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationFishingAnimations
// 0x0090
struct FAthenaAnimationFishingAnimations
{
	class UAnimSequence*                               CastIntoHoldBack;                                         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 CastHoldBackLoop;                                         // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CastForwards;                                             // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CastHoldLoop;                                             // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CastToFishing;                                            // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CastFail;                                                 // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Fishing;                                                  // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               FishingAdditive;                                          // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               IntoFighting;                                             // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 FightingCentral;                                          // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               FightingAdditive;                                         // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               Linesnap;                                                 // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SuccessReelIn;                                            // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               ComedyItemSuccessReelIn;                                  // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               ShakingAdditive;                                          // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LineSnapShakingAdditive;                                  // 0x0078(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               FishingToIdle;                                            // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               FishingToUnequip;                                         // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationCoreObjectAnimations
// 0x0920
struct FAthenaAnimationCoreObjectAnimations
{
	struct FAthenaAnimationObjectLocomotionAnimations  Locomotion;                                               // 0x0000(0x0038) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectLocomotionAnimations  AlternateLocomotion;                                      // 0x0038(0x0038) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     Jumping;                                                  // 0x0070(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     AlternateJumping;                                         // 0x0090(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectEquipAnimations       Equipping;                                                // 0x00B0(0x0028) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        Idles;                                                    // 0x00D8(0x0018) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        AlternateIdles;                                           // 0x00F0(0x0018) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionPrimarySingle;                                      // 0x0108(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionPrimaryContinuous;                                  // 0x0138(0x0120) (Edit, BlueprintVisible)
	bool                                               PrimaryActionPitchOverride;                               // 0x0258(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0259(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionPrimarySinglePitchOverride;                         // 0x0260(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionPrimaryContinuousPitchOverride;                     // 0x0290(0x0100) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionSecondarySingle;                                    // 0x0390(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionSecondaryContinuous;                                // 0x03C0(0x0120) (Edit, BlueprintVisible)
	bool                                               SecondaryActionPitchOverride;                             // 0x04E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x04E1(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionSecondarySinglePitchOverride;                       // 0x04E8(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionSecondaryContinuousPitchOverride;                   // 0x0518(0x0100) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectMeleeV2               MeleeV2;                                                  // 0x0618(0x0128) (Edit, BlueprintVisible)
	class UAnimSequence*                               HandAdditive;                                             // 0x0740(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0748(0x0008) MISSED OFFSET
	struct FTransform                                  OffsetLeftHand;                                           // 0x0750(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FTransform                                  OffsetRightHand;                                          // 0x0780(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FWieldAnimationParams                       Params;                                                   // 0x07B0(0x0040) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectFacial                Facial;                                                   // 0x07F0(0x0070) (Edit, BlueprintVisible)
	bool                                               RangedWeapon;                                             // 0x0860(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0861(0x0007) MISSED OFFSET
	struct FAthenaAnimationSkeletonKnockbackLocomotionStrength KnockBack;                                                // 0x0868(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationFishingAnimations           Fishing;                                                  // 0x0888(0x0090) (Edit, BlueprintVisible)
	class UAnimSequence*                               ScreamStun;                                               // 0x0918(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectTargetingOptions
// 0x003C
struct FAthenaAnimationObjectTargetingOptions
{
	TEnumAsByte<EObjectPitchTargetingLimbs>            ArmSelection;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              UpperClampTargetingAngle;                                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LowerClampTargetingAngle;                                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShoulderInfluenceUpper;                                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShoulderInfluenceLower;                                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetUpper;                                  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetLower;                                  // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               LockHandOrientation;                                      // 0x002C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FVector                                     VirtualPivotOffsetLerped;                                 // 0x0030(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationPitchControlStates
// 0x0168
struct FAthenaAnimationPitchControlStates
{
	struct FAthenaAnimationObjectTargetingOptions      StandardPassive;                                          // 0x0000(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      StandardWater;                                            // 0x003C(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1;                                                  // 0x0078(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1Water;                                             // 0x00B4(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action2;                                                  // 0x00F0(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action2Water;                                             // 0x012C(0x003C) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelay
// 0x000C
struct FAthenaAnimationFirstPersonTurnDelay
{
	float                                              MaxAngle;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DelayOutSpeed;                                            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DelayInSpeed;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelayStates
// 0x0020
struct FAthenaAnimationFirstPersonTurnDelayStates
{
	struct FAthenaAnimationFirstPersonTurnDelay        PassiveState;                                             // 0x0000(0x000C) (Edit, BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelay        ContinuousUse;                                            // 0x000C(0x000C) (Edit, BlueprintVisible)
	float                                              TurnDelayAngle;                                           // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              InvTurnDelayAngle;                                        // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLoadObjectsWrapper
// 0x0AB0
struct FAthenaAnimationLoadObjectsWrapper
{
	struct FAthenaAnimationCoreObjectAnimations        ObjectAnimation;                                          // 0x0000(0x0920) (Edit, BlueprintVisible)
	struct FAthenaAnimationPitchControlStates          ObjectTargeting3rdPerson;                                 // 0x0920(0x0168) (Edit, BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelayStates  FirstPersonTurnDelay;                                     // 0x0A88(0x0020) (Edit, BlueprintVisible)
	class UClass*                                      ObjectID;                                                 // 0x0AA8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationHandHeldItemParams
// 0x0020
struct FAthenaAnimationHandHeldItemParams
{
	bool                                               LeftArmOverlayActive;                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               RightArmOverlayActive;                                    // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               UpperBodyOverlayActive;                                   // 0x0002(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               FullBodyOverlayActive;                                    // 0x0003(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SpineOverlayActive;                                       // 0x0004(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SpineLockActive;                                          // 0x0005(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ObjectActive;                                             // 0x0006(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ObjectOverrideStateActive;                                // 0x0007(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class FString                                      OverlayAnimationName;                                     // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
	TEnumAsByte<EItemPassiveState>                     ObjectPassiveState;                                       // 0x0018(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               QuickStow;                                                // 0x0019(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Reload;                                                   // 0x001A(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x001B(0x0005) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationIdleVariantChange
// 0x0010
struct FAthenaAnimationIdleVariantChange
{
	float                                              CurrentTime;                                              // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TriggerTime;                                              // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VariantID;                                                // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               VariantCompleted;                                         // 0x000C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.HandOnWheelAnimationRanges
// 0x0040
struct FHandOnWheelAnimationRanges
{
	struct FFloatRange                                 LeftHandOnWheelA;                                         // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 LeftHandOnWheelB;                                         // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightHandOnWheelA;                                        // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightHandOnWheelB;                                        // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.WheelIKActivationRanges
// 0x0040
struct FWheelIKActivationRanges
{
	struct FFloatRange                                 LeftArmDownRangeA;                                        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 LeftArmDownRangeB;                                        // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightArmDownRangeA;                                       // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightArmDownRangeB;                                       // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationWheel
// 0x01D0
struct FAthenaAnimationWheel
{
	struct FSocketId                                   LeftHandMaleSocket;                                       // 0x0000(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandMaleSocket;                                      // 0x0020(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   LeftHandFemaleSocket;                                     // 0x0040(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandFemaleSocket;                                    // 0x0060(0x0020) (Edit, DisableEditOnInstance)
	float                                              TranslationStrength;                                      // 0x0080(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationStrength;                                         // 0x0084(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x0088(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x008C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FHandOnWheelAnimationRanges                 HandOnWheelAnimationRanges;                               // 0x0090(0x0040) (Edit, DisableEditOnInstance)
	struct FWheelIKActivationRanges                    WheelArmIKDownWithinRange;                                // 0x00D0(0x0040) (Edit, DisableEditOnInstance)
	TEnumAsByte<EWheelAnimationType>                   WheelAnimationType;                                       // 0x0110(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0111(0x0003) MISSED OFFSET
	float                                              WheelTime;                                                // 0x0114(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WheelDirection;                                           // 0x0118(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RightFingerAlpha;                                         // 0x011C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LeftFingerAlpha;                                          // 0x0120(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0124(0x0004) MISSED OFFSET
	bool                                               LeftWheelArmDown;                                         // 0x0128(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RightWheelArmDown;                                        // 0x0129(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x012A(0x0006) MISSED OFFSET
	class AActor*                                      ControlledObject;                                         // 0x0130(0x0008) (ZeroConstructor, IsPlainOldData)
