#pragma once

// Sea of Thieves (1.4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_BP_Anim_FishingRod_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Anim_FishingRod.BP_Anim_FishingRod_C
// 0x156C (0x1BBC - 0x0650)
class UBP_Anim_FishingRod_C : public UWieldableFishingRodAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0650(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_EDE43C174EA613B760B85A8243DF8736;      // 0x0658(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_316B233F479A460C283CF5A1A873E9E4;// 0x06A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_65037C52489F3DA61B86F6921B053177;// 0x06E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A20A7566439B93E50C0CF4A894505E9C;// 0x0720(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D024319048878DDCF1121AB36EE6B28B;// 0x0760(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7633CAB04DC204B0E6E09AA9F49F5189;// 0x07A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_535EB42D44232817CF418D883C6417D6;// 0x07E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CDEBA2CA4F7A0CD8612F04BD4E1A491A;// 0x0820(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4E1ACD2458DECD6C2E09A8D08B40404;// 0x0860(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76350F374C5583C2B16BDAB9FB139ABA;// 0x08A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44B670A94DFA9DF2AC19C08BC712F9DE;// 0x08E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46A2D12B4B3E8BC20002A9BFD2F4483C;// 0x0920(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_388C83784AE7830EE274C38C93DC5532;// 0x0960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0193244D44387C4F1AD74A96E80A16E4;// 0x09A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02AFE28B472D855EF0A539A738CE6983;// 0x09E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B56FC935403C7A06E3AAF1A8F6ED2620;// 0x0A20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B119FB1B4E28040C9CA008A10FFF6C70;// 0x0A60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47C47C664D07FEFDC925FEBB0A8E19B4;// 0x0AA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2191B0146D87EB6C76E8E902D25B44D;// 0x0AE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9301E4945E811372B8918BB0E6080C9;// 0x0B20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32EB052D40C553EB5D0F799EEAA5F277;// 0x0B60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36AC6EAF430325711DFC38948C7FF07E;// 0x0BA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B724A55B47B994CAB33FD184F2EC5F9E;// 0x0BE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D7D73691417A11F6353163B69BF05DD6;// 0x0C20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0BCBC534969837B621DBFAF768917B3;// 0x0C60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37E9DF944D938122B80095A8FA842F03;// 0x0CA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E6177B634AD93DC0F53784BB54217CFC;// 0x0CE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1228236F4FA4BAFCF6C14EBA447D9F70;// 0x0D20(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83326B9840F0AB60A6F1BE91286463BD;// 0x0D60(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53CCB5F14F8CC3B01D05FD87F8430D39;// 0x0DA0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_452D0A15465A5F5E9B3F1D95C2E07CAD;// 0x0DE0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7891A33A4FFC278679E013941C82ED0D;// 0x0E20(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_6611706843BF612979E814A11ABEE8D1;// 0x0E60(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_840C37634E34ED1FAC0C9AA0A6EDFC522;// 0x0EB0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB5C0C0C4F0B87455115408464DA4ADB;// 0x0EF8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_840C37634E34ED1FAC0C9AA0A6EDFC52;// 0x0F50(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9F426118455DB4045ADA5E9939E6B8EF;// 0x0F98(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_92C1E0A54A7B280B84346F98ED0446292;// 0x0FE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00154D8D4E81FF74AAD8A9A03386905A;// 0x1030(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4C7F45E5441F2070A8F99F9911BA278D;// 0x1088(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2AE850474F69125A41669296400230B8;// 0x10D0(0x0058)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_24A1AA0549ABCAE5E454EF825E808ADB;// 0x1128(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_85E8550A41FA56E41BD30E8546E4957F;// 0x1230(0x00A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4E62C1EE491EBCC6F552448BBA53FC0C;// 0x12D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_171FA3884D215EE88B7F41B3B3211457;// 0x1318(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DF7ECFD64F1811CCC915EAA8B877CC7E;// 0x1370(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_790EDFC049D11F6D32745FA320CBD8CC;// 0x13B8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_26A0D5904BDF69AC1DC5F7B15EB7160A;// 0x14C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_94D0C21C4B251E1F7BEF78B825AFA8EB;// 0x1508(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE8A25BA4E01827B4DD67D96D518D166;// 0x1560(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5393CCD941726BDBE4DF68BD58CC8AA9;// 0x15A8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E50D616F457876B00451FC98E9B4C3F6;// 0x1600(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8C8E3556453963200C2FBB8011D7A218;// 0x1648(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_92C1E0A54A7B280B84346F98ED044629;// 0x16A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C28614034648EB6B296EFBBD8007EC43;// 0x16E8(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A753349448FE6F26E3EEB7809FDFF704;// 0x1728(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1F0DDB57487A85866A3647BC76ECB383;// 0x1778(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_FFBB8ECD48FFAC9FAB9BD48526AAFC76;// 0x1828(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E679A2AF4A72CE39499F118AA4319345;// 0x1878(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EF7707D84C688F6055C899A2EDBA1926;// 0x18C0(0x0058)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C01E36645747C02DDA617B1AB22C774;// 0x1918(0x0108)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5FC6BE81454FAA2FC39CD7BACB1932FB;// 0x1A20(0x00A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1DEE0B1D4E5BDF2213B58CB491321770;// 0x1AC0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5850CD3749FE6A56190AA9B6EACFB4FC;// 0x1B08(0x00A8)
	float                                              DEBUGTimer;                                               // 0x1BB0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DEBUGWantedVerticalBend;                                  // 0x1BB4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DEBUGWantedHorizontalBend;                                // 0x1BB8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("AnimBlueprintGeneratedClass BP_Anim_FishingRod.BP_Anim_FishingRod_C"));
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_316B233F479A460C283CF5A1A873E9E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_65037C52489F3DA61B86F6921B053177();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_A20A7566439B93E50C0CF4A894505E9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_D024319048878DDCF1121AB36EE6B28B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_7633CAB04DC204B0E6E09AA9F49F5189();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_535EB42D44232817CF418D883C6417D6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_CDEBA2CA4F7A0CD8612F04BD4E1A491A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_D4E1ACD2458DECD6C2E09A8D08B40404();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_76350F374C5583C2B16BDAB9FB139ABA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_44B670A94DFA9DF2AC19C08BC712F9DE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_46A2D12B4B3E8BC20002A9BFD2F4483C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_388C83784AE7830EE274C38C93DC5532();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_0193244D44387C4F1AD74A96E80A16E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_02AFE28B472D855EF0A539A738CE6983();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B56FC935403C7A06E3AAF1A8F6ED2620();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B119FB1B4E28040C9CA008A10FFF6C70();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_47C47C664D07FEFDC925FEBB0A8E19B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_A2191B0146D87EB6C76E8E902D25B44D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_E9301E4945E811372B8918BB0E6080C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_32EB052D40C553EB5D0F799EEAA5F277();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_36AC6EAF430325711DFC38948C7FF07E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B724A55B47B994CAB33FD184F2EC5F9E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_D7D73691417A11F6353163B69BF05DD6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B0BCBC534969837B621DBFAF768917B3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_37E9DF944D938122B80095A8FA842F03();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_E6177B634AD93DC0F53784BB54217CFC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_1228236F4FA4BAFCF6C14EBA447D9F70();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_83326B9840F0AB60A6F1BE91286463BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_53CCB5F14F8CC3B01D05FD87F8430D39();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_452D0A15465A5F5E9B3F1D95C2E07CAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_7891A33A4FFC278679E013941C82ED0D();
	void ExecuteUbergraph_BP_Anim_FishingRod(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
