#pragma once

// Sea of Thieves (1.4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_BP_Pig_AnimationInstance_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Pig_AnimationInstance.BP_Pig_AnimationInstance_C
// 0x7AB9 (0x8E19 - 0x1360)
class UBP_Pig_AnimationInstance_C : public UFaunaAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x1360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_62FAD2374E41FC30AE0854B3698FACC3;      // 0x1368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5F1FFB942A6E1FACF6C798B32BE83F4;// 0x13B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CC64FA74FA116D3AA87EB9C0A97C901;// 0x13F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_768DAF94443E421205FEAFA35331AF95;// 0x1430(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D28359EA4F74179B79BC9F8D4BAE488A;// 0x1470(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0283C7847C85EE8945E50BB6E425E49;// 0x14B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A6EB76B412459ED6E0F1EBA6B5431F7;// 0x14F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A0D0B9094AEFB14F3D5423945E75D465;// 0x1530(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC181A47432D80BFA04C999C96E9474E;// 0x1570(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B23C1CCE4809AA64B0BBF1B94AFEDF3F;// 0x15B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_813586EA42543F409899BDADE26C20C4;// 0x15F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4C106E4432F3D4FC6A4E7B2B18D4470;// 0x1630(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7453C76440C981BB92679FAA0C617CB1;// 0x1670(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E616474747F6437024211CA65FEC8A6A;// 0x16B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79D07AC742D9FBA5FB0D6E955983A168;// 0x16F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC4E1509491BCAAB33CA768FCF126157;// 0x1730(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF3CFB61468F2367312525AB14FA7D40;// 0x1770(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CACE8C9847AA481DD0F710A2BB53C62F;// 0x17B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF6377BF40EF38958CA098AB6AB50079;// 0x17F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86A612A34426B6C0091A9E818776DB33;// 0x1830(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28A2587D4F46532E44FF7788B4B307C7;// 0x1870(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EAD8BF0C4C3CE9EA225C52910A3F9B37;// 0x18B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27BE7DF54CB02D367B1194842BF68CA3;// 0x18F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9D5B8134F0AA5410A86819282BECD13;// 0x1930(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6EC5C28D49C5191F191DF59F3A1A1D0A;// 0x1970(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AC43F444D8FE631FB269C990002EC59;// 0x19B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B3D52F964C0E05E6DC7DD7A864588F62;// 0x19F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_05B5A45048B9D9DC73CB35BCE31B3AF2;// 0x1A30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AC967BEA4E2CF82ABC356084D7847FCB;// 0x1A70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A810B69547B22F057D8D13B8CCE3BD41;// 0x1AB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FE5EA2740C92852DF4217B8F34699A4;// 0x1AF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BDA53578488DDEEB855B28A92AF8EDD4;// 0x1B30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBE769F7480BE676602227B02404D251;// 0x1B70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6C94CAD487ED21F2A8A8A8665DE66DC;// 0x1BB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_061816444CCA5CA5003274B866ADA6EA;// 0x1BF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_491063F342932DCBA3A1B1ADA90864F9;// 0x1C30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2265661E41A82A93A78AC08E4CFB7A33;// 0x1C70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43FE702D49C132A895B0D187EAA3DE61;// 0x1CB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6223E51949CCB2264610269D0F171794;// 0x1CF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D8C645EC4F8AF21FF845F683ABDD89DA;// 0x1D30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4B4C1BC4014B94513F96DB59BCA72D4;// 0x1D70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9A2DF59341C82251628324A2A0DDAE6D;// 0x1DB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2AC5151042CFF73D4BA96A974AE14C3F;// 0x1DF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5FF099B492A20CC8EB33093E75BF893;// 0x1E30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9950A46B44AE075B900D499AF825A8D6;// 0x1E70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EBA423AC4141CFFFAAF1779B88813909;// 0x1EB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68670C8D4AC62C359F7289A4EBD22B03;// 0x1EF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0617CAAF4AB46E4719E54AB1FA244594;// 0x1F30(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CBC0779E4EBD5951BB84A4B0E987463C;// 0x1F70(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FAC40DCA45D9643FA645D5A98C729EDD;// 0x1FC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8C4EA043403B17E5F783CDAB9FF9661F;// 0x2008(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_417DD50440AD739867B284867C92DDE8;// 0x2060(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_22D3322E460E64641DDCE8B51CDFF333;// 0x20A8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_75D4ADB241429011AE9779B4F5EC86F3;// 0x2150(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B93D7D774603348EF44840BBE38160BF;// 0x2198(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8D9723F245F3D996084B4EA3DCB9C490;// 0x21D8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_56ACCAF347A330E1C71863862815A091;// 0x2228(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE37AF3E43AC870489BE8E8AD476173A;// 0x2270(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BBBF174A45C960247994B0AD65A95DC4;// 0x22C8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B97EFF7E4F33BBBE3A3C1D93AE9E0B7B;// 0x2310(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EBB30E9F47B9F96FC92D268C504AB261;// 0x23B8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A6248B35470BB75B63EFD7AECE52FFF8;// 0x2400(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D2A7DE864F90C6B9FD00F39B5C341858;// 0x2448(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A8ABE58E43C651E722D3ACA2A7C6163D;// 0x2490(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5342C6EC4012E056830300A3E34081B9;// 0x2520(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_12316D5A4EF341D1ECDF2E9ABAB5CBA6;// 0x2560(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_66A6F0484554F382C4731F9E5C488BFB;// 0x25B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1EF3CA5141C2EA0E9FB83281AA8DC8B3;// 0x25F8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_713A3A1C444F035308362BB2CC6E5579;// 0x2650(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_44A3D90D4194DDEE54366DA31A0CC411;// 0x2698(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_00C8CCEE4E07DBB38BFC259823F8C905;// 0x2740(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26F43CD34E1DB6ECE56A8F8D7A4FBC09;// 0x2788(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9E4BDEAD4A21E33368849E9E618E751B;// 0x27E0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B5CB52B2419AE51927CA13BA24800345;// 0x2890(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EDF9D59249F7C78DFD1A469B5F063F34;// 0x28E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34AB8D124EA70BDEA6B9F4BDD856B516;// 0x2930(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9C38AC7D42B46B3F2630E3A47AC9885F;// 0x2988(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5988C3AC4A3460CC358482ADF0ED424D;// 0x2A38(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6CF769874738187A47B1CE9D8B119701;// 0x2A90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8152219B480C0ECCE6F097A359DA3CCF;// 0x2AD8(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D546F8494A991796883FEFA47B40D2A4;// 0x2B30(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_423754DF46770FFCECF1458898FFF6C3;// 0x2BE0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6AE00FEF478F9234AD9473825352AED6;// 0x2C38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_76937AFB4C4E1020965F0EB155E98AD7;// 0x2C80(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9AB1608844AC5734C95AD4A2EC1AE0BD;// 0x2CD8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE1136EA4F5D03CC865773AC4CD33F8E;// 0x2D20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B172C1DA4FD0428FE8B62E862EC1036E;// 0x2D78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_413F93FF42D9929F18EA40980B37D45E;// 0x2DC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7D445414459939387C3ED7B2169250A3;// 0x2E18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D84E9F4D451FEAD3ABB864BEA66CEE16;// 0x2E60(0x0040)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_212536CE43B8C8E8F852CF988B4F6B2C;// 0x2EA0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C37BBC6E46B340F4521FA28A0D446D29;// 0x2FB0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0E41AB1844F73427EC7EAA8A913ABA21;// 0x2FF8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_83E61C244F62DBE1FBDBBB9AE3C27F4D;// 0x3100(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_57FE71424A1495750C1742BA8EDDB0E3;// 0x3148(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_24D1CC894E2CD02F5411F4AA6E5CDAA0;// 0x31F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_398FC5F846A9CE7834D62CB6E9FB52F0;// 0x3238(0x0040)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_9C266052420036A9B4DE94A7A8462114;// 0x3278(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C6985FB44A28ED203FC73A8679238947;// 0x3388(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7F55EF90441C7E3DC26E04B264099A8C;// 0x33D0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_879EE7BC4E19D9F4CDF5DEB87870FDFF;// 0x34D8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9D948A72425E3BA10FECBAA411896136;// 0x3520(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7322C2C47A17DD4E23DB396FC7FE629;// 0x35C8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7601B200443F3EFC5CB4639CC414625C;// 0x3610(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8E34E7D446C06A7B429835A1C99338FA;// 0x3658(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EFD671A74E5693C17AAA389E8010B0B0;// 0x36A0(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB718A9A43B3749DC3AB6CBDAD53BCA4;// 0x3730(0x0040)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_B68EF8B14117BB61D0F59B90A8AD1D35;// 0x3770(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_66B6874D4572A3709FBCC09E20278424;// 0x3880(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B02AEFC04B8EB1E3193814895768873B;// 0x38C8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_24F534044AA9316D9069A79869E7777F;// 0x39D0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BD0FCFFF46F4903FF56C62B0081000B6;// 0x3A18(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_931AD54740756FAA3CBC43B31F5A9FDC;// 0x3AC0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE2156EE49DBAB5B21A720B60D56D5803;// 0x3B08(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB2B176943BE10A49619F58E737BF6A53;// 0x3B48(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A5F99A104BFEBA8CC21FF08162D6D9753;// 0x3B88(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_465F6A424A8EA1FB3503CFA9865A25AA3;// 0x3C90(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3375874D41230D21B77FDCBC7145A9553;// 0x3CD8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B23029A9406B0ACFCBE28CA6B57FB4A43;// 0x3DE0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2CAFFFF14153C4DA73B9318F97C758EF;// 0x3E28(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_759FC02C48E183189ACA0E87CD7C1342;// 0x3ED0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE2156EE49DBAB5B21A720B60D56D5802;// 0x3F18(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB2B176943BE10A49619F58E737BF6A52;// 0x3F58(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A5F99A104BFEBA8CC21FF08162D6D9752;// 0x3F98(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_465F6A424A8EA1FB3503CFA9865A25AA2;// 0x40A0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3375874D41230D21B77FDCBC7145A9552;// 0x40E8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B23029A9406B0ACFCBE28CA6B57FB4A42;// 0x41F0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C63ABFC34214677A6FD91F985CA3524C;// 0x4238(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3FC8A1854EDD4859DD5B7089F2946FF3;// 0x42E0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CD3CE01F4F15CDE9DE0EF9BDF5DC3816;// 0x4328(0x0090)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C339ECF944A7A5663CA85384930497D8;// 0x43B8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E856D22745F45E52D29A968F60AAB573;// 0x4400(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE2156EE49DBAB5B21A720B60D56D580;// 0x4448(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB2B176943BE10A49619F58E737BF6A5;// 0x4488(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A5F99A104BFEBA8CC21FF08162D6D975;// 0x44C8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_465F6A424A8EA1FB3503CFA9865A25AA;// 0x45D0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3375874D41230D21B77FDCBC7145A955;// 0x4618(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B23029A9406B0ACFCBE28CA6B57FB4A4;// 0x4720(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B3016DCE4FD5463DF2E46F8E40733C80;// 0x4768(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E91BA1A542F22EC38E89CF91504736BD;// 0x4810(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7277D2B447E4592211212499A2CC06FD;// 0x4858(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E17A4A5C45B2623259A7109738FF8D22;// 0x4898(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87CF0D2A41AA222C002305B3E71C86BD;// 0x48D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE39121F4B1CC3658BF28399FC819B45;// 0x4918(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9889E88E4FD96D6C95012084660284AC;// 0x4958(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D5D6D9C441825AD991DBDAB0BEA62F2;// 0x4998(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02C7CE63451E4EBDEA232FAC07B4C81E;// 0x49D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF9566434FFFA1F399EBDF891BAF3033;// 0x4A18(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_830A144D440BFC13D5B9CCB0D9AC761F;// 0x4A58(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62E1764F4F154366BE4CD18CE81D35AB;// 0x4A98(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C600CE1475C5F9D5A1561B057D83A88;// 0x4AD8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6AE08F9C4BF76A1489A34695462EB465;// 0x4B18(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_621FFB284A7097868867629F3F0D9643;// 0x4B58(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9289D5224E5BC7290F36909BE8DFA8CF;// 0x4B98(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F826;// 0x4BD8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A596;// 0x4C30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F825;// 0x4C78(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A595;// 0x4CD0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3938D1D949DCE71C6CA48E849432C5CC3;// 0x4D18(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_171E81CA45FB326D0D4F1FA28543F93C3;// 0x4D70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_582F062A4C91109AE7104ABF853E93893;// 0x4DB8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_020CCD214E6A9993B946398A127A314D3;// 0x4DF8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCE7015A4C5E6C80FE275CBC15A65B053;// 0x4E50(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_690B883A4AD74A477BFECEB1CBDCDEC43;// 0x4EA8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC557474464FBF740CB3109563C9162B3;// 0x4F68(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8042F68443B4B3B5063A9B826B1050C63;// 0x4FC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B92BB494CF0F29D0CE297A216AE32453;// 0x5008(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0339A9EA413385E5D3818A9DD6EF78463;// 0x5060(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FA7167A7469CC3D68065D4B6E7406C603;// 0x50A8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ED59FFB546F12C74D98C3AB81FEF5E633;// 0x5150(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC4312;// 0x5198(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF420910812;// 0x51D8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A12;// 0x5230(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B91012;// 0x5278(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF12;// 0x52D0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_68BBDB834F5AA65203D35B9F4FB0DF6C;// 0x5318(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC4311;// 0x53C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF420910811;// 0x5400(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A11;// 0x5458(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B91011;// 0x54A0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF11;// 0x54F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D95A4EFC4E673F2DAAE5A2BA26E9FFE7;// 0x5540(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5F6102D14F6B3777598F72BC0B5B2472;// 0x55E8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D21B9B384C1E1C465BEA438BB9F0A937;// 0x56A8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_52BEDCBC4DD8F27410A274944D48C300;// 0x5700(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC4310;// 0x5748(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF420910810;// 0x5788(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A10;// 0x57E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B91010;// 0x5828(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF10;// 0x5880(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D354541641627935FBE5DDB76F5C02BD;// 0x58C8(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC439;// 0x5970(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091089;// 0x59B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A9;// 0x5A08(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9109;// 0x5A50(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF9;// 0x5AA8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5C063B144F9E55194975F5ABF0AE1D41;// 0x5AF0(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C7FC59844F71CCD411A9918B092F3893;// 0x5B98(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_23B6F3DC487D377E279A8EACB0CF39A6;// 0x5C58(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_633712F74269C06F1F08C393829AA773;// 0x5CB0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A14E2DD74C1843346C7B8AB7FEB596E0;// 0x5CF8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7380A8F4403FC9D56386D6B30C21038F;// 0x5DA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B42398E48E9EB052FCF29837F793860;// 0x5DE8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D54AF434E0F0A6D0F406AA0585B3AFE;// 0x5E28(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDD04C104CAC8177318286A1361F9DA4;// 0x5E68(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5D6E86347848A0A40FB9885A49FA7B0;// 0x5EA8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F094514B47799CDA3A426FBF34BD98AB;// 0x5EE8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30A5C85C491BFEF48849B9825451BEB6;// 0x5F28(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E66AD8114B67E6B7E5CA9EBE1B4B85E4;// 0x5F68(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C0D879214A3E2C1039EBE1A1223C2A4C;// 0x5FA8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_466A04B04AB713859CFEDC82511C5559;// 0x5FE8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F935F214E1ADF5EB3FE2FA3ACD54950;// 0x6028(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F99C59AC43E470BE6771E49CDC75FE2A;// 0x6068(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F824;// 0x60A8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A594;// 0x6100(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F823;// 0x6148(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A593;// 0x61A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3938D1D949DCE71C6CA48E849432C5CC2;// 0x61E8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_171E81CA45FB326D0D4F1FA28543F93C2;// 0x6240(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_582F062A4C91109AE7104ABF853E93892;// 0x6288(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_020CCD214E6A9993B946398A127A314D2;// 0x62C8(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCE7015A4C5E6C80FE275CBC15A65B052;// 0x6320(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_690B883A4AD74A477BFECEB1CBDCDEC42;// 0x6378(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC557474464FBF740CB3109563C9162B2;// 0x6438(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8042F68443B4B3B5063A9B826B1050C62;// 0x6490(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B92BB494CF0F29D0CE297A216AE32452;// 0x64D8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0339A9EA413385E5D3818A9DD6EF78462;// 0x6530(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FA7167A7469CC3D68065D4B6E7406C602;// 0x6578(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ED59FFB546F12C74D98C3AB81FEF5E632;// 0x6620(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC438;// 0x6668(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091088;// 0x66A8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A8;// 0x6700(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9108;// 0x6748(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF8;// 0x67A0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_019399AB461F5F17F772A69E9195AA00;// 0x67E8(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC437;// 0x6890(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091087;// 0x68D0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A7;// 0x6928(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9107;// 0x6970(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF7;// 0x69C8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C5542D3D44536C8C7A4C3B81093EA8F5;// 0x6A10(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_477F652C46B7A50B131E07A54D46721A;// 0x6AB8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A2AA426A45F607C2C47F8082BA93D9E9;// 0x6B78(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6D8379DE495E670AA93C8F8FFCD0B95A;// 0x6BD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC436;// 0x6C18(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091086;// 0x6C58(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A6;// 0x6CB0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9106;// 0x6CF8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF6;// 0x6D50(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2CB4DAD3409362AFE26DAA80CAE7EC9B;// 0x6D98(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC435;// 0x6E40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091085;// 0x6E80(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A5;// 0x6ED8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9105;// 0x6F20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF5;// 0x6F78(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_774C101B406AFD15B4F825835A382861;// 0x6FC0(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6956B5754DF819F0CB2011880E985B79;// 0x7068(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AE735047403881E292213CB826ECA34C;// 0x7128(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E0582B34465592EA3722A7816D468C1D;// 0x7180(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_707A9672484E71E4C03E75BAD423596A;// 0x71C8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8B079D4D4B937A634F427AB9D906857C;// 0x7270(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64260F484942DCAF553103AFB4FD0009;// 0x72B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3811E1EE4060F70CE72C4BA3356552B9;// 0x72F8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_73FBE6EA4A42E1E8C07399B44B10C509;// 0x7338(0x0090)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0F892A114DC187691D7517BD0245D1AD;// 0x73C8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8F3AE97141B83DDEC68580BD1133E4C1;// 0x7410(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF30DE914E6C8AEE56697096741F93C9;// 0x7458(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC2B0B3F4250C9C9B683E88DE456F341;// 0x7498(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE0E7FA946285EE8043B76B9A55C5A8E;// 0x74D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9CC7DA2C4F681E97EAA6EBBF928B4A6C;// 0x7518(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFBB2FA84B3CF3283B60E7A236841D76;// 0x7558(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED43398E4A2491B8AE0335874C694F6B;// 0x7598(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFD455514212D0A5EA65279FAC2FC65A;// 0x75D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F6C115E84A0769C7392DC397CCD166B4;// 0x7618(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F92A4184381E28296ADD68ED3CB26BF;// 0x7658(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7150142443603677D6F231A83E3724E2;// 0x7698(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F08A6DD242C2FED21191BD81B2FC1976;// 0x76D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_942425CA4815D5BD53D136BD6810ED07;// 0x7718(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB5A503C40BB3C2BFAA4C7B1DF1C053D;// 0x7758(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BAE55F649E5C3E90DEAF5A23AA979CE;// 0x7798(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F83B14F740C8427409BD9FBA40FCEF3D;// 0x77D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F73B8B84B141F14AF0C1C9B2E614CCE;// 0x7818(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1266EB194A63C851C535678D661F5377;// 0x7858(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A5CAA1B4469EF3E7E2603490D077177B;// 0x7898(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_851397BA44844F676E0AD0BA64C0A96F;// 0x78D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6FFA6414A2CC1B2C7A5CDB132D72B5F;// 0x7918(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F822;// 0x7958(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A592;// 0x79B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F82;// 0x79F8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A59;// 0x7A50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3938D1D949DCE71C6CA48E849432C5CC;// 0x7A98(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_171E81CA45FB326D0D4F1FA28543F93C;// 0x7AF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_582F062A4C91109AE7104ABF853E9389;// 0x7B38(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_020CCD214E6A9993B946398A127A314D;// 0x7B78(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCE7015A4C5E6C80FE275CBC15A65B05;// 0x7BD0(0x0058)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_690B883A4AD74A477BFECEB1CBDCDEC4;// 0x7C28(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC557474464FBF740CB3109563C9162B;// 0x7CE8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8042F68443B4B3B5063A9B826B1050C6;// 0x7D40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9B92BB494CF0F29D0CE297A216AE3245;// 0x7D88(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0339A9EA413385E5D3818A9DD6EF7846;// 0x7DE0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FA7167A7469CC3D68065D4B6E7406C60;// 0x7E28(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ED59FFB546F12C74D98C3AB81FEF5E63;// 0x7ED0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_299A443F40722765B55414AC3680D365;// 0x7F18(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_86BE80F84E9E77373DF1AAA3286B727B;// 0x7F70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E7DE8604D953ADCD748399C0CA7EE38;// 0x7FB8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D854AB134836723E63C62C8BC8CF2395;// 0x8010(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_855963844EFF76823E7E018ED059D544;// 0x8058(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC434;// 0x8098(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091084;// 0x80D8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A4;// 0x8130(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9104;// 0x8178(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF4;// 0x81D0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_19BBEBEB4E439D07C5B07C80A312162D;// 0x8218(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC433;// 0x82C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091083;// 0x8300(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A3;// 0x8358(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9103;// 0x83A0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF3;// 0x83F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_222BDFAC43C912F21983C6A286DC7374;// 0x8440(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9EE7C3834C4A7C6AE9056598E73D9992;// 0x84E8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A3A852D46F1459FF57A6DA0A0FBE945;// 0x85A8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A784DBA645E7F3837254868F814CC731;// 0x8600(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC432;// 0x8648(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091082;// 0x8688(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A2;// 0x86E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9102;// 0x8728(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF2;// 0x8780(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B613F3494C14D25EC10CF48CDFBDC585;// 0x87C8(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC43;// 0x8870(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF4209108;// 0x88B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A;// 0x8908(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B910;// 0x8950(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF;// 0x89A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DF2F959B4A0D7946B840769A1F9B7A74;// 0x89F0(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_386EDAA8428D6A2B1716EC8D66963E9B;// 0x8A98(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2173EF884406C512A15FD8925076BE42;// 0x8B58(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6986FD5A4966E285FC1036AA521E92DC;// 0x8BB0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A708DB0545F072CD6847A68242EF6959;// 0x8BF8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E85C314D419727F4A5F5529F13476687;// 0x8CA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA7328954BCCAE7FBA3AA9ACC3D666A7;// 0x8CE8(0x0040)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D6A5B2D94B58F1D69208E9A0964B88EA;// 0x8D28(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C8C975DD49BC6D460E3A97A02213979D;// 0x8D70(0x00A8)
	bool                                               Flee;                                                     // 0x8E18(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>("AnimBlueprintGeneratedClass BP_Pig_AnimationInstance.BP_Pig_AnimationInstance_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_D5F1FFB942A6E1FACF6C798B32BE83F4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_6CC64FA74FA116D3AA87EB9C0A97C901();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_768DAF94443E421205FEAFA35331AF95();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_D28359EA4F74179B79BC9F8D4BAE488A();
