#pragma once

// Sea of Thieves (1.4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct DS_TheArtOfTheTrickster_Notes_Variables.DS_TheArtOfTheTrickster_Notes_Variables
// 0x0078
struct FDS_TheArtOfTheTrickster_Notes_Variables
{
	class AActor*                                      DigSite1_31_F630CC204886E65A1BDB13A79067453E;             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DigSite1ItemClass_107_E296BDC042657F921F4163AACD5EAE25;   // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        DigSite1Pages_66_74C033194286485E1F1564939C71EA58;        // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      DigSite2_21_DB1E57704D5C52447DC735B51F58E58F;             // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DigSite2ItemClass_108_A2D854A54D07159B07310FBB43895BE6;   // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        DigSite2Pages_70_AE531C7C4D98D7C75ED10E975ABF1E1F;        // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      DigSite3_26_4A4C4520433F50BCD785A68C802FE2DC;             // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DigSite3ItemClass_109_C07BC4E64D13C7DEBD6360836892719A;   // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        DigSite3Pages_73_832BC36846DB108FF057DE9B9601E5EA;        // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      GunpowderDigSite_85_54800C814D8120696C1CABB914159F5D;     // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        GunpowderPages_92_F87C56FF4E56D028B51AF8B99AD82723;       // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        SkeletonPagesLeft_96_280E80D14A2481A5C5C609928FCAB556;    // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        PreGunpowderPagesLeft_102_EE83731B4BF9B0130281669E24B21BCF;// 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        GunpowderPagesLeft_103_B862FCC14522284C103CC29F3F697746;  // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      GunpowderExplosionTriggerActor_113_4D29911E4A15CE1CB88E97B3137AB6DD;// 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
