#pragma once

// Sea of Thieves (1.1.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Basic.hpp"
#include "SoT_CoreUObject_classes.hpp"
#include "SoT_AthenaAI_classes.hpp"
#include "SoT_ActionStateMachine_classes.hpp"
#include "SoT_Interaction_classes.hpp"
#include "SoT_AthenaRigging_classes.hpp"
#include "SoT_AthenaInput_classes.hpp"
#include "SoT_RareAudio_classes.hpp"
#include "SoT_ObjectMessaging_classes.hpp"
#include "SoT_Engine_classes.hpp"
#include "SoT_AthenaSocketLookup_classes.hpp"
#include "SoT_CoherentUIGTPlugin_classes.hpp"
#include "SoT_Animation_classes.hpp"
#include "SoT_Water_classes.hpp"
#include "SoT_PirateGenerator_classes.hpp"
#include "SoT_InputCore_classes.hpp"
#include "SoT_DebugMenu_classes.hpp"
#include "SoT_Kraken_classes.hpp"
#include "SoT_RareEngine_classes.hpp"
#include "SoT_GameService_classes.hpp"
#include "SoT_GameplayDebugger_classes.hpp"
#include "SoT_Wind_classes.hpp"
#include "SoT_StudiosAutomation_classes.hpp"
#include "SoT_AIShips_classes.hpp"
#include "SoT_AIModule_classes.hpp"
#include "SoT_StatusEffects_classes.hpp"
#include "SoT_Maths_classes.hpp"
#include "SoT_WwiseAudio_classes.hpp"
#include "SoT_JsonUtilities_classes.hpp"
#include "SoT_PositionalVoice_classes.hpp"
#include "SoT_Time_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum Athena.EHealthChangedReason
enum class EHealthChangedReason : uint8_t
{
	EHealthChangedReason__NoChange = 0,
	None                           = 1,
	IntProperty                    = 2,
	EHealthChangedReason__CannonBallSplashDamage = 3,
	None01                         = 4,
	NameProperty                   = 5,
	EHealthChangedReason__DamagedBySwimmingCreature = 6,
	None02                         = 7,
	TextBlockStyle                 = 8,
	EHealthChangedReason__EyeOfReach_Default = 9,
	None03                         = 10,
	USlateWidgetStyleContainerBase = 11,
	EHealthChangedReason__PowerSlammedByKrakenTentacle = 12,
	None04                         = 13,
	NamedNotificationInputComponent = 14,
	EHealthChangedReason__Fire     = 15,
	None05                         = 16,
	TFilterPS142                   = 17,
	EHealthChangedReason__SunkenCurseDamage = 18,
	None06                         = 19,
	TSlateElementPSDefaulttruefalse = 20,
	EHealthChangedReason__EHealthChangedReason_MAX = 21,
	OnlineSecurity                 = 22,
	PacketHandler                  = 23,
	None07                         = 24,
	None08                         = 25,
	BoolProperty                   = 26
};


// Enum Athena.ERepairableState
enum class ERepairableState : uint8_t
{
	ERepairableState__NeverDamaged = 0,
	None                           = 1,
	ERepairableState__ERepairableState_MAX = 2
};


// Enum Athena.EShipPartCustomizationErrorCode
enum class EShipPartCustomizationErrorCode : uint8_t
{
	EShipPartCustomizationErrorCode__AlreadyInProgress = 0,
	None                           = 1,
	EShipPartCustomizationErrorCode__FailedToFindCustomizationComponent = 2,
	None01                         = 3,
	EShipPartCustomizationErrorCode__EShipPartCustomizationErrorCode_MAX = 4
};


// Enum Athena.ERequestState
enum class ERequestState : uint8_t
{
	ERequestState__Invalid         = 0,
	None                           = 1,
	IntProperty                    = 2,
	ERequestState__Cancelled       = 3,
	None01                         = 4
};


// Enum Athena.EPlayerStatsOperator
enum class EPlayerStatsOperator : uint8_t
{
	EPlayerStatsOperator__Sum      = 0,
	None                           = 1,
	IntProperty                    = 2,
	EPlayerStatsOperator__EPlayerStatsOperator_MAX = 3,
	EInteractionObject__None       = 4
};


// Enum Athena.EAthenaAITeam
enum class EAthenaAITeam : uint8_t
{
	Players                        = 0,
	None                           = 1,
	Fauna_Snakes                   = 2,
	None01                         = 3
};


// Enum Athena.EControllableObjectType
enum class EControllableObjectType : uint8_t
{
	EControllableObjectType__None  = 0,
	None                           = 1,
	EControllableObjectType__SailAngle = 2,
	None01                         = 3,
	NameProperty                   = 4,
	EControllableObjectType__Ladder = 5,
	None02                         = 6
};


// Enum Athena.ECameraLookatAnimationType
enum class ECameraLookatAnimationType : uint8_t
{
	ECameraLookatAnimationType__Default = 0,
	None                           = 1,
	ECameraLookatAnimationType__Tentacle = 2,
	None01                         = 3
};


// Enum Athena.ELookAtRotationType
enum class ELookAtRotationType : uint8_t
{
	ELookAtRotationType__Rate      = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EIKFootPlantingState
enum class EIKFootPlantingState : uint8_t
{
	EIKFootPlantingState__On       = 0,
	None                           = 1
};


// Enum Athena.EIKSolverType
enum class EIKSolverType : uint8_t
{
	EIKSolverType__NormalSolver    = 0,
	None                           = 1
};


// Enum Athena.EIKState
enum class EIKState : uint8_t
{
	EIKState__On                   = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EAthenaAnimationSocketGroupCharacterSize
enum class EAthenaAnimationSocketGroupCharacterSize : uint8_t
{
	EAthenaAnimationSocketGroupCharacterSize__Default = 0,
	None                           = 1,
	EIKState__On                   = 2
};


// Enum Athena.EAthenaAnimationSocketGroup
enum class EAthenaAnimationSocketGroup : uint8_t
{
	EAthenaAnimationSocketGroup__Male = 0,
	None                           = 1
};


// Enum Athena.EWieldedItemAnimationState
enum class EWieldedItemAnimationState : uint8_t
{
	EWieldedItemAnimationState__Equipping = 0,
	None                           = 1,
	EWieldedItemAnimationState__ContinuousUse = 2,
	None01                         = 3,
	EWieldedItemAnimationState__Blocking = 4,
	None02                         = 5,
	EControllableObjectType__None  = 6,
	None03                         = 7
};


// Enum Athena.ECharacterHitReactionAnimType
enum class ECharacterHitReactionAnimType : uint8_t
{
	ECharacterHitReactionAnimType__Full = 0,
	None                           = 1,
	EKnockbackAnimDirection__Forwards = 2
};


// Enum Athena.EKnockbackAnimDirection
enum class EKnockbackAnimDirection : uint8_t
{
	EKnockbackAnimDirection__Forwards = 0,
	None                           = 1
};


// Enum Athena.ESkeletonActiveAnimSystem
enum class ESkeletonActiveAnimSystem : uint8_t
{
	ESkeletonActiveAnimSystem__Sensing = 0,
	None                           = 1
};


// Enum Athena.ESkeletonEmoteActionState
enum class ESkeletonEmoteActionState : uint8_t
{
	ESkeletonEmoteActionState__None = 0,
	None                           = 1,
	EAthenaAnimationCapstanState__Neutral = 2
};


// Enum Athena.ESkeletonSensingState
enum class ESkeletonSensingState : uint8_t
{
	ESkeletonSensingState__None    = 0,
	None                           = 1,
	ESkeletonSensingState__Pursuit = 2,
	None01                         = 3,
	ERadialInventoryType__None     = 4
};


// Enum Athena.EInteractionObject
enum class EInteractionObject : uint8_t
{
	EInteractionObject__None       = 0,
	None                           = 1,
	EInteractionObject__EInteractionObject_MAX = 2,
	EFacialPriority__Low           = 3
};


// Enum Athena.EMeleeSpecialState
enum class EMeleeSpecialState : uint8_t
{
	EMeleeSpecialState__None       = 0,
	None                           = 1,
	EMeleeSpecialState__Dodge      = 2,
	None01                         = 3
};


// Enum Athena.EEmoteSequenceType
enum class EEmoteSequenceType : uint8_t
{
	EEmoteSequenceType__Continuous = 0,
	None                           = 1
};


// Enum Athena.EArmOverlayFlags
enum class EArmOverlayFlags : uint8_t
{
	EArmOverlayFlags__RightArmOnly = 0,
	None                           = 1,
	EArmOverlayFlags__UpperBodyRight = 2,
	None01                         = 3
};


// Enum Athena.ELocomotionType
enum class ELocomotionType : uint8_t
{
	ELocomotionType__Standard      = 0,
	None                           = 1,
	ELocomotionType__Combat        = 2,
	None01                         = 3
};


// Enum Athena.EItemPassiveState
enum class EItemPassiveState : uint8_t
{
	EItemPassiveState__Idle        = 0,
	None                           = 1,
	EItemPassiveState__Swimming    = 2,
	None01                         = 3,
	ERequestState__Invalid         = 4
};


// Enum Athena.EFacialPriority
enum class EFacialPriority : uint8_t
{
	EFacialPriority__Low           = 0,
	None                           = 1,
	EFacialPriority__EFacialPriority_MAX = 2,
	ETelemetryPlatformId__Undefined = 3
};


// Enum Athena.EStairAnimations
enum class EStairAnimations : uint8_t
{
	EStairAnimations__UpLeft       = 0,
	None                           = 1,
	EStairAnimations__EStairAnimations_MAX = 2,
	EPlayerStatsOperator__Sum      = 3
};


// Enum Athena.EContinuousUseID
enum class EContinuousUseID : uint8_t
{
	EContinuousUseID__In           = 0,
	None                           = 1
};


// Enum Athena.EContinuousUseOverride
enum class EContinuousUseOverride : uint8_t
{
	EContinuousUseOverride__None   = 0,
	None                           = 1,
	EContinuousUseID__In           = 2
};


// Enum Athena.EObjectPitchTargetingStates
enum class EObjectPitchTargetingStates : uint8_t
{
	EObjectPitchTargetingStates__None = 0,
	None                           = 1,
	EObjectPitchTargetingStates__Action_1_Water = 2,
	BoolProperty                   = 3
};


// Enum Athena.EObjectPitchTargetingLimbs
enum class EObjectPitchTargetingLimbs : uint8_t
{
	EObjectPitchTargetingLimbs__None = 0,
	None                           = 1,
	EObjectPitchTargetingLimbs__EObjectPitchTargetingLimbs_MAX = 2,
	ECharacterDeathType__Invalid   = 3
};


// Enum Athena.EWieldAnimationGraph
enum class EWieldAnimationGraph : uint8_t
{
	EWieldAnimationGraph__ThirdPerson = 0,
	None                           = 1
};


// Enum Athena.EWieldAnimationLocation
enum class EWieldAnimationLocation : uint8_t
{
	EWieldAnimationLocation__Left  = 0,
	None                           = 1,
	EWieldAnimationLocation__RT_CAMERA_IK_HAND__Skeleton = 2,
	None01                         = 3,
	EWieldAnimationLocation__EWieldAnimationLocation_MAX = 4,
	EHealthAdjustLockReasons__IsTeleporting = 5,
	None02                         = 6
};


// Enum Athena.EItemBlockingSubState
enum class EItemBlockingSubState : uint8_t
{
	EItemBlockingSubState__None    = 0,
	None                           = 1,
	EItemBlockingSubState__EItemBlockingSubState_MAX = 2,
	EItemType__Weapon              = 3
};


// Enum Athena.EComplexOneShotSubState
enum class EComplexOneShotSubState : uint8_t
{
	EComplexOneShotSubState__WarmUp = 0,
	None                           = 1,
	EComplexOneShotSubState__HeavyAttackStun = 2,
	None01                         = 3,
	EWheelAnimationType__SmallTurn = 4
};


// Enum Athena.EAthenaAnimationCapstanState
enum class EAthenaAnimationCapstanState : uint8_t
{
	EAthenaAnimationCapstanState__Neutral = 0,
	None                           = 1,
	EContinuousUseOverride__None   = 2
};


// Enum Athena.EAthenaAnimationJumpingState
enum class EAthenaAnimationJumpingState : uint8_t
{
	EAthenaAnimationJumpingState__None = 0,
	None                           = 1,
	EAthenaAnimationJumpingState__JumpFinished = 2,
	None01                         = 3
};


// Enum Athena.EAthenaAnimationWheelState
enum class EAthenaAnimationWheelState : uint8_t
{
	EAthenaAnimationWheelState__Neutral = 0,
	None                           = 1,
	EWieldableItemComplexOneShotAnimType__MeleeComboAttack = 2
};


// Enum Athena.EWheelAnimationType
enum class EWheelAnimationType : uint8_t
{
	EWheelAnimationType__SmallTurn = 0,
	None                           = 1,
	EWheelAnimationType__RightTurnFast = 2,
	None01                         = 3,
	EWieldItemReturnCode__Success  = 4
};


// Enum Athena.EWieldableItemAnimVariant
enum class EWieldableItemAnimVariant : uint8_t
{
	EWieldableItemAnimVariant__Default = 0,
	None                           = 1,
	EWieldableItemAnimVariant__Variant4 = 2,
	None01                         = 3,
	NameProperty                   = 4
};


// Enum Athena.EWieldableItemBlockingAnimState
enum class EWieldableItemBlockingAnimState : uint8_t
{
	EWieldableItemBlockingAnimState__Main = 0,
	None                           = 1
};


// Enum Athena.EWieldableItemComplexOneShotAnimType
enum class EWieldableItemComplexOneShotAnimType : uint8_t
{
	EWieldableItemComplexOneShotAnimType__MeleeComboAttack = 0,
	None                           = 1
};


// Enum Athena.EItemType
enum class EItemType : uint8_t
{
	EItemType__Weapon              = 0,
	None                           = 1,
	EItemType__EItemType_MAX       = 2,
	EAimSensitivitySettingCategory__Invalid = 3
};


// Enum Athena.EWieldItemReturnCode
enum class EWieldItemReturnCode : uint8_t
{
	EWieldItemReturnCode__Success  = 0,
	None                           = 1,
	IntProperty                    = 2,
	EWieldItemReturnCode__WaitingForUnstash = 3,
	None01                         = 4,
	EQuestType__Unknown            = 5
};


// Enum Athena.EDropItemReturnCode
enum class EDropItemReturnCode : uint8_t
{
	EDropItemReturnCode__NothingToDrop = 0,
	None                           = 1,
	IntProperty                    = 2,
	EWieldAnimationGraph__ThirdPerson = 3
};


// Enum Athena.EStowMethod
enum class EStowMethod : uint8_t
{
	EStowMethod__Unequip           = 0,
	None                           = 1
};


// Enum Athena.EStashReason
enum class EStashReason : uint8_t
{
	EStashReason__Locomotion       = 0,
	None                           = 1,
	EStashReason__Dead             = 2,
	None01                         = 3,
	EStashReason__EStashReason_MAX = 4,
	EWieldAnimationLocation__Left  = 5,
	None02                         = 6
};


// Enum Athena.ECharacterDeathType
enum class ECharacterDeathType : uint8_t
{
	ECharacterDeathType__Invalid   = 0,
	None                           = 1,
	ECharacterDeathType__ECharacterDeathType_MAX = 2,
	EItemBlockingSubState__None    = 3
};


// Enum Athena.EPerspectiveTypes
enum class EPerspectiveTypes : uint8_t
{
	EPerspectiveTypes__FirstPerson = 0,
	None                           = 1
};


// Enum Athena.EItemUseSpeed
enum class EItemUseSpeed : uint8_t
{
	EItemUseSpeed__Default         = 0,
	IntProperty                    = 1,
	IntProperty01                  = 2,
	ECanAddItemQueryResult__Success = 3
};


// Enum Athena.EHealthAdjustLockReasons
enum class EHealthAdjustLockReasons : uint8_t
{
	EHealthAdjustLockReasons__IsTeleporting = 0,
	None                           = 1,
	EHealthAdjustLockReasons__Dead = 2,
	None01                         = 3,
	EHealthAdjustLockReasons__EHealthAdjustLockReasons_MAX = 4,
	ECrewSessionType__Invalid      = 5,
	None02                         = 6
};


// Enum Athena.ERadialMenuInputModality
enum class ERadialMenuInputModality : uint8_t
{
	ERadialMenuInputModality__None = 0,
	None                           = 1,
	IntProperty                    = 2,
	EStowMethod__Unequip           = 3
};


// Enum Athena.ECanAddItemQueryResult
enum class ECanAddItemQueryResult : uint8_t
{
	ECanAddItemQueryResult__Success = 0,
	None                           = 1,
	FloatProperty                  = 2,
	EProjectileCollisionResponse__Ignore = 3
};


// Enum Athena.EMaxMoveSpeedScalarReason
enum class EMaxMoveSpeedScalarReason : uint8_t
{
	EMaxMoveSpeedScalarReason__Digging = 0,
	None                           = 1,
	EMaxMoveSpeedScalarReason__MeleeBlocking = 2,
	None01                         = 3
};


// Enum Athena.EProjectileCollisionResponse
enum class EProjectileCollisionResponse : uint8_t
{
	EProjectileCollisionResponse__Ignore = 0,
	None                           = 1
};


// Enum Athena.EAttitudeTowardActor
enum class EAttitudeTowardActor : uint8_t
{
	EAttitudeTowardActor__Friendly = 0,
	None                           = 1,
	ESprintLockReason__WieldedItem = 2
};


// Enum Athena.ESprintLockReason
enum class ESprintLockReason : uint8_t
{
	ESprintLockReason__WieldedItem = 0,
	None                           = 1
};


// Enum Athena.EExplosionReceiverCurveType
enum class EExplosionReceiverCurveType : uint8_t
{
	EExplosionReceiverCurveType__None = 0,
	None                           = 1,
	IntProperty                    = 2,
	ESwimAttackableType__TakesDamage = 3
};


// Enum Athena.ESwimAttackableType
enum class ESwimAttackableType : uint8_t
{
	ESwimAttackableType__TakesDamage = 0,
	None                           = 1,
	EItemLifetimeManagement__Automatic = 2
};


// Enum Athena.EShipRegion
enum class EShipRegion : uint8_t
{
	EShipRegion__None              = 0,
	None                           = 1,
	EShipRegion__TopDeck_CaptainsCabin = 2,
	None01                         = 3,
	EShipRegion__MapDeck_Table     = 4,
	None02                         = 5,
	EShipRegion__BrigDeck_InsideBrig = 6,
	None03                         = 7
};


// Enum Athena.EShipDeck
enum class EShipDeck : uint8_t
{
	EShipDeck__BottomDeck          = 0,
	None                           = 1,
	IntProperty                    = 2,
	EItemUseSpeed__Default         = 3
};


// Enum Athena.EInputControllerType
enum class EInputControllerType : uint8_t
{
	EInputControllerType__GamePad  = 0,
	None                           = 1
};


// Enum Athena.EAimSensitivitySettingCategory
enum class EAimSensitivitySettingCategory : uint8_t
{
	EAimSensitivitySettingCategory__Invalid = 0,
	None                           = 1,
	EAimSensitivitySettingCategory__EAimSensitivitySettingCategory_MAX = 2,
	ECharacterFootImpactType__None = 3
};


// Enum Athena.ECharacterFootImpactType
enum class ECharacterFootImpactType : uint8_t
{
	ECharacterFootImpactType__None = 0,
	None                           = 1,
	ECharacterFootImpactType__ECharacterFootImpactType_MAX = 2,
	EBrigState__Unbriggable        = 3
};


// Enum Athena.EItemLifetimeManagement
enum class EItemLifetimeManagement : uint8_t
{
	EItemLifetimeManagement__Automatic = 0,
	None                           = 1
};


// Enum Athena.EItemRepresentation
enum class EItemRepresentation : uint8_t
{
	EItemRepresentation__None      = 0,
	None                           = 1,
	EWieldableItemSize__Small      = 2
};


// Enum Athena.EWieldableItemSize
enum class EWieldableItemSize : uint8_t
{
	EWieldableItemSize__Small      = 0,
	None                           = 1
};


// Enum Athena.EWieldableItemVisibilityReason
enum class EWieldableItemVisibilityReason : uint8_t
{
	EWieldableItemVisibilityReason__Animation = 0,
	None                           = 1,
	EBrigReleaseReason__VoteToRelease = 2
};


// Enum Athena.EQuestMapIcon
enum class EQuestMapIcon : uint8_t
{
	EQuestMapIcon__Unknown         = 0,
	None                           = 1,
	EQuestMapIcon__Merchant        = 2,
	None01                         = 3,
	NameProperty                   = 4
};


// Enum Athena.EQuestType
enum class EQuestType : uint8_t
{
	EQuestType__Unknown            = 0,
	None                           = 1,
	EQuestType__Merchant           = 2,
	None01                         = 3,
	ELadderTransitionMode__OnTop   = 4
};


// Enum Athena.ETrackedActorType
enum class ETrackedActorType : uint8_t
{
	ETrackedActorType__Unknown     = 0,
	None                           = 1,
	ETrackedActorType__AI_Shark    = 2,
	None01                         = 3,
	ETrackedActorType__StorageContainerBuoyant = 4,
	None02                         = 5,
	ETrackedActorType__NPC         = 6,
	None03                         = 7,
	ETrackedActorType__Ship_Small  = 8,
	None04                         = 9,
	ETrackedActorType__MAX         = 10,
	None05                         = 11
};


// Enum Athena.ERadialInventoryType
enum class ERadialInventoryType : uint8_t
{
	ERadialInventoryType__None     = 0,
	None                           = 1,
	IntProperty                    = 2,
	ERadialInventoryType__Emotes   = 3,
	None01                         = 4,
	EComplexOneShotSubState__WarmUp = 5
};


// Enum Athena.ETelemetryPlatformId
enum class ETelemetryPlatformId : uint8_t
{
	ETelemetryPlatformId__Undefined = 0,
	None                           = 1,
	ETelemetryPlatformId__ETelemetryPlatformId_MAX = 2,
	EObjectPitchTargetingLimbs__None = 3
};


// Enum Athena.ECrewSessionType
enum class ECrewSessionType : uint8_t
{
	ECrewSessionType__Invalid      = 0,
	None                           = 1,
	ECrewSessionType__SmallShip    = 2,
	None01                         = 3,
	ECrewSessionType__ECrewSessionType_MAX = 4,
	EShipState__PlainSailing       = 5,
	None02                         = 6
};


// Enum Athena.ESessionVisibility
enum class ESessionVisibility : uint8_t
{
	ESessionVisibility__Invalid    = 0,
	None                           = 1,
	EMatchmakingVisibilityState__Public = 2
};


// Enum Athena.EMatchmakingVisibilityState
enum class EMatchmakingVisibilityState : uint8_t
{
	EMatchmakingVisibilityState__Public = 0,
	None                           = 1
};


// Enum Athena.EScuttleState
enum class EScuttleState : uint8_t
{
	EScuttleState__Scuttled        = 0,
	None                           = 1
};


// Enum Athena.EBrigState
enum class EBrigState : uint8_t
{
	EBrigState__Unbriggable        = 0,
	None                           = 1,
	EBrigState__EBrigState_MAX     = 2,
	EShovelDigType__Success        = 3
};


// Enum Athena.EVfxCustomLocalSpaceMode
enum class EVfxCustomLocalSpaceMode : uint8_t
{
	EVfxCustomLocalSpaceMode__Default = 0,
	None                           = 1,
	EVfxCustomLocalSpaceMode__EVfxCustomLocalSpaceMode_MAX = 2,
	EAthenaAnimationLadderState__None = 3
};


// Enum Athena.EAnimNotifyUnderwaterMode
enum class EAnimNotifyUnderwaterMode : uint8_t
{
	EAnimNotifyUnderwaterMode__AutoDetect = 0,
	None                           = 1,
	IntProperty                    = 2,
	ELadderType__Generic           = 3
};


// Enum Athena.EAthenaAnimationLadderState
enum class EAthenaAnimationLadderState : uint8_t
{
	EAthenaAnimationLadderState__None = 0,
	None                           = 1,
	EAthenaAnimationLadderState__EAthenaAnimationLadderState_MAX = 2,
	EEncounterListenerType__None   = 3
};


// Enum Athena.EAthenaAnimationLadderTransitionState
enum class EAthenaAnimationLadderTransitionState : uint8_t
{
	EAthenaAnimationLadderTransitionState__None = 0,
	None                           = 1,
	IntProperty                    = 2,
	EExplosionReceiverCurveType__None = 3
};


// Enum Athena.ELadderType
enum class ELadderType : uint8_t
{
	ELadderType__Generic           = 0,
	None                           = 1,
	ECharacterSwimmingMode__Surface = 2
};


// Enum Athena.ELadderTransitionMode
enum class ELadderTransitionMode : uint8_t
{
	ELadderTransitionMode__OnTop   = 0,
	None                           = 1,
	ELadderTransitionMode__Max     = 2,
	None01                         = 3,
	ELocalGameChatStatus__Undefined = 4
};


// Enum Athena.EArmOverlayState
enum class EArmOverlayState : uint8_t
{
	EArmOverlayState__Idle         = 0,
	None                           = 1,
	IntProperty                    = 2,
	EArmOverlayState__JumpingStart = 3,
	None01                         = 4,
	NameProperty                   = 5,
	EArmOverlayState__Equipping    = 6,
	None02                         = 7,
	StructProperty                 = 8,
	EArmOverlayState__ContinuousActionCycle = 9,
	None03                         = 10,
	TextProperty                   = 11,
	EArmOverlayState__ContinuousActionJumpCycle = 12,
	None04                         = 13,
	LazyObjectProperty             = 14,
	EArmOverlayState__ComplexOneShotWarmUp = 15,
	None05                         = 16,
	UInt16Property                 = 17,
	EArmOverlayState__BlockingLocomotion = 18,
	None06                         = 19,
	Int8Property                   = 20,
	EArmOverlayState__EArmOverlayState_MAX = 21,
	None07                         = 22,
	None08                         = 23
};


// Enum Athena.EVoyageChangeReason
enum class EVoyageChangeReason : uint8_t
{
	EVoyageChangeReason__Unknown   = 0,
	None                           = 1,
	FVsyncOptions__Off             = 2
};


// Enum Athena.ECharacterSwimmingMode
enum class ECharacterSwimmingMode : uint8_t
{
	ECharacterSwimmingMode__Surface = 0,
	None                           = 1,
	EVoyageChangeReason__Unknown   = 2
};


// Enum Athena.EAudioGameState
enum class EAudioGameState : uint8_t
{
	EAudioGameState__None          = 0,
	None                           = 1,
	EAudioGameState__EAudioGameState_MAX = 2,
	FPerformanceCounterOptions__None = 3
};


// Enum Athena.ERespawnType
enum class ERespawnType : uint8_t
{
	ERespawnType__Ghost            = 0,
	None                           = 1
};


// Enum Athena.EShovelDigType
enum class EShovelDigType : uint8_t
{
	EShovelDigType__Success        = 0,
	None                           = 1,
	EShovelDigType__EShovelDigType_MAX = 2,
	EVfxCustomLocalSpaceMode__Default = 3
};


// Enum Athena.EEncounterListenerType
enum class EEncounterListenerType : uint8_t
{
	EEncounterListenerType__None   = 0,
	None                           = 1,
	EEncounterListenerType__EEncounterListenerType_MAX = 2,
	EAudioGameState__None          = 3
};


// Enum Athena.EEncounterMobility
enum class EEncounterMobility : uint8_t
{
	EEncounterMobility__Static     = 0,
	None                           = 1
};


// Enum Athena.EEncounterDimensions
enum class EEncounterDimensions : uint8_t
{
	EEncounterDimensions__ThreeDimensions = 0,
	None                           = 1
};


// Enum Athena.EEncounterType
enum class EEncounterType : uint8_t
{
	EEncounterType__None           = 0,
	None                           = 1,
	EEncounterType__ShipEncounter  = 2,
	None01                         = 3,
	EEncounterType__SkellyFortEncounter = 4,
	None02                         = 5,
	EEncounterType__TinySharkEncounter = 6,
	None03                         = 7
};


// Enum Athena.FPerformanceCounterOptions
enum class EFPerformanceCounterOptions : uint8_t
{
	FPerformanceCounterOptions__None = 0,
	None                           = 1,
	FPerformanceCounterOptions__FPerformanceCounterOptions_MAX = 2,
	EProgressStyle__Circle         = 3
};


// Enum Athena.FVsyncOptions
enum class EFVsyncOptions : uint8_t
{
	FVsyncOptions__Off             = 0,
	None                           = 1,
	ERespawnType__Ghost            = 2
};


// Enum Athena.FPersistentUserGameSettingsDetail
enum class EFPersistentUserGameSettingsDetail : uint8_t
{
	FPersistentUserGameSettingsDetail__Min = 0,
	None                           = 1,
	FPersistentUserGameSettingsDetail__Ultra = 2,
	None01                         = 3
};


// Enum Athena.EBindingSet
enum class EBindingSet : uint8_t
{
	EBindingSet__ActionBindings    = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EVfxRegion
enum class EVfxRegion : uint8_t
{
	EVfxRegion__None               = 0,
	None                           = 1,
	IntProperty                    = 2,
	EBindingSet__ActionBindings    = 3
};


// Enum Athena.ETreasureMapVerticalAlignment
enum class ETreasureMapVerticalAlignment : uint8_t
{
	ETreasureMapVerticalAlignment__Top = 0,
	None                           = 1
};


// Enum Athena.ETreasureMapHorizontalAlignment
enum class ETreasureMapHorizontalAlignment : uint8_t
{
	ETreasureMapHorizontalAlignment__Left = 0,
	None                           = 1
};


// Enum Athena.ESpawnedItemSource
enum class ESpawnedItemSource : uint8_t
{
	ESpawnedItemSource__None       = 0,
	None                           = 1,
	ESpawnedItemSource__Island     = 2,
	None01                         = 3,
	NameProperty                   = 4
};


// Enum Athena.EBootyTypes
enum class EBootyTypes : uint8_t
{
	EBootyTypes__Invalid           = 0,
	None                           = 1,
	EBootyTypes__TreasureArtifact  = 2,
	None01                         = 3,
	NameProperty                   = 4
};


// Enum Athena.EShipState
enum class EShipState : uint8_t
{
	EShipState__PlainSailing       = 0,
	None                           = 1,
	EShipState__KeelingOver        = 2,
	None01                         = 3,
	EShipState__EShipState_MAX     = 4,
	EShipBuilderErrorCode__AlreadyInProgress = 5,
	None02                         = 6
};


// Enum Athena.EBuoyantObjectState
enum class EBuoyantObjectState : uint8_t
{
	EBuoyantObjectState__Rising    = 0,
	None                           = 1,
	EBuoyantObjectState__EBuoyantObjectState_MAX = 2,
	EEntitlementStatus__Unknown    = 3
};


// Enum Athena.EIslandType
enum class EIslandType : uint8_t
{
	EIslandType__Resource          = 0,
	None                           = 1,
	EIslandType__Large             = 2,
	None01                         = 3,
	EIslandType__Max               = 4,
	None02                         = 5
};


// Enum Athena.EBrigReleaseReason
enum class EBrigReleaseReason : uint8_t
{
	EBrigReleaseReason__VoteToRelease = 0,
	None                           = 1,
	ESessionVisibility__Invalid    = 2
};


// Enum Athena.ECarouselPirateBodyshapeDirection
enum class ECarouselPirateBodyshapeDirection : uint8_t
{
	ECarouselPirateBodyshapeDirection__None = 0,
	None                           = 1,
	ECarouselPirateBodyshapeDirection__SW = 2,
	None01                         = 3,
	ECarouselPirateBodyshapeDirection__NE = 4,
	None02                         = 5,
	EWieldedItemAnimationState__Equipping = 6,
	None03                         = 7
};


// Enum Athena.EWalletCurrencyId
enum class EWalletCurrencyId : uint8_t
{
	EWalletCurrencyId__Undefined   = 0,
	None                           = 1,
	ELeftStickScalarReason__Limping = 2
};


// Enum Athena.EMusicalInstrumentType
enum class EMusicalInstrumentType : uint8_t
{
	EMusicalInstrumentType__Banjo  = 0,
	None                           = 1,
	EMusicalInstrumentType__HurdyGurdy = 2,
	None01                         = 3,
	EMusicalInstrumentType__VoiceBox = 4,
	None02                         = 5,
	ECurseTag__None                = 6
};


// Enum Athena.EMastType
enum class EMastType : uint8_t
{
	EMastType__Front               = 0,
	None                           = 1,
	IntProperty                    = 2,
	EWalletCurrencyId__Undefined   = 3
};


// Enum Athena.EPlayerMusicState
enum class EPlayerMusicState : uint8_t
{
	EPlayerMusicState__InCave      = 0,
	None                           = 1,
	EPlayerMusicState__NoMusicState = 2,
	None01                         = 3,
	EPlayerMusicState__OnBountyFortPreAction = 4,
	None02                         = 5,
	EPlayerMusicState__OutAtSea    = 6,
	None03                         = 7,
	TextProperty                   = 8,
	EPlayerMusicState__EPlayerMusicState_MAX = 9,
	None04                         = 10,
	None05                         = 11,
	None06                         = 12
};


// Enum Athena.ECharacterSocketCollisionResultType
enum class ECharacterSocketCollisionResultType : uint8_t
{
	CollisionsOnly                 = 0,
	None                           = 1,
	EShipDynamicsAnchoredState__Unknown = 2
};


// Enum Athena.ECharacterSocketCollisionTraceType
enum class ECharacterSocketCollisionTraceType : uint8_t
{
	WorldUp                        = 0,
	None                           = 1,
	TravelForwards                 = 2,
	None01                         = 3
};


// Enum Athena.ELeftStickScalarReason
enum class ELeftStickScalarReason : uint8_t
{
	ELeftStickScalarReason__Limping = 0,
	None                           = 1,
	IntProperty                    = 2,
	CollisionsOnly                 = 3
};


// Enum Athena.EEntitlementStatus
enum class EEntitlementStatus : uint8_t
{
	EEntitlementStatus__Unknown    = 0,
	None                           = 1,
	EEntitlementStatus__EEntitlementStatus_MAX = 2,
	EDoorState__Closed             = 3
};


// Enum Athena.EUIInputFocusType
enum class EUIInputFocusType : uint8_t
{
	EUIInputFocusType__None        = 0,
	None                           = 1,
	EDrunkennessType__FromDrinkingAlcohol = 2
};


// Enum Athena.EProgressStyle
enum class EProgressStyle : uint8_t
{
	EProgressStyle__Circle         = 0,
	None                           = 1,
	EProgressStyle__EProgressStyle_MAX = 2,
	EBuoyantObjectState__Rising    = 3
};


// Enum Athena.ECrewOwnershipState
enum class ECrewOwnershipState : uint8_t
{
	ECrewOwnershipState__Neutral   = 0,
	None                           = 1
};


// Enum Athena.EShipLocation
enum class EShipLocation : uint8_t
{
	EShipLocation__TOP_DECK        = 0,
	None                           = 1,
	EShipLocation__HATCH_BACK_RIGHT = 2,
	None01                         = 3,
	EShipLocation__CABIN_SIDE_DOOR = 4,
	None02                         = 5,
	EShipLocation__MAP_DECK_FRONT_PLANE = 6,
	None03                         = 7,
	TextProperty                   = 8,
	EShipLocation__BRIG_DECK_STAIRS_PLANE = 9,
	None04                         = 10,
	LazyObjectProperty             = 11,
	EShipLocation__EShipLocation_MAX = 12,
	Color                          = 13,
	Pointer                        = 14,
	BoxSphereBounds                = 15
};


// Enum Athena.ECurseTag
enum class ECurseTag : uint8_t
{
	ECurseTag__None                = 0,
	None                           = 1,
	ECurseTag__ToggleVFXForShipStorageContainers = 2,
	None01                         = 3,
	NameProperty                   = 4,
	ECurseTag__ToggleVFXForShipCannons = 5,
	None02                         = 6,
	StructProperty                 = 7,
	ECurseTag__ECurseTag_MAX       = 8
};


// Enum Athena.EShipDynamicsAnchoredState
enum class EShipDynamicsAnchoredState : uint8_t
{
	EShipDynamicsAnchoredState__Unknown = 0,
	None                           = 1,
	IntProperty                    = 2,
	EUIInputFocusType__None        = 3
};


// Enum Athena.EDamageTargetType
enum class EDamageTargetType : uint8_t
{
	EDamageTargetType__Player      = 0,
	None                           = 1
};


// Enum Athena.DrowningState
enum class EDrowningState : uint8_t
{
	DrowningState__NotDrowning     = 0,
	None                           = 1,
	IntProperty                    = 2,
	EVoyageLocationType__Fixed     = 3
};


// Enum Athena.EDrunkennessType
enum class EDrunkennessType : uint8_t
{
	EDrunkennessType__FromDrinkingAlcohol = 0,
	None                           = 1,
	IntProperty                    = 2,
	ERiddleActionLocationOffsets__PerformActionAtLocation = 3
};


// Enum Athena.EEmblemUnlockCriteriaAggregationType
enum class EEmblemUnlockCriteriaAggregationType : uint8_t
{
	EEmblemUnlockCriteriaAggregationType__None = 0,
	None                           = 1
};


// Enum Athena.EQuestDistributionMethod
enum class EQuestDistributionMethod : uint8_t
{
	EQuestDistributionMethod__AllAtOnce = 0,
	None                           = 1,
	EQuestLocationSelectionMethod__NoRepetitionWithinVoyage = 2
};


// Enum Athena.EVoyageLocationType
enum class EVoyageLocationType : uint8_t
{
	EVoyageLocationType__Fixed     = 0,
	None                           = 1
};


// Enum Athena.EQuestLocationSelectionMethod
enum class EQuestLocationSelectionMethod : uint8_t
{
	EQuestLocationSelectionMethod__NoRepetitionWithinVoyage = 0,
	None                           = 1
};


// Enum Athena.EQuestPoolSelectionMethod
enum class EQuestPoolSelectionMethod : uint8_t
{
	EQuestPoolSelectionMethod__Sequential = 0,
	None                           = 1
};


// Enum Athena.EConeWeightingMethod
enum class EConeWeightingMethod : uint8_t
{
	EConeWeightingMethod__Weighted = 0,
	None                           = 1
};


// Enum Athena.EFaunaAnimationSnakeAttackDirection
enum class EFaunaAnimationSnakeAttackDirection : uint8_t
{
	EFaunaAnimationSnakeAttackDirection__Forwards = 0,
	None                           = 1
};


// Enum Athena.EFaunaAnimationStartledLevel
enum class EFaunaAnimationStartledLevel : uint8_t
{
	EFaunaAnimationStartledLevel__None = 0,
	None                           = 1,
	EFaunaAnimationLocation__Land  = 2
};


// Enum Athena.EFaunaAnimationLocation
enum class EFaunaAnimationLocation : uint8_t
{
	EFaunaAnimationLocation__Land  = 0,
	None                           = 1,
	EFaunaInWaterState__NotInWater = 2
};


// Enum Athena.EFaunaAnimationState
enum class EFaunaAnimationState : uint8_t
{
	EFaunaAnimationState__Idle     = 0,
	None                           = 1,
	EFaunaAnimationState__Death    = 2,
	None01                         = 3
};


// Enum Athena.EFaunaInWaterState
enum class EFaunaInWaterState : uint8_t
{
	EFaunaInWaterState__NotInWater = 0,
	None                           = 1,
	EGameplayEventSignalType__SkellyFort = 2
};


// Enum Athena.EFaunaCratedState
enum class EFaunaCratedState : uint8_t
{
	EFaunaCratedState__NotInCrate  = 0,
	None                           = 1,
	EShantyEnsembleOption__TryToJoinExistingNearbyEnsemble = 2
};


// Enum Athena.EGameplayEventSignalType
enum class EGameplayEventSignalType : uint8_t
{
	EGameplayEventSignalType__SkellyFort = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EPreventDamageTypeLockReasons
enum class EPreventDamageTypeLockReasons : uint8_t
{
	EPreventDamageTypeLockReasons__IsFiredOutOfACannon = 0,
	None                           = 1
};


// Enum Athena.EHoleState
enum class EHoleState : uint8_t
{
	EHoleState__Alive              = 0,
	None                           = 1
};


// Enum Athena.EBuriedItemType
enum class EBuriedItemType : uint8_t
{
	EBuriedItemType__None          = 0,
	None                           = 1,
	IntProperty                    = 2,
	EMermaidState__Rising          = 3
};


// Enum Athena.EShantyEnsembleOption
enum class EShantyEnsembleOption : uint8_t
{
	EShantyEnsembleOption__TryToJoinExistingNearbyEnsemble = 0,
	None                           = 1
};


// Enum Athena.EMermaidState
enum class EMermaidState : uint8_t
{
	EMermaidState__Rising          = 0,
	None                           = 1,
	ETreasureChestProxyState__Idle = 2
};


// Enum Athena.ERiddleActions
enum class ERiddleActions : uint8_t
{
	ERiddleActions__RaiseLanternAnyone = 0,
	None                           = 1,
	ERiddleActions__NumActions     = 2,
	None01                         = 3,
	ERiddleLocations__NotOnIsland  = 4
};


// Enum Athena.ERiddleActionLocationOffsets
enum class ERiddleActionLocationOffsets : uint8_t
{
	ERiddleActionLocationOffsets__PerformActionAtLocation = 0,
	None                           = 1
};


// Enum Athena.ERiddleLocations
enum class ERiddleLocations : uint8_t
{
	ERiddleLocations__NotOnIsland  = 0,
	None                           = 1,
	ERiddleLocations__Island       = 2,
	None01                         = 3,
	EContainerType__None           = 4
};


// Enum Athena.EDoorState
enum class EDoorState : uint8_t
{
	EDoorState__Closed             = 0,
	None                           = 1,
	EDoorState__EDoorState_MAX     = 2,
	ELoadableState__Unloaded       = 3
};


// Enum Athena.EActionDisplayPriority
enum class EActionDisplayPriority : uint8_t
{
	EActionDisplayPriority__Primary = 0,
	None                           = 1,
	EActionDisplayPriority__EActionDisplayPriority_MAX = 2,
	EAthenaNPCObjectSlot__Slot     = 3
};


// Enum Athena.ETreasureChestProxyState
enum class ETreasureChestProxyState : uint8_t
{
	ETreasureChestProxyState__Idle = 0,
	None                           = 1,
	EItemLoadoutDestroyBehaviour__DoNotDestroy = 2
};


// Enum Athena.EItemLoadoutDestroyBehaviour
enum class EItemLoadoutDestroyBehaviour : uint8_t
{
	EItemLoadoutDestroyBehaviour__DoNotDestroy = 0,
	None                           = 1
};


// Enum Athena.ECompassDirections
enum class ECompassDirections : uint8_t
{
	ECompassDirections__North      = 0,
	None                           = 1,
	ECompassDirections__East       = 2,
	None01                         = 3,
	ECompassDirections__South      = 4,
	None02                         = 5,
	StructProperty                 = 6,
	ECompassDirections__West       = 7,
	None03                         = 8,
	TextProperty                   = 9,
	ECompassDirections__NumDirections = 10,
	None04                         = 11,
	EPlayerMusicState__InCave      = 12,
	None05                         = 13,
	EPlayerMusicState__NoMusicState = 14
};


// Enum Athena.ELandmarkUniqueness
enum class ELandmarkUniqueness : uint8_t
{
	ELandmarkUniqueness__Unique    = 0,
	None                           = 1
};


// Enum Athena.ELandmarkVagueness
enum class ELandmarkVagueness : uint8_t
{
	ELandmarkVagueness__Vague      = 0,
	None                           = 1
};


// Enum Athena.EEventRunLocation
enum class EEventRunLocation : uint8_t
{
	EEventRunLocation__Client      = 0,
	None                           = 1,
	ELiquidType__Water             = 2
};


// Enum Athena.EContainerType
enum class EContainerType : uint8_t
{
	EContainerType__None           = 0,
	None                           = 1,
	IntProperty                    = 2,
	EContainerType__Total          = 3,
	None01                         = 4,
	EPurchaseRequestFailureReason__ServiceUnavailable = 5
};


// Enum Athena.ELiquidType
enum class ELiquidType : uint8_t
{
	ELiquidType__Water             = 0,
	None                           = 1
};


// Enum Athena.ELoadableState
enum class ELoadableState : uint8_t
{
	ELoadableState__Unloaded       = 0,
	None                           = 1,
	ELoadableState__ELoadableState_MAX = 2,
	EActionDisplayPriority__Primary = 3
};


// Enum Athena.ELoadoutPersistence
enum class ELoadoutPersistence : uint8_t
{
	ELoadoutPersistence__Temporary = 0,
	None                           = 1
};


// Enum Athena.ELPVAdaptationType
enum class ELPVAdaptationType : uint8_t
{
	ELPVAdaptationType__Full       = 0,
	None                           = 1,
	EMeleeWeaponMovementSpeed__Default = 2
};


// Enum Athena.EMeleeWeaponMovementSpeed
enum class EMeleeWeaponMovementSpeed : uint8_t
{
	EMeleeWeaponMovementSpeed__Default = 0,
	None                           = 1,
	EPlayerAbandoned__Yes          = 2
};


// Enum Athena.EMeleeAttackInterruptReason
enum class EMeleeAttackInterruptReason : uint8_t
{
	EMeleeAttackInterruptReason__Stopping = 0,
	None                           = 1
};


// Enum Athena.EPlayerAbandonedReason
enum class EPlayerAbandonedReason : uint8_t
{
	EPlayerAbandonedReason__None   = 0,
	None                           = 1,
	EPlayerAbandonedReason__OnShip = 2,
	None01                         = 3
};


// Enum Athena.EPlayerAbandoned
enum class EPlayerAbandoned : uint8_t
{
	EPlayerAbandoned__Yes          = 0,
	None                           = 1,
	EMeleeAttackInterruptReason__Stopping = 2
};


// Enum Athena.EShovelState
enum class EShovelState : uint8_t
{
	EShovelState__Idle             = 0,
	None                           = 1
};


// Enum Athena.EPossessionsChestType
enum class EPossessionsChestType : uint8_t
{
	EPossessionsChestType__Unknown = 0,
	None                           = 1,
	EPossessionsChestType__ArmoryChest = 2,
	None01                         = 3,
	NameProperty                   = 4
};


// Enum Athena.EAthenaNPCObjectSlot
enum class EAthenaNPCObjectSlot : uint8_t
{
	EAthenaNPCObjectSlot__Slot     = 0,
	BoolProperty                   = 1,
	EAthenaNPCObjectSlot__Slot_MAX = 2,
	EShopOfferAvailability__Available = 3
};


// Enum Athena.EAthenaNPCSpawnHand
enum class EAthenaNPCSpawnHand : uint8_t
{
	EAthenaNPCSpawnHand__Left      = 0,
	None                           = 1
};


// Enum Athena.EMockShipConnectionPartType
enum class EMockShipConnectionPartType : uint8_t
{
	EMockShipConnectionPartType__HoistToMast = 0,
	None                           = 1,
	EAthenaNPCSpawnHand__Left      = 2
};


// Enum Athena.ECompanyStatus
enum class ECompanyStatus : uint8_t
{
	ECompanyStatus__Invalid        = 0,
	None                           = 1,
	EEntitlementConsumptionState__Failed = 2
};


// Enum Athena.EMuteState
enum class EMuteState : uint8_t
{
	EMuteState__NotMuted           = 0,
	None                           = 1,
	EMuteState__NonVerbalMuted     = 2,
	None01                         = 3,
	EMuteState__EMuteState_MAX     = 4
};


// Enum Athena.EPlayerCurseTag
enum class EPlayerCurseTag : uint8_t
{
	EPlayerCurseTag__Limping       = 0,
	None                           = 1,
	EPlayerCurseTag__Dancing       = 2,
	None01                         = 3
};


// Enum Athena.ERequestEntitlementBehaviour
enum class ERequestEntitlementBehaviour : uint8_t
{
	ERequestEntitlementBehaviour__Default = 0,
	None                           = 1
};


// Enum Athena.EEntitlementConsumptionState
enum class EEntitlementConsumptionState : uint8_t
{
	EEntitlementConsumptionState__Failed = 0,
	None                           = 1,
	EStickinessType__DontStick     = 2
};


// Enum Athena.EStickinessType
enum class EStickinessType : uint8_t
{
	EStickinessType__DontStick     = 0,
	None                           = 1,
	IntProperty                    = 2,
	EWalletBalanceStatus__Unknown  = 3
};


// Enum Athena.ENotificationType
enum class ENotificationType : uint8_t
{
	ENotificationType__Chat        = 0,
	None                           = 1
};


// Enum Athena.EWalletBalanceStatus
enum class EWalletBalanceStatus : uint8_t
{
	EWalletBalanceStatus__Unknown  = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EProjectileWeaponFireType
enum class EProjectileWeaponFireType : uint8_t
{
	EProjectileWeaponFireType__Aiming = 0,
	None                           = 1,
	EShadowAIFormState__Invalid    = 2
};


// Enum Athena.EProjectileWeaponState
enum class EProjectileWeaponState : uint8_t
{
	EProjectileWeaponState__Idle   = 0,
	None                           = 1,
	EProjectileWeaponState__EProjectileWeaponState_MAX = 2,
	EShipPartCustomizationState__Idle = 3
};


// Enum Athena.ERewardRequestFailureReason
enum class ERewardRequestFailureReason : uint8_t
{
	ERewardRequestFailureReason__FailedToProcess = 0,
	None                           = 1,
	IntProperty                    = 2,
	EProjectileWeaponFireType__Aiming = 3
};


// Enum Athena.ERewardType
enum class ERewardType : uint8_t
{
	ERewardType__XP                = 0,
	None                           = 1,
	ERewardType__WaywardTokens     = 2,
	None01                         = 3
};


// Enum Athena.EShadowAIFormState
enum class EShadowAIFormState : uint8_t
{
	EShadowAIFormState__Invalid    = 0,
	None                           = 1,
	EShipBuilderState__Idle        = 2
};


// Enum Athena.ESharkType
enum class ESharkType : uint8_t
{
	ESharkType__Normal             = 0,
	None                           = 1
};


// Enum Athena.EShipBuilderState
enum class EShipBuilderState : uint8_t
{
	EShipBuilderState__Idle        = 0,
	None                           = 1,
	ESharkType__Normal             = 2
};


// Enum Athena.EShipBuilderErrorCode
enum class EShipBuilderErrorCode : uint8_t
{
	EShipBuilderErrorCode__AlreadyInProgress = 0,
	None                           = 1,
	EShipBuilderErrorCode__InvalidParameter = 2,
	None01                         = 3,
	EShipBuilderErrorCode__EShipBuilderErrorCode_MAX = 4,
	EMuteState__NotMuted           = 5,
	None02                         = 6
};


// Enum Athena.EShipHullDamageType
enum class EShipHullDamageType : uint8_t
{
	EShipHullDamageType__Landscape = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EShipPartCustomizationState
enum class EShipPartCustomizationState : uint8_t
{
	EShipPartCustomizationState__Idle = 0,
	None                           = 1,
	EShipPartCustomizationState__EShipPartCustomizationState_MAX = 2,
	EMurkWaterModifierZoneState__Active = 3
};


// Enum Athena.EShipParticleParam
enum class EShipParticleParam : uint8_t
{
	EShipParticleParam__None       = 0,
	None                           = 1,
	EShipParticleParam__EShipParticleParam_MAX = 2,
	EProjectileWeaponState__Idle   = 3
};


// Enum Athena.EPurchaseRequestFailureReason
enum class EPurchaseRequestFailureReason : uint8_t
{
	EPurchaseRequestFailureReason__ServiceUnavailable = 0,
	None                           = 1,
	EPurchaseRequestFailureReason__PurchaseAlreadyPending = 2,
	None01                         = 3,
	EBucketState__Idle             = 4
};


// Enum Athena.EShopOfferAvailability
enum class EShopOfferAvailability : uint8_t
{
	EShopOfferAvailability__Available = 0,
	None                           = 1,
	EShopOfferAvailability__EShopOfferAvailability_MAX = 2,
	EShipParticleParam__None       = 3
};


// Enum Athena.EStaggerReason
enum class EStaggerReason : uint8_t
{
	EStaggerReason__Drunk          = 0,
	None                           = 1
};


// Enum Athena.ELightningHitTarget
enum class ELightningHitTarget : uint8_t
{
	ELightningHitTarget__RandomLocation = 0,
	None                           = 1,
	ELightningHitTarget__ShipNearMiss = 2,
	None01                         = 3
};


// Enum Athena.EStunAnimationType
enum class EStunAnimationType : uint8_t
{
	EStunAnimationType__None       = 0,
	None                           = 1,
	EInteractableOverlayActionType__None = 2
};


// Enum Athena.ESwimmingMode
enum class ESwimmingMode : uint8_t
{
	ESwimmingMode__SwimmingMode_None = 0,
	None                           = 1,
	ECompanyStatus__Invalid        = 2
};


// Enum Athena.EStepsTriggerState
enum class EStepsTriggerState : uint8_t
{
	EStepsTriggerState__Closed     = 0,
	None                           = 1,
	ETeleportActionStateConditions__AllConditions = 2
};


// Enum Athena.ETeleportActionStateConditions
enum class ETeleportActionStateConditions : uint8_t
{
	ETeleportActionStateConditions__AllConditions = 0,
	None                           = 1
};


// Enum Athena.ETeleportActionStateFadeType
enum class ETeleportActionStateFadeType : uint8_t
{
	ETeleportActionStateFadeType__Fade = 0,
	None                           = 1
};


// Enum Athena.EChestEntitlementActionType
enum class EChestEntitlementActionType : uint8_t
{
	EChestEntitlementActionType__Equip = 0,
	None                           = 1,
	EChestEntitlementActionType__EChestEntitlementActionType_MAX = 2,
	EThrowableLiquidType__Empty    = 3
};


// Enum Athena.EVoyageDisplayState
enum class EVoyageDisplayState : uint8_t
{
	Default                        = 0,
	None                           = 1
};


// Enum Athena.EMurkWaterModifierZoneState
enum class EMurkWaterModifierZoneState : uint8_t
{
	EMurkWaterModifierZoneState__Active = 0,
	None                           = 1,
	EMurkWaterModifierZoneState__EMurkWaterModifierZoneState_MAX = 2,
	EQuestStatus__Pending          = 3
};


// Enum Athena.EWeepingState
enum class EWeepingState : uint8_t
{
	EWeepingState__Weeping         = 0,
	None                           = 1
};


// Enum Athena.EThrowableLiquidType
enum class EThrowableLiquidType : uint8_t
{
	EThrowableLiquidType__Empty    = 0,
	None                           = 1,
	EThrowableLiquidType__EThrowableLiquidType_MAX = 2
};


// Enum Athena.EBucketState
enum class EBucketState : uint8_t
{
	EBucketState__Idle             = 0,
	None                           = 1,
	EBucketState__Pad              = 2,
	None01                         = 3,
	EBootflowErrorPriority__High   = 4
};


// Enum Athena.EFruitState
enum class EFruitState : uint8_t
{
	EFruitState__Idle              = 0,
	None                           = 1,
	IntProperty                    = 2,
	EAthenaAnimationPetSpawnState__Null = 3
};


// Enum Athena.EMeleeWeaponAttackType
enum class EMeleeWeaponAttackType : uint8_t
{
	EMeleeWeaponAttackType__Combo  = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EAthenaAnimationPetRoamingState
enum class EAthenaAnimationPetRoamingState : uint8_t
{
	EAthenaAnimationPetRoamingState__Idle = 0,
	None                           = 1,
	EAthenaAnimationPetRoamingState__FlyCannon = 2,
	None01                         = 3,
	EAthenaAnimationPetRoamingState__Happy = 4,
	None02                         = 5,
	EAthenaAnimationPetRoamingState__Cleaning = 6,
	None03                         = 7,
	TextProperty                   = 8,
	EAthenaAnimationPetRoamingState__Inactive = 9,
	None04                         = 10,
	ECompassDirections__North      = 11,
	None05                         = 12,
	ECompassDirections__East       = 13
};


// Enum Athena.EAthenaAnimationPetHeldState
enum class EAthenaAnimationPetHeldState : uint8_t
{
	EAthenaAnimationPetHeldState__Idle = 0,
	None                           = 1,
	EAthenaAnimationPetHeldState__Angry = 2,
	None01                         = 3,
	EAthenaAnimationPetHeldState__Inactive = 4,
	None02                         = 5,
	ECarouselPirateBodyshapeDirection__None = 6,
	None03                         = 7
};


// Enum Athena.EAthenaAnimationPetSpawnState
enum class EAthenaAnimationPetSpawnState : uint8_t
{
	EAthenaAnimationPetSpawnState__Null = 0,
	None                           = 1,
	EMeleeWeaponAttackType__Combo  = 2
};


// Enum Athena.EAthenaAISpawnEventType
enum class EAthenaAISpawnEventType : uint8_t
{
	EAthenaAISpawnEventType__SpawnOnLand = 0,
	None                           = 1,
	EVoiceChatAudioDevice__None    = 2
};


// Enum Athena.ELocalGameChatStatus
enum class ELocalGameChatStatus : uint8_t
{
	ELocalGameChatStatus__Undefined = 0,
	None                           = 1,
	ELocalGameChatStatus__Ready    = 2,
	None01                         = 3,
	ERiddleActions__RaiseLanternAnyone = 4
};


// Enum Athena.EVoiceChatAudioDevice
enum class EVoiceChatAudioDevice : uint8_t
{
	EVoiceChatAudioDevice__None    = 0,
	None                           = 1,
	EVoyageChapterProgressionType__DrivenByAnyQuestCompletion = 2
};


// Enum Athena.EBootflowError
enum class EBootflowError : uint8_t
{
	EBootflowError__None           = 0,
	None                           = 1,
	EBootflowError__AthenaGameInstanceActiveConnectionToServerTimedOut = 2,
	None01                         = 3,
	EBootflowError__AthenaGameInstanceGameVersionMismatch = 4,
	None02                         = 5,
	EBootflowError__AthenaGameInstanceRPCSpamDetected = 6,
	None03                         = 7,
	EBootflowError__ClientBootflowPrimaryPlayerSignedOut = 8,
	None04                         = 9,
	EBootflowError__ClientEvicted  = 10,
	None05                         = 11,
	EBootflowError__ClientInGameStateStopMatchmakingFailed = 12,
	None06                         = 13,
	EBootflowError__CrewMatchmakingStateUnableToObtainLocalPlayerInterface = 14,
	None07                         = 15,
	EBootflowError__CrewSessionStateFailedToCreateCrewSession = 16,
	None08                         = 17,
	EBootflowError__EngageStateInviteHadInvalidControllerId = 18,
	None09                         = 19,
	EBootflowError__LoadLevelStateTimeout = 20,
	None10                         = 21,
	EBootflowError__LoginTokenExchangeFailedCannotRefreshExpiredToken = 22,
	None11                         = 23,
	EBootflowError__SelectUserStateFailedToObtainValidLocalPlayer = 24,
	None12                         = 25,
	EBootflowError__SelectUserStateUserDidNotSignIn = 26,
	None13                         = 27,
	EBootflowError__ServerMatchmakingStateSandboxDisabled = 28,
	None14                         = 29,
	EBootflowError__ServerMatchmakingStateNoServersAvailable = 30,
	None15                         = 31,
	EBootflowError__ServerMatchmakingStateUnexpectedResult = 32,
	None16                         = 33,
	EBootflowError__SetupCrewSessionStateFailedToCreateCrewSession = 34,
	None17                         = 35,
	EBootflowError__CrewSessionHandlerJoinFailedAsCrewDoesntExist = 36,
	None18                         = 37,
	EBootflowError__PirateSelectionStateUnableToRetrievePirates = 38,
	None19                         = 39,
	EBootflowError__InviteUnableToRetrieveSession = 40,
	None20                         = 41,
	EBootflowError__TestFailed     = 42,
	None21                         = 43,
	DrawDebugFrustum               = 44,
	RotatorProperty                = 45,
	DrawDebugPlane                 = 46,
	TextProperty                   = 47,
	BeginDebugFrameSave            = 48,
	CreateDataModelFromStruct      = 49,
	DebugSaveNextFrame             = 50,
	EndDebugFrameSave              = 51,
	HasRequestedView               = 52
};


// Enum Athena.EBootflowErrorPriority
enum class EBootflowErrorPriority : uint8_t
{
	EBootflowErrorPriority__High   = 0,
	None                           = 1,
	EBootflowErrorPriority__Low    = 2,
	None01                         = 3,
	EStoreAsyncResult__Unknown     = 4
};


// Enum Athena.EStoreAsyncResult
enum class EStoreAsyncResult : uint8_t
{
	EStoreAsyncResult__Unknown     = 0,
	None                           = 1,
	EStoreAsyncResult__Success     = 2,
	None01                         = 3
};


// Enum Athena.EMeleeAttackMoveCorrectionReason
enum class EMeleeAttackMoveCorrectionReason : uint8_t
{
	EMeleeAttackMoveCorrectionReason__NotSpecified = 0,
	None                           = 1
};


// Enum Athena.EInteractableOverlayActionType
enum class EInteractableOverlayActionType : uint8_t
{
	EInteractableOverlayActionType__None = 0,
	None                           = 1,
	IntProperty                    = 2
};


// Enum Athena.EServerAsyncLoadingAckReason
enum class EServerAsyncLoadingAckReason : uint8_t
{
	EServerAsyncLoadingAckReason__Invalid = 0,
	None                           = 1,
	EServerTeleportAckReason__Invalid = 2
};


// Enum Athena.EServerTeleportAckReason
enum class EServerTeleportAckReason : uint8_t
{
	EServerTeleportAckReason__Invalid = 0,
	None                           = 1,
	EInteractableState__Interactable = 2
};


// Enum Athena.EInteractableState
enum class EInteractableState : uint8_t
{
	EInteractableState__Interactable = 0,
	None                           = 1,
	ECrewDestroyedReason__AllCrewMembersRemoved = 2
};


// Enum Athena.EServerCameraFadeAckReason
enum class EServerCameraFadeAckReason : uint8_t
{
	EServerCameraFadeAckReason__Invalid = 0,
	None                           = 1,
	EPlayerStatsType__Int          = 2
};


// Enum Athena.EPlayerStatsType
enum class EPlayerStatsType : uint8_t
{
	EPlayerStatsType__Int          = 0,
	None                           = 1
};


// Enum Athena.ECrewDestroyedReason
enum class ECrewDestroyedReason : uint8_t
{
	ECrewDestroyedReason__AllCrewMembersRemoved = 0,
	None                           = 1
};


// Enum Athena.EQuestGenAssetSuffix
enum class EQuestGenAssetSuffix : uint8_t
{
	EQuestGenAssetSuffix__Default  = 0,
	None                           = 1,
	EPurchaseOfferFailureReason__ServiceUnavailable = 2
};


// Enum Athena.EConsumeEntitlementFailureReason
enum class EConsumeEntitlementFailureReason : uint8_t
{
	EConsumeEntitlementFailureReason__ServiceUnavailable = 0,
	None                           = 1,
	EQuestGenAssetSuffix__Default  = 2
};


// Enum Athena.EPurchaseOfferFailureReason
enum class EPurchaseOfferFailureReason : uint8_t
{
	EPurchaseOfferFailureReason__ServiceUnavailable = 0,
	None                           = 1,
	EWalletBalanceRequestFailureReason__ServiceUnavailable = 2
};


// Enum Athena.EWalletBalanceRequestFailureReason
enum class EWalletBalanceRequestFailureReason : uint8_t
{
	EWalletBalanceRequestFailureReason__ServiceUnavailable = 0,
	None                           = 1,
	ETestTelemetryJsonSchemaWriterUEnum__None = 2
};


// Enum Athena.EServerMatchmakingFailureReason
enum class EServerMatchmakingFailureReason : uint8_t
{
	EServerMatchmakingFailureReason__NoServersAvailable = 0,
	None                           = 1,
	EServerMatchmakingFailureReason__EServerMatchmakingFailureReason_MAX = 2
};


// Enum Athena.EPreLoginDeniedReason
enum class EPreLoginDeniedReason : uint8_t
{
	EPreLoginDeniedReason__None    = 0,
	None                           = 1,
	EPreLoginDeniedReason__CrewNoLongerOnServer = 2,
	None01                         = 3
};


// Enum Athena.ETestTelemetryJsonSchemaWriterUEnum
enum class ETestTelemetryJsonSchemaWriterUEnum : uint8_t
{
	ETestTelemetryJsonSchemaWriterUEnum__None = 0,
	None                           = 1,
	ETooltipHighlightType__Active  = 2
};


// Enum Athena.EStyleModifiers
enum class EStyleModifiers : uint8_t
{
	EStyleModifiers__Hide          = 0,
	None                           = 1
};


// Enum Athena.ETooltipHighlightType
enum class ETooltipHighlightType : uint8_t
{
	ETooltipHighlightType__Active  = 0,
	None                           = 1,
	ETooltipSpinnerType__None      = 2
};


// Enum Athena.ETooltipSpinnerType
enum class ETooltipSpinnerType : uint8_t
{
	ETooltipSpinnerType__None      = 0,
	None                           = 1
};


// Enum Athena.EQuestResultFromDig
enum class EQuestResultFromDig : uint8_t
{
	EQuestResultFromDig__None      = 0,
	None                           = 1,
	EIPGPirateType__PLAYER         = 2
};


// Enum Athena.EQuestStatus
enum class EQuestStatus : uint8_t
{
	EQuestStatus__Pending          = 0,
	None                           = 1,
	EQuestStatus__EQuestStatus_MAX = 2,
	EChestEntitlementActionType__Equip = 3
};


// Enum Athena.EVoyageChapterProgressionType
enum class EVoyageChapterProgressionType : uint8_t
{
	EVoyageChapterProgressionType__DrivenByAnyQuestCompletion = 0,
	None                           = 1
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Athena.ControlObjectActionRuleParams
// 0x0010
struct FControlObjectActionRuleParams
{
	TArray<TEnumAsByte<EWieldableItemSize>>            WieldableItemSizesToDisableControl;                       // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.IntentPredictorParams
// 0x0014
struct FIntentPredictorParams
{
	float                                              MaxError;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinError;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinCorrectionVelocity;                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinValue;                                                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxValue;                                                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.IntentPredictor
// 0x0018
struct FIntentPredictor
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	struct FIntentPredictorParams                      Params;                                                   // 0x0004(0x0014) (Edit)
};

// ScriptStruct Athena.PlayerStat
// 0x0010
struct FPlayerStat
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.AchievementCriteria
// 0x0020
struct FAchievementCriteria
{
	struct FPlayerStat                                 PlayerStat;                                               // 0x0000(0x0010) (Edit)
	uint64_t                                           Threshold;                                                // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EPlayerStatsOperator>                  Operator;                                                 // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.AchievementDefinition
// 0x0020
struct FAchievementDefinition
{
	struct FName                                       DevCenterId;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       FriendlyName;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FAchievementCriteria>                UnlockCriteria;                                           // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.SkeletonAudioEvents
// 0x0020
struct FSkeletonAudioEvents
{
	class UWwiseEvent*                                 PlayLoop;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 StopLoop;                                                 // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 StartOneShot;                                             // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 LeaveOneShot;                                             // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.SkeletonAICharacterItemSpecificAudioEvents
// 0x0030
struct FSkeletonAICharacterItemSpecificAudioEvents
{
	TArray<class UClass*>                              ItemCategories;                                           // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FSkeletonAudioEvents                        Events;                                                   // 0x0010(0x0020) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.SkeletonAICharacterStrategyAudioEvents
// 0x0038
struct FSkeletonAICharacterStrategyAudioEvents
{
	class UClass*                                      AIStrategy;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FSkeletonAudioEvents                        DefaultEvents;                                            // 0x0008(0x0020) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FSkeletonAICharacterItemSpecificAudioEvents> ItemSpecificEventOverrides;                               // 0x0028(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.ReplicatedAIPartsData
// 0x0010
struct FReplicatedAIPartsData
{
	class UAIPartsCategory*                            PartsCategory;                                            // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                MeshIndex;                                                // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TeamColorIndex;                                           // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AlliancePennantData
// 0x0010
struct FAlliancePennantData
{
	class UStaticMesh*                                 PennantMesh;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UPopUpMessageDesc*                           PopUpDescAllianceJoined;                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.LookAtOffset
// 0x00D8
struct FLookAtOffset
{
	float                                              LookAtPitchRate;                                          // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LookAtYawRate;                                            // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LookAtYawRawScale;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LookAtPitchRawScale;                                      // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0010(0x00C8) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationLocomotion
// 0x0040
struct FAthenaAnimationLocomotion
{
	struct FVector                                     CharacterVelocity;                                        // 0x0000(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WantedMovementSpeed;                                      // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CharacterMoving;                                          // 0x0010(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RunStopWanted;                                            // 0x0011(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	float                                              TurnRate;                                                 // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentYaw;                                               // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentDirection;                                         // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               TurningActive;                                            // 0x0020(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               TurningLeft;                                              // 0x0021(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsSwimming;                                               // 0x0022(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnderwaterSwimming;                                     // 0x0023(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MinimumMoveSpeedToTriggerRunStop;                         // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InterpSpeed;                                              // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TurnRateToDisableTurns;                                   // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0030(0x0010) MISSED OFFSET
};

// ScriptStruct Athena.WieldAnimationParams
// 0x0040
struct FWieldAnimationParams
{
	TEnumAsByte<EWieldAnimationLocation>               WieldLocation;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0001(0x000F) MISSED OFFSET
	struct FTransform                                  PropOffset;                                               // 0x0010(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectLocomotionAnimations
// 0x0038
struct FAthenaAnimationObjectLocomotionAnimations
{
	class UBlendSpace*                                 Locomotion1;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion2;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion3;                                              // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Locomotion4;                                              // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningLeft;                                    // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningRight;                                   // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LocomotionSwimming;                                       // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimations
// 0x0020
struct FAthenaAnimationObjectJumpingAnimations
{
	class UBlendSpace*                                 Start;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Cycle;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 PreImpact;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LandLight;                                                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectEquipAnimations
// 0x0028
struct FAthenaAnimationObjectEquipAnimations
{
	class UAnimSequence*                               Equip;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 EquipSwimming;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               UnEquip;                                                  // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Pickup;                                                   // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Drop;                                                     // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectIdleAnimations
// 0x0018
struct FAthenaAnimationObjectIdleAnimations
{
	class UAnimSequence*                               Idle1;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Idle2;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Idle3;                                                    // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShot
// 0x0030
struct FAthenaAnimationObjectActionOneShot
{
	TArray<class UAnimSequence*>                       MainAction;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               MainFail;                                                 // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       AlternateAction;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               AlternateFail;                                            // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousSwimming
// 0x0020
struct FAthenaAnimationObjectActionContinuousSwimming
{
	class UBlendSpace*                                 MainInSwimming;                                           // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainOneShotInSwimming;                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainCycleSwimming;                                        // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainOutSwimming;                                          // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLocomotionTurningAnimData
// 0x0008
struct FAthenaAnimationLocomotionTurningAnimData
{
	class UAnimSequence*                               Turn90;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStruct
// 0x0090
struct FAthenaAnimationObjectActionContinuousStruct
{
	class UAnimSequence*                               MainInto;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               OneShotInto;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               MainCycleIdle;                                            // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainCycleLocomotion;                                      // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               UseMainCycleJump;                                         // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectJumpingAnimations     MainCycleJump;                                            // 0x0028(0x0020) (Edit, BlueprintVisible)
	class UAnimSequence*                               MainOutOf;                                                // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               MainFail;                                                 // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x0058(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningLeftAlt;                                           // 0x0078(0x0008) (Edit, BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningRightAlt;                                          // 0x0080(0x0008) (Edit, BlueprintVisible)
	class UAnimSequence*                               TurnOutAlt;                                               // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuous
// 0x0120
struct FAthenaAnimationObjectActionContinuous
{
	struct FAthenaAnimationObjectActionContinuousStruct MainContinuousActions;                                    // 0x0000(0x0090) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousStruct AlternateContinuousActions;                               // 0x0090(0x0090) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShotPitchOverride
// 0x0030
struct FAthenaAnimationObjectActionOneShotPitchOverride
{
	TArray<class UBlendSpace1D*>                       MainAction;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UBlendSpace1D*                               MainFail;                                                 // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace1D*>                       AlternateAction;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UBlendSpace1D*                               AlternateFail;                                            // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimationsPitchOverride
// 0x0020
struct FAthenaAnimationObjectJumpingAnimationsPitchOverride
{
	class UBlendSpace1D*                               Start;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               Cycle;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               PreImpact;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               LandLight;                                                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStructPitchOverride
// 0x0080
struct FAthenaAnimationObjectActionContinuousStructPitchOverride
{
	class UBlendSpace1D*                               MainInto;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainCycleIdle;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainCycleLocomotion;                                      // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace1D*>                       VariantCycleIdle;                                         // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               UseMainCycleJump;                                         // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride MainCycleJump;                                            // 0x0030(0x0020) (Edit, BlueprintVisible)
	class UBlendSpace1D*                               MainOutOf;                                                // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               MainFail;                                                 // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x0060(0x0020) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousPitchOverride
// 0x0100
struct FAthenaAnimationObjectActionContinuousPitchOverride
{
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride MainContinuousActions;                                    // 0x0000(0x0080) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride AlternateContinuousActions;                               // 0x0080(0x0080) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectComplexOneShot
// 0x0028
struct FAthenaAnimationObjectComplexOneShot
{
	class UAnimSequence*                               WarmUp;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               WarmUpFromBlock;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Action;                                                   // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Recover;                                                  // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               HeavyAttackStunRecover;                                   // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectMeleeV2
// 0x0128
struct FAthenaAnimationObjectMeleeV2
{
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacks;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacksStatic;                                       // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> SwimmingComboAttacks;                                     // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FAthenaAnimationObjectComplexOneShot        HeavyAttack;                                              // 0x0030(0x0028) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectComplexOneShot        SwimmingHeavyAttack;                                      // 0x0058(0x0028) (Edit, BlueprintVisible)
	class UAnimSequence*                               BlockingMainInto;                                         // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               BlockingIntoFromCombat;                                   // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpace;                                   // 0x0090(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequences;                                // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               BlockingOut;                                              // 0x00A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               BlockingMainIntoSwimming;                                 // 0x00B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpaceSwimming;                           // 0x00B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequencesSwimming;                        // 0x00C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               BlockingOutSwimming;                                      // 0x00D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationObjectJumpingAnimations     BlockingJump;                                             // 0x00D8(0x0020) (Edit, BlueprintVisible)
	class UBlendSpace*                                 CombatLocomotion;                                         // 0x00F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningLeft;                              // 0x0100(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningRight;                             // 0x0108(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurnOut;                                  // 0x0110(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 Dodge;                                                    // 0x0118(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LungeWarmupLocomotion;                                    // 0x0120(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectFacial
// 0x0070
struct FAthenaAnimationObjectFacial
{
	TArray<class UAnimMontage*>                        PrimaryContinuous;                                        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryContinuous;                                      // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        PrimaryOneShot;                                           // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryOneShot;                                         // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeBlocking;                                            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeAttack;                                              // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeBlockReact;                                          // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotion
// 0x0010
struct FAthenaAnimationSkeletonKnockbackLocomotion
{
	class UAnimSequence*                               Forwards;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Backwards;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotionStrength
// 0x0020
struct FAthenaAnimationSkeletonKnockbackLocomotionStrength
{
	struct FAthenaAnimationSkeletonKnockbackLocomotion LowStrength;                                              // 0x0000(0x0010) (Edit, BlueprintVisible)
	struct FAthenaAnimationSkeletonKnockbackLocomotion HighStrength;                                             // 0x0010(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationCoreObjectAnimations
// 0x0890
struct FAthenaAnimationCoreObjectAnimations
{
	struct FAthenaAnimationObjectLocomotionAnimations  Locomotion;                                               // 0x0000(0x0038) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectLocomotionAnimations  AlternateLocomotion;                                      // 0x0038(0x0038) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     Jumping;                                                  // 0x0070(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     AlternateJumping;                                         // 0x0090(0x0020) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectEquipAnimations       Equipping;                                                // 0x00B0(0x0028) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        Idles;                                                    // 0x00D8(0x0018) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        AlternateIdles;                                           // 0x00F0(0x0018) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionPrimarySingle;                                      // 0x0108(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionPrimaryContinuous;                                  // 0x0138(0x0120) (Edit, BlueprintVisible)
	bool                                               PrimaryActionPitchOverride;                               // 0x0258(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0259(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionPrimarySinglePitchOverride;                         // 0x0260(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionPrimaryContinuousPitchOverride;                     // 0x0290(0x0100) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionSecondarySingle;                                    // 0x0390(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionSecondaryContinuous;                                // 0x03C0(0x0120) (Edit, BlueprintVisible)
	bool                                               SecondaryActionPitchOverride;                             // 0x04E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x04E1(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionSecondarySinglePitchOverride;                       // 0x04E8(0x0030) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionSecondaryContinuousPitchOverride;                   // 0x0518(0x0100) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectMeleeV2               MeleeV2;                                                  // 0x0618(0x0128) (Edit, BlueprintVisible)
	class UAnimSequence*                               HandAdditive;                                             // 0x0740(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0748(0x0008) MISSED OFFSET
	struct FTransform                                  OffsetLeftHand;                                           // 0x0750(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FTransform                                  OffsetRightHand;                                          // 0x0780(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FWieldAnimationParams                       Params;                                                   // 0x07B0(0x0040) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectFacial                Facial;                                                   // 0x07F0(0x0070) (Edit, BlueprintVisible)
	bool                                               RangedWeapon;                                             // 0x0860(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0861(0x0007) MISSED OFFSET
	struct FAthenaAnimationSkeletonKnockbackLocomotionStrength KnockBack;                                                // 0x0868(0x0020) (Edit, BlueprintVisible)
	class UAnimSequence*                               ScreamStun;                                               // 0x0888(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectTargetingOptions
// 0x003C
struct FAthenaAnimationObjectTargetingOptions
{
	TEnumAsByte<EObjectPitchTargetingLimbs>            ArmSelection;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              UpperClampTargetingAngle;                                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LowerClampTargetingAngle;                                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShoulderInfluenceUpper;                                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShoulderInfluenceLower;                                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetUpper;                                  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetLower;                                  // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               LockHandOrientation;                                      // 0x002C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FVector                                     VirtualPivotOffsetLerped;                                 // 0x0030(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationPitchControlStates
// 0x0168
struct FAthenaAnimationPitchControlStates
{
	struct FAthenaAnimationObjectTargetingOptions      StandardPassive;                                          // 0x0000(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      StandardWater;                                            // 0x003C(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1;                                                  // 0x0078(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1Water;                                             // 0x00B4(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action2;                                                  // 0x00F0(0x003C) (Edit, BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action2Water;                                             // 0x012C(0x003C) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelay
// 0x000C
struct FAthenaAnimationFirstPersonTurnDelay
{
	float                                              MaxAngle;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DelayOutSpeed;                                            // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DelayInSpeed;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelayStates
// 0x0020
struct FAthenaAnimationFirstPersonTurnDelayStates
{
	struct FAthenaAnimationFirstPersonTurnDelay        PassiveState;                                             // 0x0000(0x000C) (Edit, BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelay        ContinuousUse;                                            // 0x000C(0x000C) (Edit, BlueprintVisible)
	float                                              TurnDelayAngle;                                           // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              InvTurnDelayAngle;                                        // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLoadObjectsWrapper
// 0x0A20
struct FAthenaAnimationLoadObjectsWrapper
{
	struct FAthenaAnimationCoreObjectAnimations        ObjectAnimation;                                          // 0x0000(0x0890) (Edit, BlueprintVisible)
	struct FAthenaAnimationPitchControlStates          ObjectTargeting3rdPerson;                                 // 0x0890(0x0168) (Edit, BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelayStates  FirstPersonTurnDelay;                                     // 0x09F8(0x0020) (Edit, BlueprintVisible)
	class UClass*                                      ObjectID;                                                 // 0x0A18(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationHandHeldItemParams
// 0x0020
struct FAthenaAnimationHandHeldItemParams
{
	bool                                               LeftArmOverlayActive;                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               RightArmOverlayActive;                                    // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               UpperBodyOverlayActive;                                   // 0x0002(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               FullBodyOverlayActive;                                    // 0x0003(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SpineOverlayActive;                                       // 0x0004(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SpineLockActive;                                          // 0x0005(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ObjectActive;                                             // 0x0006(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ObjectOverrideStateActive;                                // 0x0007(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class FString                                      OverlayAnimationName;                                     // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
	TEnumAsByte<EItemPassiveState>                     ObjectPassiveState;                                       // 0x0018(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               QuickStow;                                                // 0x0019(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Reload;                                                   // 0x001A(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x001B(0x0005) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationIdleVariantChange
// 0x0010
struct FAthenaAnimationIdleVariantChange
{
	float                                              CurrentTime;                                              // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TriggerTime;                                              // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VariantID;                                                // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               VariantCompleted;                                         // 0x000C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.HandOnWheelAnimationRanges
// 0x0040
struct FHandOnWheelAnimationRanges
{
	struct FFloatRange                                 LeftHandOnWheelA;                                         // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 LeftHandOnWheelB;                                         // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightHandOnWheelA;                                        // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightHandOnWheelB;                                        // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.WheelIKActivationRanges
// 0x0040
struct FWheelIKActivationRanges
{
	struct FFloatRange                                 LeftArmDownRangeA;                                        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 LeftArmDownRangeB;                                        // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightArmDownRangeA;                                       // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 RightArmDownRangeB;                                       // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationWheel
// 0x01D0
struct FAthenaAnimationWheel
{
	struct FSocketId                                   LeftHandMaleSocket;                                       // 0x0000(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandMaleSocket;                                      // 0x0020(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   LeftHandFemaleSocket;                                     // 0x0040(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandFemaleSocket;                                    // 0x0060(0x0020) (Edit, DisableEditOnInstance)
	float                                              TranslationStrength;                                      // 0x0080(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationStrength;                                         // 0x0084(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x0088(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x008C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FHandOnWheelAnimationRanges                 HandOnWheelAnimationRanges;                               // 0x0090(0x0040) (Edit, DisableEditOnInstance)
	struct FWheelIKActivationRanges                    WheelArmIKDownWithinRange;                                // 0x00D0(0x0040) (Edit, DisableEditOnInstance)
	TEnumAsByte<EWheelAnimationType>                   WheelAnimationType;                                       // 0x0110(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0111(0x0003) MISSED OFFSET
	float                                              WheelTime;                                                // 0x0114(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WheelDirection;                                           // 0x0118(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RightFingerAlpha;                                         // 0x011C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LeftFingerAlpha;                                          // 0x0120(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0124(0x0004) MISSED OFFSET
	bool                                               LeftWheelArmDown;                                         // 0x0128(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RightWheelArmDown;                                        // 0x0129(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x012A(0x0006) MISSED OFFSET
	class AActor*                                      ControlledObject;                                         // 0x0130(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x98];                                      // 0x0138(0x0098) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationCapstan
// 0x0158
struct FAthenaAnimationCapstan
{
	float                                              IntentInterpSpeed;                                        // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   CapstanAngularVelocityRange;                              // 0x0004(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   AnimationRemapSpeedRange;                                 // 0x000C(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AngularVelocityInterpSpeed;                               // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FSocketId                                   LeftHandMaleSocket;                                       // 0x0018(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandMaleSocket;                                      // 0x0038(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   LeftHandFemaleSocket;                                     // 0x0058(0x0020) (Edit, DisableEditOnInstance)
	struct FSocketId                                   RightHandFemaleSocket;                                    // 0x0078(0x0020) (Edit, DisableEditOnInstance)
	float                                              TranslationStrength;                                      // 0x0098(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationStrength;                                         // 0x009C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x00A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x00A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AnimationOverride;                                        // 0x00A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EAthenaAnimationCapstanState>          CapstanState;                                             // 0x00A9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x00AA(0x0002) MISSED OFFSET
	float                                              AngularVelocityWanted;                                    // 0x00AC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ControlledObject;                                         // 0x00B0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xA0];                                      // 0x00B8(0x00A0) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationControllableFacialAnimData
// 0x0028
struct FAthenaAnimationControllableFacialAnimData
{
	class UBlendSpace1D*                               Capstan;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SailAction;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SailIdle;                                                 // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CannonFire;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CannonAim;                                                // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationFacialAnimData
// 0x0080
struct FAthenaAnimationFacialAnimData
{
	int                                                FacialIdleAnimationIndex0;                                // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FacialIdleAnimationIndex1;                                // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       IdleAnimations;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               Death;                                                    // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               HitReact;                                                 // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationControllableFacialAnimData  Controllables;                                            // 0x0028(0x0028) (Edit, BlueprintVisible)
	class UAnimMontage*                                Sick;                                                     // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Cough;                                                    // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               UnderwaterIdle;                                           // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                CurrentFacialMontage;                                     // 0x0068(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                PlayingFacialMontage;                                     // 0x0070(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFacialPriority>                       CurrentFacialPriority;                                    // 0x0078(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0079(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationRowingBoatAnimations
// 0x0020
struct FAthenaAnimationRowingBoatAnimations
{
	class UAnimSequence*                               RowBoatAnimationInto;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               RowBoatAnimationOutOf;                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               RowBoatAnimationIdle;                                     // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 RowBoatAnimationMovement;                                 // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationRowingBoatParams
// 0x0028
struct FAthenaAnimationRowingBoatParams
{
	float                                              RowBoatSpeed;                                             // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RowBoatTurnAngle;                                         // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationRowingBoatAnimations        RowBoatAnimations;                                        // 0x0008(0x0020) (BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationJumping
// 0x00D0
struct FAthenaAnimationJumping
{
	TEnumAsByte<EAthenaAnimationJumpingState>          JumpingState;                                             // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              PreImpactTime;                                            // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                JumpSequence;                                             // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                LandingSequence;                                          // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               FiredFromActor;                                           // 0x0010(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xBF];                                      // 0x0011(0x00BF) MISSED OFFSET
};

// ScriptStruct Athena.DamageInstance
// 0x0020
struct FDamageInstance
{
	struct FGuid                                       AttackId;                                                 // 0x0000(0x0010) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      Instigator;                                               // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Amount;                                                   // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHealthChangedReason>                  Reason;                                                   // 0x001C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationLODSettings
// 0x0003
struct FAthenaAnimationLODSettings
{
	TEnumAsByte<EIKState>                              IKState;                                                  // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EIKSolverType>                         IKSolverType;                                             // 0x0001(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EIKFootPlantingState>                  IKFootPlantingState;                                      // 0x0002(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationWieldedItemStateMachine
// 0x0500
struct FAthenaAnimationWieldedItemStateMachine
{
	TEnumAsByte<EWieldedItemAnimationState>            CurrentState;                                             // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EWieldedItemAnimationState>            PreviousState;                                            // 0x0001(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ExpectingTransition;                                      // 0x0002(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0003(0x0005) MISSED OFFSET
	class UClass*                                      ContinuousUseInputId;                                     // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      OutOfContinuousUseInputId;                                // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      OneShotUseInputId;                                        // 0x0018(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               OneShotIsAlternate;                                       // 0x0020(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ContinuousIsAlternate;                                    // 0x0021(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EWieldableItemAnimVariant>             OneShotAnimationVariant;                                  // 0x0022(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IdleIsAlternate;                                          // 0x0023(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x24];                                      // 0x0024(0x0024) MISSED OFFSET
	class UAnimSequence*                               LastValidAnimSequence;                                    // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBlendSpace1D*                               LastValidBlendspace;                                      // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      PreviousWieldedItem;                                      // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       WieldSockets[0x7];                                        // 0x0060(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x468];                                     // 0x0098(0x0468) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationLoadObjectByID
// 0x08B0
struct FAthenaAnimationLoadObjectByID
{
	int                                                LoadedObjectID;                                           // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ObjectFound;                                              // 0x0004(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	class UClass*                                      CharacterType;                                            // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UScriptStruct*                               DestinationStruct;                                        // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	struct FAthenaAnimationCoreObjectAnimations        LoadedObjectAnimations;                                   // 0x0020(0x0890) (BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationDebugTrackingParams
// 0x0004
struct FAthenaAnimationDebugTrackingParams
{
	bool                                               TrackObjectActive;                                        // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TrackOverlayState;                                        // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TrackActiveAnimations;                                    // 0x0002(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TrackOverlayFlags;                                        // 0x0003(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CloudVisualParameters
// 0x0070
struct FCloudVisualParameters
{
	bool                                               RenderInMainPass;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     ScalingVector;                                            // 0x0004(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   BillboardScale;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   BillboardRandomScale;                                     // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   BillboardRearCutOff;                                      // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   BillboardForeCutOff;                                      // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   BillboardSink;                                            // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              BillboardScaleAlphaDependence;                            // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              BillboardRotationRate;                                    // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceFadeExponent;                                     // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TurbulenceScale;                                          // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TurbulenceStrength;                                       // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FluffCullDistance;                                        // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          MaterialTemplatePointCloudSolid;                          // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          MaterialTemplatePointCloudFluffy;                         // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          MaterialTemplateStreetCloudSolid;                         // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          MaterialTemplateStreetCloudFluffy;                        // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.TiledCloudProperties
// 0x0024
struct FTiledCloudProperties
{
	struct FVector2D                                   TilePosition;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CloudTypeIndex;                                           // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RelativeRadius;                                           // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Scale;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PressureThreshold;                                        // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RotationYaw;                                              // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              OverlapTolerance;                                         // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0020(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.RenderedCloudProperties
// 0x0030
struct FRenderedCloudProperties
{
	struct FVector                                     WorldPosition;                                            // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Fade;                                                     // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Storminess;                                               // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RotationYaw;                                              // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              StreetRotationFront;                                      // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              StreetRotationBack;                                       // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               Visible;                                                  // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               FluffVisible;                                             // 0x0021(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsStreetCloud;                                            // 0x0022(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               UpdatesThisFrame;                                         // 0x0023(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0024(0x000C) MISSED OFFSET
};

// ScriptStruct Athena.CloudTypeDefinition
// 0x0030
struct FCloudTypeDefinition
{
	class UStaticMesh*                                 CloudMesh;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UStaticMesh*                                 CloudFluffyMesh;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ScaleRange;                                               // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   StorminessRange;                                          // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ProbabilityWeight;                                        // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              OverlapTolerance;                                         // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsStreetCloud;                                            // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               CastsShadow;                                              // 0x0029(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
};

// ScriptStruct Athena.CloudTypeNormalizedWeight
// 0x0018
struct FCloudTypeNormalizedWeight
{
	struct FLinearColor                                LodScreenPercentages;                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ProbabilityWeight;                                        // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MeshRadius;                                               // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.ActorId
// 0x0010
struct FActorId
{
	class FString                                      ActorLocalName;                                           // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct Athena.WeakActorHandle
// 0x0028
struct FWeakActorHandle
{
	struct FActorId                                    ActorId;                                                  // 0x0000(0x0010)
	struct FNetActorPtr                                NetActorPtr;                                              // 0x0010(0x0014)
	bool                                               Valid;                                                    // 0x0024(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.ItemLoadoutCapacity
// 0x0010
struct FItemLoadoutCapacity
{
	class UClass*                                      ItemCategory;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                Capacity;                                                 // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.ItemLoadout
// 0x0020
struct FItemLoadout
{
	TArray<struct FItemLoadoutCapacity>                Capacities;                                               // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<class UClass*>                              Items;                                                    // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.PhraseData
// 0x0038
struct FPhraseData
{
	struct FText                                       TextToBroadcast;                                          // 0x0000(0x0018) (Edit)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
};

// ScriptStruct Athena.DetailAppearenceMaterialDesc
// 0x0018
struct FDetailAppearenceMaterialDesc
{
	struct FStringAssetReference                       Material;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                MaterialIndex;                                            // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.DetailAppearenceDesc
// 0x0020
struct FDetailAppearenceDesc
{
	struct FStringAssetReference                       Mesh;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FDetailAppearenceMaterialDesc>       Materials;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct Athena.WalkConditionsParams
// 0x0008
struct FWalkConditionsParams
{
	float                                              WalkSpeedMultiplier;                                      // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WalkStopThreshold;                                        // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.SprintConditionsParams
// 0x000C
struct FSprintConditionsParams
{
	float                                              ForwardInputVectorTolerance;                              // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MinVelocityForwardDot;                                    // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MinVelocityMagnitude;                                     // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AchievementKillOpponentFromBehindWithBlunderbuss
// 0x0004
struct FAchievementKillOpponentFromBehindWithBlunderbuss
{
	float                                              FacingDirAngleTolerance;                                  // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.AchievementHeavyAttackRivalOffTheirShip
// 0x0010
struct FAchievementHeavyAttackRivalOffTheirShip
{
	class AAthenaCharacter*                            Character;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              TimeWindowInSeconds;                                      // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AchievementBlockThenHitAndGetBlockedThenTakeHit
// 0x0010
struct FAchievementBlockThenHitAndGetBlockedThenTakeHit
{
	class AAthenaPlayerCharacter*                      Character;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              TimeWindowInSeconds;                                      // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AchievementHaveADrinkWithAnotherCrewAtAnOutpost
// 0x0020
struct FAchievementHaveADrinkWithAnotherCrewAtAnOutpost
{
	class AAthenaPlayerCharacter*                      Character;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
	float                                              RangeOfCheckInMetres;                                     // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DrinkConsumedVolumeThreshold;                             // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.PirateIdentity
// 0x0028
struct FPirateIdentity
{
	struct FUniqueNetIdRepl                            UserId;                                                   // 0x0000(0x0018)
	class FString                                      PirateId;                                                 // 0x0018(0x0010) (ZeroConstructor)
};

// ScriptStruct Athena.Alliance
// 0x0020
struct FAlliance
{
	struct FGuid                                       AllianceId;                                               // 0x0000(0x0010) (ZeroConstructor, IsPlainOldData)
	TArray<struct FGuid>                               Crews;                                                    // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct Athena.ShipPartCustomizationInfo
// 0x0018
struct FShipPartCustomizationInfo
{
	struct FName                                       PartName;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FStringAssetReference                       Customization;                                            // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct Athena.ShipSizePartCustomizationInfo
// 0x0018
struct FShipSizePartCustomizationInfo
{
	class UClass*                                      ShipSize;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FShipPartCustomizationInfo>          Customizations;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct Athena.AnimNotifyWwiseObserver
// 0x0018
struct FAnimNotifyWwiseObserver
{
	class UWwiseEvent*                                 OnEventPosted;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UWwiseEvent*>                         AdditionalEventsToTrigger;                                // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAIEngageEnemyData
// 0x0010
struct FAthenaAIEngageEnemyData
{
	class UClass*                                      EngageEnemyMethod;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BestTargetRange;                                          // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAIItemEngageEnemyMethods
// 0x0018
struct FAthenaAIItemEngageEnemyMethods
{
	class UClass*                                      ItemCategory;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FAthenaAIEngageEnemyData>            EngageEnemyDataList;                                      // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationCamera
// 0x0018
struct FAthenaAnimationCamera
{
	float                                              CameraAlpha;                                              // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CameraLookYawTime;                                        // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CameraLookPitchTime;                                      // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CameraYaw;                                                // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CameraPitch;                                              // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ECameraLookatAnimationType>            CameraObjectAttachmentType;                               // 0x0014(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationIKLimbStretch
// 0x000C
struct FAthenaAnimationIKLimbStretch
{
	float                                              IKStretchArms;                                            // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IKStretchLegs;                                            // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IKStretchSpine;                                           // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.LadderBlendParams
// 0x000C
struct FLadderBlendParams
{
	float                                              RotationBlendStartByPercentage;                           // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RotationBlendEndByPercentage;                             // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LocationBlendEndByPercentage;                             // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.LadderDefinition
// 0x001C
struct FLadderDefinition
{
	TEnumAsByte<ELadderType>                           LadderType;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FLadderBlendParams                          OnTopLadderBlendParams;                                   // 0x0004(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FLadderBlendParams                          OffTopLadderBlendParams;                                  // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Athena.AthenaAnimationLadder
// 0x0220
struct FAthenaAnimationLadder
{
	float                                              TranslationStrength;                                      // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotationStrength;                                         // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AnimationOverride;                                        // 0x0010(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              AnimationLoopMod;                                         // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HeightPerStep;                                            // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       LeftHandSocketName;                                       // 0x001C(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       RightHandSocketName;                                      // 0x0024(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       LeftFootSocketName;                                       // 0x002C(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       RightFootSocketName;                                      // 0x0034(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EAthenaAnimationLadderState>           LadderState;                                              // 0x003C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAthenaAnimationLadderTransitionState> LadderTransitionState;                                    // 0x003D(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x003E(0x0002) MISSED OFFSET
	struct FLadderDefinition                           LadderDefinition;                                         // 0x0040(0x001C) (BlueprintVisible, BlueprintReadOnly)
	float                                              ClimbDistance;                                            // 0x005C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              AnimationDistance;                                        // 0x0060(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PlayerIntent;                                             // 0x0064(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ClimbOnComplete;                                          // 0x0068(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ClimbOffComplete;                                         // 0x0069(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1B6];                                     // 0x006A(0x01B6) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationPitchAlpha
// 0x0014
struct FAthenaAnimationPitchAlpha
{
	float                                              ArmPitchAlphaLeft;                                        // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ArmPitchAlphaRight;                                       // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ArmPitchInterpSpeed;                                      // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       BaseRotationIKSocketName;                                 // 0x000C(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationPitchShoulders
// 0x001C
struct FAthenaAnimationPitchShoulders
{
	struct FRotator                                    Shoulder;                                                 // 0x0000(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    Clavicle;                                                 // 0x000C(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ActiveLeft;                                               // 0x0018(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ActiveRight;                                              // 0x0019(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x001A(0x0002) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationMountedWeapon
// 0x00F8
struct FAthenaAnimationMountedWeapon
{
	bool                                               IsFiring;                                                 // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Pitch;                                                    // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Yaw;                                                      // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class AActor*                                      ControlledObject;                                         // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xE0];                                      // 0x0018(0x00E0) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationFootPlanting
// 0x0058
struct FAthenaAnimationFootPlanting
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FCollisionResponseContainer                 OverrideRaycast;                                          // 0x0008(0x0020) (BlueprintVisible, BlueprintReadOnly)
	float                                              HipHeight;                                                // 0x0028(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HipPullStrength;                                          // 0x002C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FloorContactDownDistance;                                 // 0x0030(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RelativePlantDownDistance;                                // 0x0034(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FloorContactToRangeStart;                                 // 0x0038(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FloorContactToRangeEnd;                                   // 0x003C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RelativePlantToRangeStart;                                // 0x0040(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RelativePlantToRangeEnd;                                  // 0x0044(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IKLegStretch;                                             // 0x0048(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SlopeAngle;                                               // 0x004C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Active;                                                   // 0x0050(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               FeetContact;                                              // 0x0051(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0052(0x0006) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationSailControl
// 0x00A0
struct FAthenaAnimationSailControl
{
	float                                              SailMovementForce;                                        // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SailLookatAngle;                                          // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ControlledObject;                                         // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x90];                                      // 0x0010(0x0090) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationSkeletonSensingAnimations
// 0x0028
struct FAthenaAnimationSkeletonSensingAnimations
{
	class UClass*                                      UseWithObject;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               InitialReaction;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               Searching;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               AlertingOthers;                                           // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               Pursuit;                                                  // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationSkeletonSensingParams
// 0x0038
struct FAthenaAnimationSkeletonSensingParams
{
	TArray<struct FAthenaAnimationSkeletonSensingAnimations> AllLoadedAISensingAnimations;                             // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	TEnumAsByte<ESkeletonSensingState>                 CurrentSensingState;                                      // 0x0010(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	class UAnimSequence*                               InitialReactionAnimation;                                 // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SearchingAnimation;                                       // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               AlertingOthersAnimation;                                  // 0x0028(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               PursuitAnimation;                                         // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationSkeletonEmoteActionAnimations
// 0x0028
struct FAthenaAnimationSkeletonEmoteActionAnimations
{
	class UClass*                                      UseWithObject;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       Taunt;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimSequence*>                       Cheer;                                                    // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationSkeletonEmoteActionParams
// 0x0028
struct FAthenaAnimationSkeletonEmoteActionParams
{
	TArray<struct FAthenaAnimationSkeletonEmoteActionAnimations> AllLoadedAIEmoteActionAnimations;                         // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	TEnumAsByte<ESkeletonEmoteActionState>             CurrentEmoteActionState;                                  // 0x0010(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	class UAnimSequence*                               TauntAnimation;                                           // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CheerAnimation;                                           // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationAI
// 0x01E8
struct FAthenaAnimationAI
{
	bool                                               SpawnAnimationActive;                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SpawnAnimationReadyToBegin;                               // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	class UAnimSequence*                               AISpawn;                                                  // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               AIDespawn;                                                // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AIAnimationSpawnTime;                                     // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               AISpawnOnLand;                                            // 0x001C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               AIFleeActive;                                             // 0x001D(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x001E(0x0002) MISSED OFFSET
	struct FAthenaAnimationSkeletonSensingParams       AISensing;                                                // 0x0020(0x0038) (BlueprintVisible)
	struct FAthenaAnimationSkeletonEmoteActionParams   AIEmoteActions;                                           // 0x0058(0x0028) (BlueprintVisible)
	unsigned char                                      UnknownData02[0x168];                                     // 0x0080(0x0168) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationLocomotionStairsAnimData
// 0x0020
struct FAthenaAnimationLocomotionStairsAnimData
{
	class UBlendSpace*                                 UpStairsLeft;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 UpStairsRight;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 DownStairsLeft;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 DownStairsRight;                                          // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLocomotionAlternateAnimData
// 0x0050
struct FAthenaAnimationLocomotionAlternateAnimData
{
	class UAnimSequence*                               Idle;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 MainMovement;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningLeft;                                              // 0x0010(0x0008) (Edit, BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningRight;                                             // 0x0018(0x0008) (Edit, BlueprintVisible)
	class UAnimSequence*                               TurnOut;                                                  // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 RunStop;                                                  // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAthenaAnimationLocomotionStairsAnimData    StairsLocomotion;                                         // 0x0030(0x0020) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationSpawnBase
// 0x0028
struct FAthenaAnimationSpawnBase
{
	class UClass*                                      ObjectID;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SpawnOnLand;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SpawnOnShip;                                              // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               Despawn;                                                  // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SpawnSequenceLength;                                      // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationSkeletonFlee
// 0x0040
struct FAthenaAnimationSkeletonFlee
{
	class UClass*                                      UseWithObject;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       FleeTurnLeft;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAnimSequence*>                       FleeTurnRight;                                            // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UBlendSpace*                                 FleeLocomotionBase;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace*>                         FleeLocomotionVariants;                                   // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationSkeletonFleeInGraph
// 0x0038
struct FAthenaAnimationSkeletonFleeInGraph
{
	class UAnimSequence*                               TurnLeft;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               TurnRight;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LocomotionBase;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 LocomotionVariant;                                        // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlendSpace*>                         LocomotionVariantSelection;                               // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PrecentageChanceOfVariantOccuring;                        // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationSkeletonScream
// 0x0008
struct FAthenaAnimationSkeletonScream
{
	class UAnimSequence*                               SkeletonScream;                                           // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationShopInteractionAnimations
// 0x0028
struct FAthenaAnimationShopInteractionAnimations
{
	TEnumAsByte<EInteractionObject>                    ObjectType;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UAnimSequence*                               Into;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       Loop;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               Out;                                                      // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationShopInteractionParams
// 0x0030
struct FAthenaAnimationShopInteractionParams
{
	TArray<struct FAthenaAnimationShopInteractionAnimations> AllLoadedInteractionAnimations;                           // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               IntoAnimToPlay;                                           // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               LoopAnimToPlay;                                           // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               OutOfAnimToPlay;                                          // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Active;                                                   // 0x0028(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationEmoteAnimations
// 0x0048
struct FAthenaAnimationEmoteAnimations
{
	struct FName                                       EmoteName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EEmoteSequenceType>                    EmoteSequenceType;                                        // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	class UAnimSequence*                               OneShotSequence;                                          // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              OneShotSequenceLength;                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class UAnimSequence*                               ContinuousIn;                                             // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAnimSequence*>                       ContinuousCycle;                                          // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UAnimSequence*                               ContinuousOut;                                            // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      UseWithObject;                                            // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationEmoteAnimgraphStructure
// 0x00E0
struct FAthenaAnimationEmoteAnimgraphStructure
{
	TArray<struct FAthenaAnimationEmoteAnimations>     EmoteAnimationArray;                                      // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	bool                                               OneShotEmoteActive;                                       // 0x0010(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ContinuousEmoteActive;                                    // 0x0011(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ContinuousEmoteLoopExit;                                  // 0x0012(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0013(0x0005) MISSED OFFSET
	class UAnimSequence*                               OneShotAnimationToUse;                                    // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               ContinuousInAnimationToUse;                               // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               ContinuousOutAnimationToUse;                              // 0x0028(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               ContinuousLoopAnimationToUseA;                            // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               ContinuousLoopAnimationToUseB;                            // 0x0038(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xA0];                                      // 0x0040(0x00A0) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationAIKnockback
// 0x0030
struct FAthenaAnimationAIKnockback
{
	struct FAthenaAnimationSkeletonKnockbackLocomotionStrength KnockbackAnimations;                                      // 0x0000(0x0020) (BlueprintVisible)
	TEnumAsByte<EKnockbackAnimDirection>               AIKnockbackDirection;                                     // 0x0020(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	unsigned char                                      KnockbackActive : 1;                                      // 0x0024(0x0001) (BlueprintVisible)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	class UAnimSequence*                               KnockbackAnimToUse;                                       // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationHitReactsAnimData
// 0x0040
struct FAthenaAnimationHitReactsAnimData
{
	TArray<class UBlendSpace1D*>                       HitReact;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlendSpace1D*>                       HitReactItem;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlendSpace1D*>                       HitReactItemAction;                                       // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlendSpace1D*>                       HitReactSubtle;                                           // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationHitReactsSelectedAnimations
// 0x0040
struct FAthenaAnimationHitReactsSelectedAnimations
{
	class UBlendSpace1D*                               SelectedHitReact0;                                        // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SelectedHitReactItem0;                                    // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SelectedHitReactItemAction0;                              // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SelectedHitReactSubtle0;                                  // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SelectedHitReact1;                                        // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SelectedHitReactItem1;                                    // 0x0028(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SelectedHitReactItemAction1;                              // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace1D*                               SelectedHitReactSubtle1;                                  // 0x0038(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationHitReactParams
// 0x002C
struct FAthenaAnimationHitReactParams
{
	int                                                StandardIndex0;                                           // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                StandardIndex1;                                           // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      HitReactTransition : 1;                                   // 0x0008(0x0001) (BlueprintVisible)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              DirectionYaw;                                             // 0x000C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemIndex0;                                               // 0x0010(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemIndex1;                                               // 0x0014(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ActionIndex0;                                             // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ActionIndex1;                                             // 0x001C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SubtleIndex0;                                             // 0x0020(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SubtleIndex1;                                             // 0x0024(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ECharacterHitReactionAnimType>         AnimationType;                                            // 0x0028(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationIKUpdateParams
// 0x0040
struct FAthenaAnimationIKUpdateParams
{
	float                                              CurrentAlpha;                                             // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TranslationStrength;                                      // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RotationStrength;                                         // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x000C(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	struct FQuat                                       Orientation;                                              // 0x0020(0x0010) (BlueprintVisible, IsPlainOldData)
	TEnumAsByte<EHIKEffectorSpace>                     EffectorSpace;                                            // 0x0030(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	struct FName                                       ParentBone;                                               // 0x0034(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationPlayingFacialAnimations
// 0x0038
struct FAthenaAnimationPlayingFacialAnimations
{
	class UBlendSpace1D*                               Capstan;                                                  // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SailAction;                                               // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SailIdle;                                                 // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CannonFire;                                               // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               CannonAim;                                                // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               FacialIdle0;                                              // 0x0028(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               FacialIdle1;                                              // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationPlayingEquipAnimations
// 0x0010
struct FAthenaAnimationPlayingEquipAnimations
{
	class UAnimSequence*                               Equip;                                                    // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlendSpace*                                 EquipSwimming;                                            // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.VoyageParticipantView
// 0x00A0
struct FVoyageParticipantView
{
	struct FText                                       Title;                                                    // 0x0000(0x0018)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FGuid                                       Id;                                                       // 0x0038(0x0010) (ZeroConstructor, IsPlainOldData)
	int                                                ChapterIndex;                                             // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ChapterCount;                                             // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ActiveQuestCount;                                         // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EVoyageChangeReason>                   History;                                                  // 0x0054(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	class UClass*                                      Company;                                                  // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               IsEmergent;                                               // 0x0060(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	int                                                Rank;                                                     // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	class FString                                      DiscovererName;                                           // 0x0068(0x0010) (ZeroConstructor)
	bool                                               IsDiscovererMe;                                           // 0x0078(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0079(0x0003) MISSED OFFSET
	struct FName                                       ChestRarity;                                              // 0x007C(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               PlayAudio;                                                // 0x0084(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0085(0x0003) MISSED OFFSET
	int                                                ChestDiscoveredId;                                        // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x008C(0x0004) MISSED OFFSET
	class UPopUpMessageDesc*                           PopUpDesc;                                                // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                CollectCratesPopUpId;                                     // 0x0098(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AthenaCharacterSwimSpeed
// 0x000C
struct FAthenaCharacterSwimSpeed
{
	float                                              SprintSpdAmp;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SprintAccelAmp;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurnSpeedScalar;                                          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaCharacterSwimParams
// 0x0094
struct FAthenaCharacterSwimParams
{
	float                                              EnterSwimmingDepth;                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ExitSwimmingDepth;                                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FloatHeight;                                              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ThirdPersonMeshOffset;                                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ThirdPersonMeshAdjustTime;                                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FullGravityHeight;                                        // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SurfaceSwimDepth;                                         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SurfaceSwimExitDepth;                                     // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SubmergedBuoyancyDepth;                                   // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ZeroDragDepth;                                            // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxBuoyancyAcceleration;                                  // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SubmergedBuoyancyAcceleration;                            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SubmergedBuoyancyTime;                                    // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DragFactor;                                               // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDragAcceleration;                                      // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinPushDownRoofAngle;                                     // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinPushDownRoofZ;                                         // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinCorrectionVelForSurfaceSwim;                           // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SurfaceVelBlendTime;                                      // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UnderwaterSwimmingEntryPitch;                             // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UnderwaterSwimmingEntryAccel;                             // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UnderwaterSwimDepth;                                      // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UnderwaterSwimmingDragSpeed;                              // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UnderwaterSwimmingSpeed;                                  // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PitchBlendOffRate;                                        // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxSwimDepth;                                             // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxSwimDepthBuoyancy;                                     // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxSwimDepthBuoyancyRange;                                // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxSwimDepthDragFactor;                                   // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CharacterCentreOffset;                                    // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ETraceTypeQuery>                       WaterDepthTraceQueryType;                                 // 0x0078(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0079(0x0003) MISSED OFFSET
	struct FAthenaCharacterSwimSpeed                   SurfaceSwimSpeeds;                                        // 0x007C(0x000C) (Edit, BlueprintVisible)
	struct FAthenaCharacterSwimSpeed                   UnderwaterSwimSpeeds;                                     // 0x0088(0x000C) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.AthenaCharacterDodgeParams
// 0x0010
struct FAthenaCharacterDodgeParams
{
	float                                              DodgeCooldown;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DodgeForce;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              GroundLaunchAngle;                                        // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               DodgePerpendicularToGround;                               // 0x000C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               Disabled;                                                 // 0x000D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
};

// ScriptStruct Athena.TeleportLocation
// 0x0028
struct FTeleportLocation
{
	bool                                               Valid;                                                    // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class USceneComponent*                             TeleportBase;                                             // 0x0008(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FVector                                     TeleportLocation;                                         // 0x0010(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    TeleportRotation;                                         // 0x001C(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.KnockBackInfo
// 0x0034
struct FKnockBackInfo
{
	float                                              HorizontalVelocity;                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VerticalVelocity;                                         // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SwimmingVelocity;                                         // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DockedHorizontalVelocity;                                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DockedVerticalVelocity;                                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               UseDockedVelocitiesWhenDocked;                            // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	struct FName                                       RumbleTag;                                                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StunDuration;                                             // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AIKnockbackDistance;                                      // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AIKnockbackSpeed;                                         // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AIKnockbackAcceleration;                                  // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAIKnockbackStrengthType>              AIKnockbackStrengthType;                                  // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.ItemCategoryAIStrategyMovementPropertiesOverride
// 0x0018
struct FItemCategoryAIStrategyMovementPropertiesOverride
{
	class UClass*                                      ItemCategory;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FAIStrategyMovementProperties>       AIStrategyMovementPropertiesOverrides;                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.NetPositionErrorTolerance
// 0x0008
struct FNetPositionErrorTolerance
{
	float                                              ZDistance;                                                // 0x0000(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              XYDistance;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
};

// ScriptStruct Athena.GhostPawnEntry
// 0x0018
struct FGhostPawnEntry
{
	float                                              TimeRemaining;                                            // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class APawn*                                       Pawn;                                                     // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.GhostShipCoordinator
// 0x0150
struct FGhostShipCoordinator
{
	TArray<struct FGhostPawnEntry>                     GhostPawns;                                               // 0x0000(0x0010) (ZeroConstructor)
	class UObject*                                     Parent;                                                   // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	class AGhostShipPlayerSpawnLocation*               SpawnLocation;                                            // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	class AGhostShipDoor*                              GhostShipDoor;                                            // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x120];                                     // 0x0030(0x0120) MISSED OFFSET
};

// ScriptStruct Athena.StorageContainerRefresher
// 0x00C0
struct FStorageContainerRefresher
{
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0000(0x00C0) MISSED OFFSET
};

// ScriptStruct Athena.EncounterServiceEntry
// 0x0018
struct FEncounterServiceEntry
{
	TEnumAsByte<EEncounterListenerType>                EncounterListenerType;                                    // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<TEnumAsByte<EEncounterType>>                ValidEncounterTypes;                                      // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Athena.EncounterServiceParams
// 0x0018
struct FEncounterServiceParams
{
	TArray<struct FEncounterServiceEntry>              EncounterList;                                            // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	int                                                EncountersToCheckPerCycle;                                // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.CrewServiceParams
// 0x0050
struct FCrewServiceParams
{
	float                                              MinSafeDistanceToShip;                                    // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpawnDistAroundSunkenShip;                                // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<int>                                        VotesRequiredForSendToBrig;                               // 0x0008(0x0010) (Edit, ZeroConstructor)
	TArray<int>                                        VotesRequiredForReleaseFromBrig;                          // 0x0018(0x0010) (Edit, ZeroConstructor)
	TArray<int>                                        VotesRequiredForScuttleShip;                              // 0x0028(0x0010) (Edit, ZeroConstructor)
	TArray<int>                                        VotesRequiredForChangeMatchmakingVisibility;              // 0x0038(0x0010) (Edit, ZeroConstructor)
	float                                              BrigMinReleaseTime;                                       // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BrigServerTimeToRememberPastCrewMates;                    // 0x004C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.DigEventFxParams
// 0x0018
struct FDigEventFxParams
{
	class UObject*                                     Particles;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAttachParticlesToShovel;                                 // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	class UForceFeedbackEffect*                        Rumble;                                                   // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.DigSurfaceTypeParams
// 0x0048
struct FDigSurfaceTypeParams
{
	TEnumAsByte<EPhysicalSurface>                      SurfaceType;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EShovelDigType>                        DigType;                                                  // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	struct FDigEventFxParams                           EnterGroundFx;                                            // 0x0008(0x0018) (Edit, BlueprintVisible)
	struct FDigEventFxParams                           LeaveGroundFx;                                            // 0x0020(0x0018) (Edit, BlueprintVisible)
	class UClass*                                      DigHoleClass;                                             // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DigAINoiseRange;                                          // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.SharedShovelParams
// 0x0050
struct FSharedShovelParams
{
	TArray<struct FDigSurfaceTypeParams>               DigSurfaceTypeParams;                                     // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                     DigPosOffsetFromPlayerPos;                                // 0x0010(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SurfaceTypeRaycastLength;                                 // 0x001C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxSurfaceAngleForDig;                                    // 0x0020(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InitialSphereCastRadiusForSuccessfulDig;                  // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RequiredObstacleFreeRadiusForSuccessfulDig;               // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ObstacleCheckStartOffsetZFromSphereTestPos;               // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NumSamplesForBlockingSurfacesTest;                        // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxWaterDepthToStartSuccessfulDig;                        // 0x0034(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     HitTestTraceChannel;                                      // 0x0038(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	float                                              MinPlanarTestRadius;                                      // 0x003C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NumSamplesForPlanarityTest;                               // 0x0040(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxBumpinessForPlanarityTestInCm;                         // 0x0044(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AssumedPlayerWaistHeight;                                 // 0x0048(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDrawDebug;                                               // 0x004C(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.MermaidServiceMermaidSpawnParams
// 0x0034
struct FMermaidServiceMermaidSpawnParams
{
	float                                              MinDistFromSpawnOrigin;                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDistFromSpawnOriginForDestroyedShip;                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistFromSpawnOriginBeforeGivingUp;                     // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DistIncrementPerFailedSpawnCircle;                        // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NumSamplesInSpawnCircle;                                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SpawnCastStartZ;                                          // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinSpawnDepth;                                            // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SpawnHalfConeAngleRestrictIfSpawningForPlayer;            // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     HitTestTraceChannel;                                      // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	float                                              AssumedMermaidRadius;                                     // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDistanceOfFinalSpawnPosToAnyActiveMermaid;             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDistFromEdgeOfWorld;                                   // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDrawDebug;                                               // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.MermaidServiceParams
// 0x0064
struct FMermaidServiceParams
{
	float                                              LocallyActiveMermaidCheckInterval;                        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PlayerAbandonedCheckInterval;                             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDestroyDistancePlayerToMermaidIfPlayerNearIsland;      // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDestroyDistancePlayerToMermaidIfPlayerNotNearIsland;   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistFromCoastForPlayerToCountAsNearIsland;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistFromCoastForShipToCountAsNearIsland;               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinPlayerToShipDistForPlayerToQualifyAsAbandoned;         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNotNearIsland;// 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNearIsland;// 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxNumberOfConcurrentMermaids;                            // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinLifeTimeOfMermaidBeforeCanBeCulledInPopulationCheck;   // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SpawnDistAroundSaviourMermaid;                            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FMermaidServiceMermaidSpawnParams           SpawnParams;                                              // 0x0030(0x0034) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.MakeFriendsEmoteParams
// 0x000C
struct FMakeFriendsEmoteParams
{
	struct FName                                       TriggerEmoteName;                                         // 0x0000(0x0008) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              TriggerDistanceThreshold;                                 // 0x0008(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
};

// ScriptStruct Athena.MermaidRespawnConfig
// 0x001C
struct FMermaidRespawnConfig
{
	float                                              ScorePenaltyForEachMeterAwayFromShipwreck;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinRespawnLocDistanceFromSunkShip;                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinScorePenaltyForEnemyShipProximity;                     // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxScorePenaltyForEnemyShipProximity;                     // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistanceFromEnemyShipToApplyPenalty;                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistanceFromIslandWeHaveMapForToApplyPenalty;          // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ScorePenaltyForIslandsWeHaveMapFor;                       // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CharacterSocketCollisionServiceParams
// 0x0008
struct FCharacterSocketCollisionServiceParams
{
	float                                              MaxCharacterDistanceSqr;                                  // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MaxSockets;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AthenaAICharacterParams
// 0x0008
struct FAthenaAICharacterParams
{
	float                                              MissFiringHeightOffset;                                   // 0x0000(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              MissFiringTargetInFrontOffset;                            // 0x0004(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
};

// ScriptStruct Athena.ItemProxyTTLParams
// 0x0008
struct FItemProxyTTLParams
{
	float                                              RecheckPeriod;                                            // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PlayerProximityCutoff;                                    // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.AimSensitivitySettingParams
// 0x000C
struct FAimSensitivitySettingParams
{
	struct FFloatInterval                              Range;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Default;                                                  // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AimSensitivitySettingsEntry
// 0x001C
struct FAimSensitivitySettingsEntry
{
	TEnumAsByte<EAimSensitivitySettingCategory>        SettingCategory;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FAimSensitivitySettingParams                SettingParams_Mouse;                                      // 0x0004(0x000C) (Edit)
	struct FAimSensitivitySettingParams                SettingParams_Controller;                                 // 0x0010(0x000C) (Edit)
};

// ScriptStruct Athena.AimSensitivitySettingsDefaults
// 0x0010
struct FAimSensitivitySettingsDefaults
{
	TArray<struct FAimSensitivitySettingsEntry>        Entries;                                                  // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.ActionMappingKeyLookupFallback
// 0x0010
struct FActionMappingKeyLookupFallback
{
	struct FName                                       ActionBeingLookedUp;                                      // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       ActionToAlsoLookup;                                       // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.VirtualActionBindingDefinition
// 0x0020
struct FVirtualActionBindingDefinition
{
	TArray<struct FName>                               ActionNames;                                              // 0x0000(0x0010) (Edit, ZeroConstructor)
	class FString                                      BindingName;                                              // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.VirtualAxisBindingDefinition
// 0x0028
struct FVirtualAxisBindingDefinition
{
	TArray<struct FName>                               AxisNames;                                                // 0x0000(0x0010) (Edit, ZeroConstructor)
	class FString                                      BindingName;                                              // 0x0010(0x0010) (Edit, ZeroConstructor)
	float                                              Scale;                                                    // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.CannonDesc
// 0x0010
struct FCannonDesc
{
	class UStaticMesh*                                 CannonBarrelMesh;                                         // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class USkeletalMesh*                               CannonBoxMesh;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.PartCustomisation
// 0x0020
struct FPartCustomisation
{
	class FString                                      Category;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class FString                                      Customisation;                                            // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.PartDesc
// 0x0020
struct FPartDesc
{
	class FString                                      Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FPartCustomisation>                  Customisations;                                           // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.Vengeance
// 0x0068
struct FVengeance
{
	class AAthenaPlayerController*                     Controller;                                               // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Duration;                                                 // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5C];                                      // 0x000C(0x005C) MISSED OFFSET
};

// ScriptStruct Athena.InventoryMemory
// 0x0050
struct FInventoryMemory
{
	TMap<class UClass*, int>                           LastEquippedIndexOfCategoryMap;                           // 0x0000(0x0050) (ZeroConstructor)
};

// ScriptStruct Athena.AthenaStreamedLevel
// 0x0010
struct FAthenaStreamedLevel
{
	TArray<class ULevelStreaming*>                     Levels;                                                   // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct Athena.TreasureMapWidget
// 0x0018
struct FTreasureMapWidget
{
	struct FVector2D                                   Position;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ETreasureMapHorizontalAlignment>       HorizontalAlignment;                                      // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ETreasureMapVerticalAlignment>         VerticalAlignment;                                        // 0x0009(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x000A(0x0002) MISSED OFFSET
	float                                              Angle;                                                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Width;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Opacity;                                                  // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.TreasureMapWidgetText
// 0x0008 (0x0020 - 0x0018)
struct FTreasureMapWidgetText : public FTreasureMapWidget
{
	float                                              Scale;                                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               CutoutTextStyle;                                          // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.SeaRock
// 0x000C
struct FSeaRock
{
	struct FVector2D                                   Location;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Radius;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.AthenaStreamedLevelItem
// 0x0020
struct FAthenaStreamedLevelItem
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UAthenaStreamedLevelDataAsset*               DataAsset;                                                // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       FeatureToggle;                                            // 0x0018(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.WorldSafeZone
// 0x0014
struct FWorldSafeZone
{
	unsigned char                                      UnknownData00[0x14];                                      // 0x0000(0x0014) MISSED OFFSET
};

// ScriptStruct Athena.AtmosphericPressureZoneParameters
// 0x0014
struct FAtmosphericPressureZoneParameters
{
	float                                              Radius;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TargetPressure;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PushForce;                                                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TwistForce;                                               // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Weight;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.AtmosphericPressureZoneParametersAndLocation
// 0x001C
struct FAtmosphericPressureZoneParametersAndLocation
{
	struct FAtmosphericPressureZoneParameters          PressureZoneParameters;                                   // 0x0000(0x0014) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector2D                                   Location;                                                 // 0x0014(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.DeferredBakedDecal
// 0x0038
struct FDeferredBakedDecal
{
	unsigned char                                      UnknownData00[0x38];                                      // 0x0000(0x0038) MISSED OFFSET
};

// ScriptStruct Athena.BarrelsOfPlentyDebugLocationEntry
// 0x0010
struct FBarrelsOfPlentyDebugLocationEntry
{
	struct FVector                                     WorldSpacePosition;                                       // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData)
	float                                              SinkTime;                                                 // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.StandardAnchorDynamicsParameters
// 0x0028
struct FStandardAnchorDynamicsParameters
{
	float                                              AnchorForce;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              VelocityDeadZoneThreshold;                                // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 UnaryWheelAngleBasedTorque;                               // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 ForwardSpeedBasedTorque;                                  // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BaseHandbrakeTorque;                                      // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TimeAfterAnchorDownToGrabWantedYaw;                       // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 YawDeltaVsCorrectiveTorquePerKgMass;                      // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.StandardHullDragDynamicsParameters
// 0x0018
struct FStandardHullDragDynamicsParameters
{
	float                                              ForwardDragForcePerMPS;                                   // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BackwardsDragForcePerMPS;                                 // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SidewaysDragCounterForcePerMPS;                           // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxSailFractionToCountAsFullyUpForDragCalc;               // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ForwardDragWhenBeached;                                   // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WaterZoneDragAmp;                                         // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.StandardRudderDynamicsParameters
// 0x0008
struct FStandardRudderDynamicsParameters
{
	float                                              SteeringBoostMultiplier;                                  // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RudderBrakeAmplitude;                                     // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.StandardSailDynamicsParameters
// 0x000C
struct FStandardSailDynamicsParameters
{
	float                                              ForceGeneratedByWindSpeedPerMPS;                          // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AirDragPerSailPerMPS;                                     // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PowerRatioOfSailForwardForceToFullForce;                  // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.BoobyTrapSpawnerRankEntry
// 0x0018
struct FBoobyTrapSpawnerRankEntry
{
	int                                                Rank;                                                     // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ChanceOfBeingBoobyTrapped;                                // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UAIBoobyTrapSpawner*>                 Spawners;                                                 // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Athena.RewardId
// 0x0008
struct FRewardId
{
	struct FName                                       RewardId;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.TreasureMapWidgetTexture
// 0x0010 (0x0028 - 0x0018)
struct FTreasureMapWidgetTexture : public FTreasureMapWidget
{
	class UTexture*                                    Image;                                                    // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RelativeHeightModifier;                                   // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               FlipX;                                                    // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.TreasureMapWidgetTextWithScaledWidthBackground
// 0x0038 (0x0058 - 0x0020)
struct FTreasureMapWidgetTextWithScaledWidthBackground : public FTreasureMapWidgetText
{
	struct FTreasureMapWidgetTexture                   Background;                                               // 0x0020(0x0028) (Edit, BlueprintVisible)
	float                                              MaxTextWidthForDefaultTextureScale;                       // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinScaleModifier;                                         // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxScaleModifier;                                         // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.BountyMapLayoutTarget
// 0x0080
struct FBountyMapLayoutTarget
{
	struct FTreasureMapWidgetTextWithScaledWidthBackground Name;                                                     // 0x0000(0x0058) (Edit, BlueprintVisible)
	struct FTreasureMapWidgetTexture                   MugShot;                                                  // 0x0058(0x0028) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.TreasureMapWidgetLocalisedText
// 0x0038 (0x0058 - 0x0020)
struct FTreasureMapWidgetLocalisedText : public FTreasureMapWidgetText
{
	struct FText                                       Text;                                                     // 0x0020(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0020(0x0020) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
};

// ScriptStruct Athena.QuestBootyItemPopUpEntry
// 0x0010
struct FQuestBootyItemPopUpEntry
{
	struct FName                                       BootyItemIdentifier;                                      // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UPopUpMessageDesc*                           PopUp;                                                    // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.BountyQuestMugShotSet
// 0x0028
struct FBountyQuestMugShotSet
{
	class UAthenaAIFormDataAsset*                      Form;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture*                                    MaleCaptainMugShot;                                       // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture*                                    FemaleCaptainMugShot;                                     // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture*                                    MaleCrewMugShot;                                          // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture*                                    FemaleCrewMugShot;                                        // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.BountyQuestLayoutOption
// 0x0010
struct FBountyQuestLayoutOption
{
	int                                                NumCaptains;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                NumCrew;                                                  // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UBountyMapLayout*                            Layout;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.LoadoutSubstitution
// 0x0020
struct FLoadoutSubstitution
{
	struct FStringAssetReference                       LoadoutToSubstituteOut;                                   // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<struct FStringAssetReference>               LoadoutsToSubstituteIn;                                   // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.CompanySkillsetProgressions
// 0x0018
struct FCompanySkillsetProgressions
{
	class UClass*                                      Company;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAISkillsetRankProgression*                  CrewSkillset;                                             // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAISkillsetRankProgression*                  CaptainSkillset;                                          // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.BowSplashProbe
// 0x00E8
struct FBowSplashProbe
{
	struct FWaterSplashProbe                           Probe;                                                    // 0x0000(0x00C0) (Edit, DisableEditOnInstance)
	float                                              ProbeSamplingTime;                                        // 0x00C0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TimeBetweenProbeVfx;                                      // 0x00C4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UVfxSelectorDataAsset*                       SplashSelectorAsset;                                      // 0x00C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               SpawnAttached;                                            // 0x00D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAttachLocation>                       SplashAttachType;                                         // 0x00D1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x00D2(0x0002) MISSED OFFSET
	struct FVector                                     VfxSpawnOffset;                                           // 0x00D4(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               Enabled;                                                  // 0x00E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00E1(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.SerialisedRpc
// 0x0020
struct FSerialisedRpc
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct Athena.ImpactDamageEvent
// 0x0058
struct FImpactDamageEvent
{
	struct FGuid                                       AttackId;                                                 // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamagerType;                                              // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      Instigator;                                               // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ProjectileActor;                                          // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0028(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     SurfaceNormal;                                            // 0x0034(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0040(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DamageAmount;                                             // 0x004C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DamageSpread;                                             // 0x0050(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EHealthChangedReason>                  Reason;                                                   // 0x0054(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.BuoyancyComponentSinkingParams
// 0x0034
struct FBuoyancyComponentSinkingParams
{
	float                                              BuoyancyBlendTimeWhenSinking;                             // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EBuoyancyBlend>                        FloatingToSinkingBuoyancyCurveTransition;                 // 0x0004(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	float                                              FloatingToSinkingBuoyancyCurveBlendTime;                  // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FinalSinkingBuoyancy;                                     // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SinkingTimeUntilDestroy;                                  // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DisappearingTime;                                         // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AutomaticSinkingEnabled;                                  // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	struct FFloatRange                                 TimeInFloatingStateBeforeSinking;                         // 0x001C(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WaterDepthToAllowItemToSink;                              // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     WorldHitsTraceChannel;                                    // 0x0030(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.BuoyancyComponentLockToSurfaceParams
// 0x001C
struct FBuoyancyComponentLockToSurfaceParams
{
	bool                                               Enabled;                                                  // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              SpringAcceleration;                                       // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              EnterLockStateBlendTime;                                  // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ExitLockStateBlendTime;                                   // 0x000C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ChoppinessScalar;                                         // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SubmersionHint;                                           // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DistanceFromWaterSurfaceToConsiderSurfaced;               // 0x0018(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.BuoyancyComponentExclusionParams
// 0x0008
struct FBuoyancyComponentExclusionParams
{
	float                                              MaxDistanceCheck;                                         // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     HitsChannel;                                              // 0x0004(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.StartPickupObjectActionRuleParams
// 0x0010
struct FStartPickupObjectActionRuleParams
{
	TArray<TEnumAsByte<EWieldableItemSize>>            WieldableItemSizesDisablePickup;                          // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.ItemProxyImpactVfxParams
// 0x0010
struct FItemProxyImpactVfxParams
{
	TEnumAsByte<EPhysicalSurface>                      SurfaceType;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UObject*                                     Particles;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.Island
// 0x0048
struct FIsland
{
	struct FName                                       IslandName;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EIslandType>                           IslandType;                                               // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	class UClass*                                      Sea;                                                      // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     IslandBoundsCentre;                                       // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IslandBoundsRadius;                                       // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IslandTriggerRadius;                                      // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IslandSafeZoneRadius;                                     // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Rotation;                                                 // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     CompassDirectionIslandCentre;                             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0040(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.ItemSpawnWeightedType
// 0x0010
struct FItemSpawnWeightedType
{
	class UClass*                                      Type;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Weight;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.ItemSpawnDistribution
// 0x0010
struct FItemSpawnDistribution
{
	TArray<struct FItemSpawnWeightedType>              WeightedList;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.ItemSpawnParams
// 0x0028
struct FItemSpawnParams
{
	struct FWeightedProbabilityRange                   Total;                                                    // 0x0000(0x0020) (Edit)
	float                                              AllowedAngleDeviation;                                    // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaxZ;                                                     // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.ItemSpawnTransform
// 0x0050
struct FItemSpawnTransform
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	class UItemSpawnDistributionAsset*                 ReferencedSpawnDistribution;                              // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FItemSpawnDistribution                      SpawnDistribution;                                        // 0x0038(0x0010) (Edit, BlueprintVisible)
	int                                                Weight;                                                   // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.OneShotInteractableActionRuleParams
// 0x0010
struct FOneShotInteractableActionRuleParams
{
	TArray<TEnumAsByte<EWieldableItemSize>>            WieldableItemSizesToDisableInteraction;                   // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.BuoyantObjectSpawnDistributionParams
// 0x0014
struct FBuoyantObjectSpawnDistributionParams
{
	struct FFloatRange                                 ObjectDistanceFromSpawnCentre;                            // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinDistanceBetweenObjects;                                // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.BuoyantObjectSpawnParams
// 0x0020
struct FBuoyantObjectSpawnParams
{
	class UBuoyantObjectSpawnProfileDataAsset*         DefaultSpawnProfile;                                      // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     HitTestTraceChannel;                                      // 0x0008(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FBuoyantObjectSpawnDistributionParams       SpawnDistributionParams;                                  // 0x000C(0x0014) (Edit, DisableEditOnInstance)
};

// ScriptStruct Athena.BuoyantObjectWeightedGroup
// 0x0030
struct FBuoyantObjectWeightedGroup
{
	float                                              Weight;                                                   // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FWeightedProbabilityRange                   NumberOfItems;                                            // 0x0008(0x0020) (Edit, DisableEditOnInstance)
	class UItemSpawnDistributionAsset*                 Items;                                                    // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.BuoyantObjectSpawnProfile
// 0x00E0
struct FBuoyantObjectSpawnProfile
{
	struct FWeightedProbabilityRangeOfRanges           TravelDistanceToSpawnObjects;                             // 0x0000(0x0030) (Edit, DisableEditOnInstance)
	struct FWeightedProbabilityRange                   NumberOfBarrelsToSpawn;                                   // 0x0030(0x0020) (Edit, DisableEditOnInstance)
	struct FWeightedProbabilityRange                   NumberOfSpecialItemTypesToSpawn;                          // 0x0050(0x0020) (Edit, DisableEditOnInstance)
	struct FFloatRange                                 SpawnCentreDistanceInFrontOfShip;                         // 0x0070(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FFloatRange                                 SpawnCentreOffsetFromShipPath;                            // 0x0080(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FFloatRange                                 ObjectSpawnDepth;                                         // 0x0090(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FFloatRange                                 ObjectLifetime;                                           // 0x00A0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ObjectSinkRadius;                                         // 0x00B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinShipSpeedInKnotsToSpawnObjects;                        // 0x00B4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WildlifeSpawnHeight;                                      // 0x00B8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ChanceOfSpawningSpecialItems;                             // 0x00BC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      WildlifeType;                                             // 0x00C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      BarrelType;                                               // 0x00C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FBuoyantObjectWeightedGroup>         SpecialItemTypes;                                         // 0x00D0(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Athena.CanvasWorldMapShipIcons
// 0x0018
struct FCanvasWorldMapShipIcons
{
	class UClass*                                      ShipSize;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    ShipTexture;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UTexture*                                    OffscreenTexture;                                         // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Athena.CanvasWorldMapBackgroundItems
// 0x0020
struct FCanvasWorldMapBackgroundItems
{
	class UTexture*                                    Texture;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   WorldSize;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FVector2D>                           Locations;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Athena.CanvasWorldMapForegroundItems
// 0x0020
struct FCanvasWorldMapForegroundItems
{
	class UTexture*                                    Texture;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       FeatureToggle;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FVector2D>                           Locations;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Athena.CanvasWorldMapSeaData
// 0x0048
struct FCanvasWorldMapSeaData
{
	class UTexture*                                    Texture;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FText                                       Name;                                                     // 0x0008(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0008(0x0020) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FVector2D                                   Location;                                                 // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CapstanDesc
// 0x0020
struct FCapstanDesc
{
	class UStaticMesh*                                 CapstanBodyMesh;                                          // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UStaticMesh*                                 CapstanArmMesh;                                           // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UStaticMesh*                                 CapstanReleaseMesh;                                       // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UStaticMesh*                                 CapstanRopeMesh;                                          // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CapstanParams
// 0x0010
struct FCapstanParams
{
	float                                              MaxVelocityPerPlayer;                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxFreeLoweringVelocity;                                  // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxError;                                                 // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CorrectiveForceMultiplier;                                // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CapstanNetState
// 0x0008
struct FCapstanNetState
{
	float                                              TargetRatio;                                              // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsLocked;                                                 // 0x0004(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.CapstanAudioParams
// 0x0050
struct FCapstanAudioParams
{
	class UWwiseEvent*                                 CapstanStart;                                             // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 CapstanStop;                                              // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 CapstanStopFullyRaised;                                   // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 CapstanStopFullyLowered;                                  // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseObjectPoolWrapper*                     CapstanEmitterPool;                                       // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       CapstanTurnRateRtpc;                                      // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CapstanTurnMinRtpcValue;                                  // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CapstanTurnMaxRtpcValue;                                  // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       BoatVelocityRtpc;                                         // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BoatVelocityMinRtpcValue;                                 // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BoatVelocityMaxRtpcValue;                                 // 0x0044(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              EmpiricalMaxShipVelocity;                                 // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.CarouselPirateDesc
// 0x0030
struct FCarouselPirateDesc
{
	int                                                Seed;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EIPGGender>                            Gender;                                                   // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EIPGEthnicity>                         Ethnicity;                                                // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	float                                              Age;                                                      // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRadialCoordinate                           BodyShape;                                                // 0x000C(0x0008) (Edit, BlueprintVisible)
	float                                              Dirtiness;                                                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Wonkiness;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	TArray<class UClass*>                              Outfit;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.CarouselPirateBodyshapeCompass
// 0x0002
struct FCarouselPirateBodyshapeCompass
{
	TEnumAsByte<ECarouselPirateBodyshapeDirection>     StartDirection;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ECarouselPirateBodyshapeDirection>     EndDirection;                                             // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CarouselPirateBodyshape
// 0x0018
struct FCarouselPirateBodyshape
{
	float                                              RandomizationBias;                                        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 ShapeMagnitude;                                           // 0x0004(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FCarouselPirateBodyshapeCompass             BodyShapeCompass;                                         // 0x0014(0x0002) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0016(0x0002) MISSED OFFSET
};

// ScriptStruct Athena.CarouselPirateGroup
// 0x006C
struct FCarouselPirateGroup
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 Age;                                                      // 0x000C(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 Wonkiness;                                                // 0x001C(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FFloatRange                                 Dirt;                                                     // 0x002C(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FCarouselPirateBodyshape                    MaleBodyShape;                                            // 0x003C(0x0018) (Edit, BlueprintVisible)
	struct FCarouselPirateBodyshape                    FemaleBodyShape;                                          // 0x0054(0x0018) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.CarouselPirateClothingItem
// 0x0010
struct FCarouselPirateClothingItem
{
	class UClass*                                      Item;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EIPGEthnicity>                         EthnicityFilter;                                          // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.CarouselPirateClothingCategoryBias
// 0x0010
struct FCarouselPirateClothingCategoryBias
{
	class UClass*                                      Category;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LikelihoodOfHaving;                                       // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ProgressivlyDecreaseChance;                               // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.CarouselPirateClothing
// 0x0020
struct FCarouselPirateClothing
{
	TArray<struct FCarouselPirateClothingItem>         AvailableItems;                                           // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FCarouselPirateClothingCategoryBias> Probabilities;                                            // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Athena.CarouselPirateGeneratorParams
// 0x00C8
struct FCarouselPirateGeneratorParams
{
	int                                                MinNumOfEachGender;                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MinNumOfEachEthnicity;                                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FCarouselPirateGroup>                Groups;                                                   // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FCarouselPirateGroup                        Default;                                                  // 0x0018(0x006C) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	struct FCarouselPirateClothing                     MaleClothing;                                             // 0x0088(0x0020) (Edit, BlueprintVisible)
	struct FCarouselPirateClothing                     FemaleClothing;                                           // 0x00A8(0x0020) (Edit, BlueprintVisible)
};

// ScriptStruct Athena.CatalogOfferRewardDataAsset
// 0x0010
struct FCatalogOfferRewardDataAsset
{
	class UClass*                                      Company;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FRewardId                                   Reward;                                                   // 0x0008(0x0008) (Edit)
};

// ScriptStruct Athena.CatalogOfferCompanyLevelDataAsset
// 0x0010
struct FCatalogOfferCompanyLevelDataAsset
{
	class UClass*                                      Company;                                                  // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           Level;                                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.CatalogOfferPrerequisitesDataAsset
// 0x0020
struct FCatalogOfferPrerequisitesDataAsset
{
	TArray<class UClass*>                              Entitlements;                                             // 0x0000(0x0010) (Edit, ZeroConstructor)
	TArray<struct FCatalogOfferCompanyLevelDataAsset>  CompanyLevel;                                             // 0x0010(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.EmblemId
// 0x0018
struct FEmblemId
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FGuid                                       Id;                                                       // 0x0008(0x0010) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.MerchantCrateItemInfoFaunaBreedRarityEntry
// 0x0018
struct FMerchantCrateItemInfoFaunaBreedRarityEntry
{
	class UClass*                                      FaunaBreed;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       Rarity;                                                   // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRewardId                                   HandInRewardId;                                           // 0x0010(0x0008) (Edit, DisableEditOnInstance)
};

// ScriptStruct Athena.MerchantCrateSfx
// 0x0020
struct FMerchantCrateSfx
{
	class UWwiseEvent*                                 EquipSfx;                                                 // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 UnequipSfx;                                               // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 WielderLandedJumpSfx;                                     // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 WielderFootstepLayerOneshot;                              // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.ShantyInstrumentData
// 0x0028
struct FShantyInstrumentData
{
	TEnumAsByte<EMusicalInstrumentType>                InstrumentType;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UWwiseEvent*                                 PlayLead;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 PlayAccompaniment;                                        // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 StopLead;                                                 // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 StopAccompaniment;                                        // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.ShantyData
// 0x0030
struct FShantyData
{
	struct FName                                       ShantyName;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FShantyInstrumentData>               InstrumentData;                                           // 0x0008(0x0010) (Edit, ZeroConstructor)
	int                                                LengthOfShantyInMs;                                       // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class UClass*                                      UnlockEntitlement;                                        // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               CanRandomPlay;                                            // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               DisableMigrationWhilePlaying;                             // 0x0029(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
};

// ScriptStruct Athena.CategoryDefaultsUnit
// 0x0018
struct FCategoryDefaultsUnit
{
	TArray<class FString>                              PartialStrings;                                           // 0x0000(0x0010) (Edit, ZeroConstructor)
	class UClass*                                      Category;                                                 // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.PlayerMusicController
// 0x00F8
struct FPlayerMusicController
{
	class UPlayerMusicControllerParams*                PlayerMusicParams;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class AActor*                                      LocalPlayerActor;                                         // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UPlayerOceanAudioComponent*                  PlayerOceanAudioComponent;                                // 0x0010(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UPlayerAtmosphericsAudioComponent*           AtmosphericsAudioComponent;                               // 0x0018(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class AAthenaPlayerCharacter*                      AthenaPlayerCharacter;                                    // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AAthenaWorldSettings*                        AthenaWorldSettings;                                      // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0030(0x00C8) MISSED OFFSET
};

// ScriptStruct Athena.NameActiveStatePair
// 0x000C
struct FNameActiveStatePair
{
	struct FName                                       StateName;                                                // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IsActive;                                                 // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.NamedStateSelector
// 0x0018
struct FNamedStateSelector
{
	TArray<struct FNameActiveStatePair>                NamedStates;                                              // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FName                                       DefaultStateName;                                         // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.StateCategoryGroup
// 0x0008 (0x0020 - 0x0018)
struct FStateCategoryGroup : public FNamedStateSelector
{
	struct FName                                       GroupName;                                                // 0x0018(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.DamageTypeToAudio
// 0x0028
struct FDamageTypeToAudio
{
	class UClass*                                      DamagerType;                                              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       AudioState;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 StartAudioEvent;                                          // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UWwiseEvent*                                 EndAudioEvent;                                            // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Duration;                                                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.HealthChangeAudio
// 0x0010
struct FHealthChangeAudio
{
	TEnumAsByte<EHealthChangedReason>                  Reason;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UWwiseEvent*                                 Sfx;                                                      // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CharacterSocketCollisionDesc
// 0x0028
struct FCharacterSocketCollisionDesc
{
	struct FName                                       SocketName;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x0008(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TEnumAsByte<ECharacterSocketCollisionTraceType>    TraceType;                                                // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              TraceDistance;                                            // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TraceOffset;                                              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ECharacterSocketCollisionResultType>   ResultType;                                               // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	int                                                FootIndex;                                                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.CharacterHitReactionDamagerTypeToAnimTypePair
// 0x0010
struct FCharacterHitReactionDamagerTypeToAnimTypePair
{
	class UClass*                                      DamagerType;                                              // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.CharacterSocketCollisionHandle
// 0x000C
struct FCharacterSocketCollisionHandle
{
	unsigned char                                      UnknownData00[0xC];                                       // 0x0000(0x000C) MISSED OFFSET
};

// ScriptStruct Athena.ClothingLoadout
// 0x0010
struct FClothingLoadout
{
	TArray<class UClass*>                              Items;                                                    // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Athena.CloudDomeParameters
// 0x0028
struct FCloudDomeParameters
{
	float                                              Width;                                                    // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DomeToTileProportion;                                     // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Height;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              HighPressureExtraHeight;                                  // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FadeProportion;                                           // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceCurvatureOvershoot;                               // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistantStreetCloudRotation;                               // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ProportionOfCloudDomeToAlwaysUpdate;                      // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                SplitRemainingCloudsOverThisManyUpdates;                  // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               UpdateClosestProportionEveryOtherFrame;                   // 0x0024(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               EnableDistanceCurvature;                                  // 0x0025(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0026(0x0002) MISSED OFFSET
};

// ScriptStruct Athena.CloudTileParameters
// 0x0020
struct FCloudTileParameters
{
	TArray<struct FCloudTypeDefinition>                Meshes;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                Samples;                                                  // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Seed;                                                     // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MeshScaleMultiplier;                                      // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ShouldCloudTileBeGenerated;                               // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
};

// ScriptStruct Athena.CloudWeatherParameters
// 0x0028
struct FCloudWeatherParameters
{
	struct FVector2D                                   DefaultCloudVelocity;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UMaterialParameterCollection*                AtmosphericMaterialParams;                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GlobalAtmosphericPressure;                                // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              AtmosphericPressureThresholdSize;                         // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxWindDelayLength;                                       // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WindSpeedMultiplier;                                      // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UsesGlobalWindService : 1;                                // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UsesPressureZones : 1;                                    // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      CloudsCastShadows : 1;                                    // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      PressureIsControlledByParameterCollection : 1;            // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.BlueprintableIntegerHandle
// 0x0004
struct FBlueprintableIntegerHandle
{
	int                                                Handle;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Athena.CoastObject
// 0x0038
struct FCoastObject
{
	class USplineComponent*                            CoastSplineInternal;                                      // 0x0000(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USplineComponent*                            InnerSplineInternal;                                      // 0x0008(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FVector                                     SplineOrigin;                                             // 0x0010(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
