#pragma once

// Sea of Thieves (1.4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_BP_Anim_PetMonkey_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Anim_PetMonkey.BP_Anim_PetMonkey_C
// 0x6F58 (0x7668 - 0x0710)
class UBP_Anim_PetMonkey_C : public UWieldablePetAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0710(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_C2CE96E74453BC142D679FA29E2E5E3A;      // 0x0718(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5E14B5D49CA93166AC5F4A9D1C7618D;// 0x0760(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C447884F4596B0F3167CC6B2E7DAA505;// 0x07A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A5E2116411D49FF98C527A2DB7E247A;// 0x07E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_464010C0433FC0EF1826E2B41EBB7D8F;// 0x0820(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C306CF0249D0FE50472529A943F84941;// 0x0860(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29F98BB1442BF04B05BD0F9FE2929D6A;// 0x08A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BC35DC04D4C99E23EFAB9AC386323B9;// 0x08E0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF20C50A45E2BB601AB285AA8CCEA8C6;// 0x0920(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6B73E72442EC4B0050ACDB8C7648A2A;// 0x0960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8163D8404FBAB7B56325828383E60895;// 0x09A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DBDFBFE44A2C82FD9A8EFBA9D5A8DD03;// 0x09E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2100A24D4B402986ED13008A8C3F664A;// 0x0A20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0BBEF6404084AD03446CDCA45FD4054D2;// 0x0A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BEF41B7C4A106CA609AAD4B04476ACBF;// 0x0AC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8FE7831246301D1DE191CC9C4AD711E1;// 0x0B18(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A8E1B3FF4C4DE9AA560F138976ACB0EF;// 0x0B60(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BAD736F54941881A971AC7B744D9B294;// 0x0BB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83E40CDC4A7BDB92258145AC8187E56A;// 0x0BF8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56D29A914E8EDC22B3DCEF82C53C4E05;// 0x0C38(0x0058)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FADA915F45B2717234C7528DFFC4428C;// 0x0C90(0x0058)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C5D79C15449BD4C30E72F69063A7889D;// 0x0CE8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CCC1B1524984C535B85947A987165825;// 0x0D98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB88903240D823C98F8FD6A75186E3D2;// 0x0DE0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E371AF5244C7E4338DA73F8F656C3C1D;// 0x0E38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60E8A496444D8655B1332F9E148DB780;// 0x0E80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A59E9F054E9863542A865BB1EC96FB8A;// 0x0EC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B235391A462BB6AF7019BDA61D2FC101;// 0x0F00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A9292254BC9CB74DC51E89894A92721;// 0x0F40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F62E3D24B39A7AD5FFB1DABA5B5EB01;// 0x0F80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98A4A6664D9D6A423F588DB4704F055E;// 0x0FC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86DDB76646F85CED9B70B7A031C9F135;// 0x1000(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F86F02F4502C65271A495AF1C719622;// 0x1040(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D7FE0658483EB84A77A95B8CDF6F9AED;// 0x1080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D60D87194B81FD598BC811975968ED01;// 0x10C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A30CCFD0445297253EFD479068753CA4;// 0x1100(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4528722A4335EA291A00428CF416D818;// 0x1140(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77EC0C4344CF8F95502D04ACDF4B7440;// 0x1180(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E30410904F713A7F407D9B8E86FF1A2C;// 0x11C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD51EBD24966F820542C42ADDB80BD82;// 0x1200(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB3A35A4449B9CD450F852B9E61E8144;// 0x1240(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9556A5CE432AD0FD8C426A9B7B4ECD4F;// 0x1280(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5A37455C45B409428D5A3398DC02DB2E;// 0x12C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A5303054BD13ED8676D0CA7F5064DC2;// 0x1300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B38849141DB0B83FDCAABA57A2FD061;// 0x1340(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A64748A463198FDA64CE3BA904E373C;// 0x1380(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_04C959F14C7390265E8E04BCF1876791;// 0x13C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_879A683E446335678DDBD289875B2507;// 0x1400(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5543B2D34C7180FDC464418EA2A2FA12;// 0x1440(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD7BE2024F53687FC2BEA699ED6809C5;// 0x1480(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_867295324FDA3EDB148904877B217ABB;// 0x14C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F6ECF8D4B59F1C1A46D0ABF8A523EEE;// 0x1500(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_85172B2E4D50454A20CAECB35E2AB735;// 0x1540(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6CA2ABD40A57B172E90E5883B20157D;// 0x1580(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C876F51B4A66B1E2FC3BF69CDCAA2EEB;// 0x15C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD980FBF4158B80D7E4D188D7633D0E8;// 0x1600(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D14FC13946321A433A9C55AD0419CE61;// 0x1640(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A3114FC14EDB6A94B5915A9E9F88427F;// 0x1680(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_846A0D7B49E3C42E8592848AD473710B;// 0x16C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5F1C8B64EEE500A2DB12DAB87F880DF;// 0x1700(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CDB1FA747D1D3ED26C5E88055556C24;// 0x1740(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BCF28C5948C75E3FC1D2418E0C3157C0;// 0x1780(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD69C13D4A8CC86DB5CCAFA4A8D44F61;// 0x17C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B623C7A34B17E4E6D9225B9F83FFD68B;// 0x1800(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ACCD12174928BE6F64192E831D8DC07F;// 0x1840(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0145E5074463E4B7240064B895EEE239;// 0x1880(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E5A5CD940F848C2A0FA6BAECF497FF6;// 0x18C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_991524CC441BA1702A599A9CBB8A087C;// 0x1900(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5C1CFC94B06DEB08D6581B9A0876983;// 0x1940(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_210DEDBC494CDA602B445380D6FC27E0;// 0x1980(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9A4825894C243437FFCBCFBF999AF4B6;// 0x19C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A682708042F0622371CBEFA4AEE74D0C;// 0x1A00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7E563144446C43F72C3234827B855338;// 0x1A40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED57BC7942201029119AD3A8D32021AF;// 0x1A80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_252632DC4893293D7B80E6B3F859214E;// 0x1AC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AEEF8CF4480705DA44500AEE3E10354;// 0x1B00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A85E8FB2420A5E935D4AE7B940F16452;// 0x1B40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2781090341655896FF7AE59287B97621;// 0x1B80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B846E6654ABB5F736D54068A1D01906A;// 0x1BC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B7B61B0D4E24346D9E5292933FFFAAFE;// 0x1C00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33C81F3242BCBB8CDE426CA2CA7F9E8E;// 0x1C40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32204CB1452FC341909525B4A2DB424F;// 0x1C80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A1437A1473093C837F4D683F8BDCD67;// 0x1CC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1CEC69E4A92B916E40B4193C1284661;// 0x1D00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1916A8B746964320C8266C88F30F7C3E;// 0x1D40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCFCB3ED4A691114431CAFBAB77331E3;// 0x1D80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA5A61D140E5BEEDA738BB96C968254F;// 0x1DC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E57F82FF46C670E2CE849F873DDBBC8C;// 0x1E00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30642E9F45ED0F2AB6C5A8809A8D3771;// 0x1E40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D361E3C94D3BF286F47C84BDF545D9EF;// 0x1E80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4717A9F24E99BA26D4D7CCA49775073F;// 0x1EC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C26874554D3EBF5C0EAE0895BFE047CB;// 0x1F00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FECB9DAF4B127EFF30CAEC89BDDB1568;// 0x1F40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D72ED1E6483A0EDABC3D1C858CAD66D7;// 0x1F80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FDE94F74EDA1676454CD7B5F61F7E02;// 0x1FC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94F3609243739323753CBC816DB0C7C0;// 0x2000(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B3AEF39483D86A7F29167A4DFCD8221;// 0x2040(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE411C4D42F782A225F73B8CC7B39ADE;// 0x2080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9038F4A40CEAB204D96BAA74269E633;// 0x20C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BE77D8F447C4997B5149FCA165AA7800;// 0x2100(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF7FFDC746FE3A7870BE76912C5F7A0F;// 0x2140(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C871EF63490DEC3DEF0D3F9CA388BEB6;// 0x2180(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4232F1458615D15387E6B9AD6B8F38;// 0x21C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52488D95455B906211C06698535313752;// 0x2200(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA7694F748D6D910B4E4A8879CAC39D8;// 0x2240(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A54C557432095922471C59FBD95DD86;// 0x2280(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B6FDD12C4649ACD18966AEB47A6CBADE;// 0x22C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3018E8E4BEFB3B174953FB1D54588F0;// 0x2300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20B1B2E749ED1271D65BA8B4E4B1BFCB;// 0x2340(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35490B6945754AE39D631C8AD44C7F65;// 0x2380(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03D74D4D4F2735299D9931A01437F733;// 0x23C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77187375470665C819E4BD93D6D6ABDE;// 0x2400(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A99;// 0x2440(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918119;// 0x2480(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E759;// 0x24C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF9;// 0x2518(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF449;// 0x2560(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B772010;// 0x25B8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F0CDA18246039B2AF3F2598D5035DEBD;// 0x2600(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5DC8E2F3459A475E80B87FAFC14BE150;// 0x26A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A98;// 0x26F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918118;// 0x2730(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E758;// 0x2770(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF8;// 0x27C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF448;// 0x2810(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77209;// 0x2868(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D6195E964584E4B45D56EC830151FC1C;// 0x28B0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_42FA4B564374386E355DF084AC158647;// 0x2958(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A97;// 0x29A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918117;// 0x29E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E757;// 0x2A20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF7;// 0x2A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF447;// 0x2AC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77208;// 0x2B18(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BDA6766543B48C9AAD5CF191773B6DC3;// 0x2B60(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DDB08CFD4FFB34F106723282688F5F3F;// 0x2C08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A96;// 0x2C50(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918116;// 0x2C90(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E756;// 0x2CD0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF6;// 0x2D28(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF446;// 0x2D70(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77207;// 0x2DC8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_78E98D654B3DEFBCDFA391A989E16AB2;// 0x2E10(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9616C6BA47AC0F8907D771A37A04D0C5;// 0x2EB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A95;// 0x2F00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918115;// 0x2F40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E755;// 0x2F80(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF5;// 0x2FD8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF445;// 0x3020(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77206;// 0x3078(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4B032B2B42D7D00BE434BD942FB7DA89;// 0x30C0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_977D67FB49E2A7EAE2B520BC07C10C4D;// 0x3168(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A94;// 0x31B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918114;// 0x31F0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E754;// 0x3230(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF4;// 0x3288(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF444;// 0x32D0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77205;// 0x3328(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4F8169EC4FB5B6F65BA94DA00AB98376;// 0x3370(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_79790C1842D9BDB52917908D5B5B54BE;// 0x3418(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A93;// 0x3460(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918113;// 0x34A0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E753;// 0x34E0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF3;// 0x3538(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF443;// 0x3580(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77204;// 0x35D8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5D975D9B4118AA3C560D46A51EA7CADA;// 0x3620(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FFE88E4B4D5685353A39DC9040176741;// 0x36C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A92;// 0x3710(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E620918112;// 0x3750(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E752;// 0x3790(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF2;// 0x37E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF442;// 0x3830(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77203;// 0x3888(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0DEC0D1F45837DB416235BB575C7357D;// 0x38D0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5D19ACAC48DD4A110F19BD810BEF6710;// 0x3978(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_654607E348D0783339ACF39E2697A91E;// 0x39C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B2C22FFA47CF5C39BBC014B6C0E4DEF1;// 0x3A18(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FB5E6DD24F5F99294AC6B2A76F784707;// 0x3A60(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3CA820C1492F04583ADE7AB10A015567;// 0x3AB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1EF57256492A727442505A8A940FD560;// 0x3B00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E60C3D2349D9DFBDD78E4C8D97281EAA;// 0x3B58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8AC1F80F48072FA82BF4C4A274D3B901;// 0x3BA0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6A8567594AF521063ED0A2AD2D379B2A;// 0x3BF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C7F931604C9A848532058E910503E1CF;// 0x3C40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E0CA4A0D4E39532D3F83DC9CB0B4E0DD;// 0x3C80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D68A419344FAF0FB39B5779AC41255D0;// 0x3CC0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_314571E348BFCDE44F7720BAB88E17CE;// 0x3D00(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7387558E42A114E93CA21C88CF593435;// 0x3D58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5779ED0E435379237DD5888737B5585F;// 0x3DA0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_83B688694A82182C31200BAAF6B82B4C;// 0x3DF8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_89665B6341B51E4E9F2568BBA2042AB5;// 0x3E40(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_720E13B04884F33C3995659F810D9150;// 0x3EE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_097D24064EBB0B0077B9C89829F18D26;// 0x3F30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C22EF4C4C502A1A72C365854405F83B;// 0x3F70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93E5151A47A8AC5EC458599A28F18ED7;// 0x3FB0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3FC53BF43AE01348ECBB1B1C38789CA;// 0x3FF0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_771FCAD34DF4C6DF21F248A9847F4DF0;// 0x4048(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_66C4A22B4FD031B0CE6C89B558013679;// 0x4090(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D88AA4384B86BA51E55510AC5D64695F;// 0x40E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E1C964D4BAB970D167F5D83F85B0AB1;// 0x4130(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8E1EA6AD41285036F97AE8B847F30A6C;// 0x4170(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4C4BBF454CC4780B6E4B4F90443CEAE5;// 0x41C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B4748D514B58E1505D0E5C8398D4AD4C;// 0x4210(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_98FE54C944B81AC7723861A292BBE9C4;// 0x4268(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DF0A871F4FBECCB8E9A949B2F0E7875C;// 0x42B0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F434A55479C21383D836391B8360B71;// 0x4358(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6836020A4FE7EA875324DD9F2042E1C9;// 0x43A0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_122C1D1241DFAA0A2544F882684253B4;// 0x43F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0EA6D7F648013DA57AE2F8BC34240388;// 0x4440(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AFCECE284F273F09C4EAA7B9261A5437;// 0x4498(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A2E864E447BFA7FA05F2B866FB68F07;// 0x44E0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0CF37ED450D6F6C8655619F6AE867C9;// 0x4538(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CF44685A41EF3607C630B793024CE68F;// 0x4580(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BDC09D2B4E8AD7AE0D78ABBBCACAA5E6;// 0x45D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2310BAE84BFA4AF8A6026383809FD552;// 0x4620(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B9400D02430E1E659D75E59262C4FA67;// 0x4678(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E06C7E5C461E86DCF70F6093B83CD614;// 0x46C0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4DFEA8994BE8183C2AAA929FAF57CB24;// 0x4718(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D0F86B854514274E3214E88620FCC5C0;// 0x4760(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0BBEF6404084AD03446CDCA45FD4054D;// 0x47B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_754B45B44218BDBAB61662ACC885DB84;// 0x4800(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B1923AA34EBB0888760C2FB37287F8DD;// 0x4858(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_629CA4DA42E98BD7C164399CC9A248F5;// 0x48A0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8C9121C1457E411EC2E8E9BCD18F5596;// 0x49A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5AD043E941ED5C4CD76C4CBC8703BBB3;// 0x49F0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9535D1C7452D76EDBF85128884B9E0E8;// 0x4A48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A544737245CA918AC8D936B3AD812B36;// 0x4A90(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9C0EBBA141DDBAC1381F38AD2990BA45;// 0x4AE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B4D985A4D2AD6DFF54482B4AEB67210;// 0x4B30(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2FC462264102F822E4581A92056B0B9B;// 0x4B88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE84;// 0x4BD0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA6A8D5440B9B483477B7E8927C8A68B;// 0x4C10(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA4;// 0x4C68(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_89521E614D917C6C1387D7AA4AED4464;// 0x4CB0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB94;// 0x4D08(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6917FEDC46C265E1908772A23D3749D6;// 0x4D50(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4493CA434FF5EA59FF0DDFB19EA444C4;// 0x4DF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE83;// 0x4E40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B24231C54DC86F92829D328A9D903396;// 0x4E80(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA3;// 0x4ED8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0EE9B50F4ADF3337402B7A8FC4C25D28;// 0x4F20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB93;// 0x4F78(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D1C657054827D8DBDD52EDA418A92F0D;// 0x4FC0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4F9FB95E4181F181BEEF2E83C3195006;// 0x5068(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AA5C6C3B4FBB07A9310308A6B970735F;// 0x50B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7BE661FE4F43C40047CA01AFCDFB3E66;// 0x5108(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_72120D0D48D10DAE7BBA0F9B34D5F22E;// 0x5150(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_477587D144B5EDCAA90394BC22673129;// 0x51A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B141520848FE48C546BD3884CC7BC96A;// 0x51F0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4EB9434843D78F7B1A81DC96BE4B0178;// 0x5248(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04D88A1046486E8C1E00EFB3C994A1EE;// 0x5290(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7AAD7DED49425D76D880C8A5C948B20C;// 0x52E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3964B0A843F85F61C84B32A6755EB2AA;// 0x5330(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_620CD22641DED8C3FC87F2818CF1DAA3;// 0x5388(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_866596C24B0BE1EF97289D96152CBB3D;// 0x53D0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A59FF89846A73229A8C818B875F9769C;// 0x5428(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BAF6E4A34ADB004D84BDAA8FF5B60C16;// 0x5470(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_440B378C432A0164B3B1C2B70F9B8C8F;// 0x54C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D19251D94A51335B9A4A13B7F20A0EEB;// 0x5510(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_329A56F248A29B9FC3E2BD91AC1A6180;// 0x5568(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B2CCCEAF4724BDB6AF4F36B664BBB70C;// 0x55B0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6A3F5B4D4970EFE3A79D96933528EB2B;// 0x5608(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F73617194B35DB1D76BDC789DCEEE884;// 0x5650(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_07C9E32B410A3928CCEB0FA1E37F9CDB2;// 0x56A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE82;// 0x56F0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7AE02F4746F3BF7CFBC33795AD0EA338;// 0x5730(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA2;// 0x5788(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AA42107E4C70DE2186082ABA6CC6B24D;// 0x57D0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB92;// 0x5828(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_57964E5640053928C566609C0C476E852;// 0x5870(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C6A7DB4F487C5016D69887A7D72D80F02;// 0x5918(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9689B5A4C3BB49BB73E7F933B0C2B1F;// 0x5960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F5BC345450A12784D8F87A6A19124A9;// 0x59A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F134FE24CB83EB4BC58FC8E62091811;// 0x59E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD7061F845D192AC7F18BFB49B137E75;// 0x5A20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1A873C5F4C4B86926131DDA61C3F42AF;// 0x5A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BDF526674A846D513F2F94A764B8EF44;// 0x5AC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B77202;// 0x5B18(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BC15BAED48E24F4CC719068E38D0E302;// 0x5B60(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0C872364429A7C29536A3C9E06439031;// 0x5C08(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B976B710493EF408B68794B70C07F9C4;// 0x5C50(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_076BABF54A21D844310FBEA603AF0743;// 0x5CF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F7AB72AF4C8D55ED0D7BB9B5F67DF6D8;// 0x5D40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_237511784B144993FCB1379E1EB39EE02;// 0x5D80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E0EDE89A482F035A29EA2D86C20E6B90;// 0x5DC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44376B314A106BABF5EEBF8135BFEC7B2;// 0x5E00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76D021F047BB19C0732B289AE48A375C;// 0x5E40(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_12D300C642734B62B2D6139993874BFD;// 0x5E80(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C3F81EB14D8770E016695D9287B605F6;// 0x5F88(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1AE224834A4418B4D2E5FB8A1836E46C2;// 0x5FD0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B7E16ADE403A6333FF78B8B9FB2A559D2;// 0x6028(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E9C1745487D3E025824CE94B6B274642;// 0x6070(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5FF04AD44D3FBF54566AD1B8C61BD21F2;// 0x60C8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9EE7794840EEFF1692263084CDCFAA41;// 0x6110(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_375B182343B34140FEAA59994E68B168;// 0x61B8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1BC9B1514443B20ED5629A86CA06F2EE;// 0x6228(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC97545C448E1D4350F93A80D0D9F276;// 0x62D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FDF859E4DF20300A8BC028A89D9A702;// 0x6318(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_253FEA80468B79AC0F61D0B0EFDFF7AC;// 0x6358(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D2CF643428498890674C0802E023D4C;// 0x6398(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_99FC788D438155EAFD7B1E91329B4B19;// 0x63D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10FC25604347C74B7B5000821FE389C3;// 0x6418(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C98B1994C05E4252F2FE4A4E535AEA3;// 0x6458(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_566CEE0F40297EA1F3C608A70BC25ED7;// 0x6498(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9442CA2A4B1DA3B89208A88743C00140;// 0x64D8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_838978C14E639E314854248E855C2286;// 0x6530(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A33408C049617328182CEC8FD37D4AE2;// 0x6578(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7035E93A4211B3044622C18F1EBBD7A1;// 0x65D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B92BBBA14B439D2B89E727A65D6DA506;// 0x6618(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_03FA4AA44D85E207016FE896B6CABAEE;// 0x6670(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3603E93F45D55F688DC352A8A2944AF0;// 0x66B8(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EA33407A4592EAC76556A5A51392E06E;// 0x6710(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4353D6C24348B435736EA09DFE28ABC8;// 0x6758(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3F7334DD464F2D098B6F1685009427CC;// 0x6798(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C966EDC440B33018C6C8BE819C1377B4;// 0x6840(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90A1031D41CD1E055B5CB6A2C506D545;// 0x6880(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB5A066D4402E61D723CA2856742B5DD;// 0x68C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D77246C48209E160156DF97BC612EDB;// 0x6900(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D2DD3AB4A40CC2DA18F2CAEF0CA47DE;// 0x6940(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52488D95455B906211C0669853531375;// 0x6980(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51864FDF473394B24ECDCB83FBB887E4;// 0x69C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CD83675433917B40D4D62BDB4D13221;// 0x6A00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71180B5848E0B5D260418595D40B4448;// 0x6A40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4DA0DB2C4D170240A5D522AA7784325C;// 0x6A80(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0ADA64E14DC5CF4D6E97A0A4143310A8;// 0x6AC0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_07C9E32B410A3928CCEB0FA1E37F9CDB;// 0x6B18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F3DD3D41BC39DF21039C9C3B845CE8;// 0x6B60(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20D62F114A2750DFA3E20FB308A0E1F7;// 0x6BA0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_04F89A414E8BA3807388CCB694A13FEA;// 0x6BF8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD56E95842BC63E29B37D78F6359EB49;// 0x6C40(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B0A81A9C4E4A8758E5329B941851FAB9;// 0x6C98(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_57964E5640053928C566609C0C476E85;// 0x6CE0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C6A7DB4F487C5016D69887A7D72D80F0;// 0x6D88(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_55366DB748C4978D45056B8323AD2B90;// 0x6DD0(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AB83E9944E3A2843BF04DDBC14A161A7;// 0x6ED8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_33B721FF4FBDF8EA99BE699F9321EF9D;// 0x6F20(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1433896B422DD02F722E888BCA82B256;// 0x6F78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_237511784B144993FCB1379E1EB39EE0;// 0x6FC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44376B314A106BABF5EEBF8135BFEC7B;// 0x7000(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1AE224834A4418B4D2E5FB8A1836E46C;// 0x7040(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B7E16ADE403A6333FF78B8B9FB2A559D;// 0x7098(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E9C1745487D3E025824CE94B6B27464;// 0x70E0(0x0058)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5FF04AD44D3FBF54566AD1B8C61BD21F;// 0x7138(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9686E1AB453C8231555FA691ECE91566;// 0x7180(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D46E92824B64C7170631528AD18B7720;// 0x7228(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1DEF106A4629BE203143D2AB248EBAE2;// 0x7270(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99879163458DB39050F11B8F371FC8B5;// 0x7318(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D3C843E5464DFEE227EA7EACF913C662;// 0x7360(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1DF6CC67470D4F2EB38FFF9F88AC9E6F;// 0x73A8(0x00A8)
	struct FPetAnimationDataBeingHeld                  PetHeldAnimations;                                        // 0x7450(0x0098) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPetAnimationDataRoaming                    PetRoamingAnimations;                                     // 0x74E8(0x0180) (Edit, BlueprintVisible, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("AnimBlueprintGeneratedClass BP_Anim_PetMonkey.BP_Anim_PetMonkey_C"));
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetMonkey_AnimGraphNode_TransitionResult_D5E14B5D49CA93166AC5F4A9D1C7618D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetMonkey_AnimGraphNode_TransitionResult_C447884F4596B0F3167CC6B2E7DAA505();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetMonkey_AnimGraphNode_TransitionResult_464010C0433FC0EF1826E2B41EBB7D8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetMonkey_AnimGraphNode_TransitionResult_C306CF0249D0FE50472529A943F84941();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_PetMonkey_AnimGraphNode_TransitionResult_29F98BB1442BF04B05BD0F9FE2929D6A();
