#pragma once

// Sea of Thieves (2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Basic.hpp"
#include "SoT_DS_FateOfTheMorningstar_IslandPuzzleSet_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct DS_FateOfTheMorningstar_Variables.DS_FateOfTheMorningstar_Variables
// 0x01B8
struct FDS_FateOfTheMorningstar_Variables
{
	class AActor*                                      ResolvedSarcophagusLocation_13_8BE30A2E467CFF15732A90911DDBE1BA;// 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      TempChestHandInLocation_2_6AEA7CA5493A244EA7F4DA8B346D8B34;// 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      TempChest_5_6C6184D84AE0162F3E79859451E119D3;             // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCProxyFerryman_16_4422AE2B4CAFBC61741961882AE00B47;     // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCFerryman_19_6E3FC1704315C230913C2BA24E5ED089;          // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCGhostEli_62_EF63E307414AE1C8227EAC874411B849;          // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCProxyGhostEli_63_9C388C64468FDC628404B09658DA9A4C;     // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCGhostDinger_65_A938A5964F78F28A2A36B79FB25A7F46;       // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCProxyDinger_66_E6CFD20A47110EDC25EB7B92018997D1;       // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCGhostFontaine_67_A1D5613347D83C331F182D94950FBB14;     // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCProxyGhostFontaine_68_CB76DBF845892086C07A7AB35173EEF7;// 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      NPCFreeSouls_71_2D9FF99B4FC8410F0962729E70BA45DC;         // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ProxyNPCFreeSouls_74_EA8A6EE64BD5372976221E91E6BBC3CE;    // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FDS_FateOfTheMorningstar_IslandPuzzleSet    IslandPuzzle_77_2BEE9C8B435671536C9B0EBD7CE4080F;         // 0x0068(0x00F8) (Edit, BlueprintVisible)
	class AAthenaPlayerCharacter*                      LanternCollector_80_65B2DDC44B29927D448343811EDEEFD1;     // 0x0160(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UQuestBookPageBundle*                        SelectedQuestBookBundle_83_61BF87D544F75C22FEA0F6B3C50D32C4;// 0x0168(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      ResolvedSarcophagusMusicZone_86_64A938264F39B98D602A2A92C1380E23;// 0x0170(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AItemInfo*                                   SkeletonKey_89_0DED7A54461F3AC2A9D47CBF083AC434;          // 0x0178(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      SarcophagusIslandMusicZone_92_E85E27524ECCB4D8B801809B4EB64818;// 0x0180(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      DingerChestMusic_105_1130D0484689243D41526C903D126BDC;    // 0x0188(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      DingerChestVo_106_35A94B8249C73891FCDC1D91C0CEF1DB;       // 0x0190(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      FontaineChestMusic_107_3EA592734728F1F76B9180A03C9B55B6;  // 0x0198(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      FontaineChestVo_108_D51FF1914FCC9E127C980A94FFF731B2;     // 0x01A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      EliChestMusic_109_B8B1293744FB0293659986A5400C083E;       // 0x01A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AActor*                                      EliChestVO_110_314A01BF40157C2AF87A88B0D3BC3B0E;          // 0x01B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
